[{
        "id": 1,
        "title": "Kỷ Hồng Bàng Thị",
        "description": "Kỷ Hồng Bàng Thị. Theo truyền thuyết thì thủy tổ dân tộc Việt Nam là Kinh Dương Vương, hiện còn có mộ tại làng An Lữ, Thuận Thành, Bắc Ninh. Kinh Dương Vương làm Vua vào khoảng năm Nhâm Tuất (hơn 2000 năm trước Công nguyên). Kinh Dương Vương lấy con gái Thần Long là Vua hồ Động Đình sinh một con trai đặt tên là Sùng Lãm, sau nối ngôi vua cha niên hiệu là Lạc Long Quân. Lạc Long Quân lấy con gái Đế Lai là Âu Cơ sinh ra một bọc một trăm trứng, một trăm trứng nở ra một trăm người con trai là tổ tiên của người Bách Việt. Một hôm nhà Vua bảo bà Âu Cơ: \"Ta là giống Rồng, nàng là giống Tiên, thủy hỏa khắc nhau, chung hợp thật khó\". Bèn từ biệt, chia năm chục người con theo mẹ lên núi , năm chục người con theo cha về phía Nam miền biển, phong cho con trưởng làm Hùng Vương nối ngôi. Hùng Vương lên ngôi Vua, đặt quốc hiệu là Văn Lang, đóng đô ở Phong Châu (Bạch Hạc, Phú Thọ), chia nước ra làm 15 bộ. Các đời Vua sau đều gọi là Hùng Vương, có 18 đời vua Hùng Vương(*) . Đặt các tướng văn gọi là Lạc Hầu, tướng võ gọi là Lạc Tướng, con trai vua gọi là Quan Lang, con gái Vua gọi là Mỵ Nương, các quan nhỏ gọi là Bồ Chính. Nhà nước Văn Lang của các Vua Hùng là nhà nước phôi thai đầu tiên của Việt Nam, còn rất đơn giản, mặc dù mới hình thành nhưng đã cố kết được lòng người. Từ tình cảm cộng đồng dẫn đến ý thức cộng đồng, thể hiện rõ tình đồng bào ruột thịt. Họ bước đầu hiểu được mối quan hệ giữa thiên nhiên và con người, thấy được sức mạnh của cộng đồng trong việc làm thủy lợi, trao đổi sản phẩm và đấu tranh giữ gìn bản làng, đất nước. Thời đại Hùng Vương có hai truyền thuyết được loan truyền mãi trong dân gian thể hiện rõ tinh thần đoàn kết của cộng đồng các dân tộc Việt."
    }, {
        "id": 2,
        "title": "Kỷ Nhà Thục",
        "description": "Kỷ Nhà Thục. Thục Phán thủ lĩnh của người Âu Việt (phía Bắc nước Văn Lang) hợp nhất với nước Văn Lang của người Lạc Việt, xưng là An Dương Vương đặt quốc hiệu là nước Âu Lạc, đóng đô tại Cổ Loa (Đông Anh, Hà Nội). Năm 218 TCN, Tần Thủy Hoàng huy động 50 vạn quân, chia làm 5 đạo, đi chinh phục Bách Việt, chỉ huy đạo quân Tần là viên tướng lừng danh Đồ Thư. Các Lạc Tướng đã suy tôn Thục Phán là lãnh tụ chung để chỉ huy cuộc kháng chiến chống quân Tần. Người Việt làm chiến tranh du kích, vườn không nhà trống, bền bỉ kháng chiến suốt gần 10 năm, đợi khi quân Tần lâm vào tình trạng mệt mỏi, chán nản và khổ sở vì thiếu lương thực và ốm đau nhiều vì không hợp thủy thổ, lúc đó Thục Phán mới tổ chức phản công quân Tần, bắn chết Đồ Thư. Mất tướng chỉ huy, quân Tần mở đường máu tháo chạy về nước. Sau chiến công vĩ đại đánh thắng 50 vạn quân Tần, An Dương Vương tổ chức xây thành Cổ Loa. Thành có 9 vòng, chu vi vòng ngoài 8km, vòng giữa 6,5 km, vòng trong cùng 1,6 km. Với vị trí thuận lợi, với cách bố trí thành có 9 lớp, xoáy trôn ốc, thành cao, hào sâu, có các ụ cao khô vượt ra ngoài lũy để có thể từ cao bắn xuống, với vũ khí nỏ thần và những mũi tên đồng lợi hại, sức mạnh quân sự tổng hợp của thành Cổ Loa làm cho quân thù khiếp sợ thể hiện trí tuệ quân sự tuyệt vời của tổ tiên ta. Ở ngoại thành Hà Nội ngày nay, vẫn còn thấy dấu tích 3 lớp thành Cổ Loa thời An Dương Vương"
    }, {
        "id": 3,
        "title": "Kỷ Thuộc Tây Hán",
        "description": "Kỷ Thuộc Tây Hán. Tân Mùi, [110 TCN], (Hán Nguyên Phong năm thứ 1). Nước Việt ta đã thuộc về nhà Hán. Nhà Hán cho Thạch Đái làm Thái Thú 9 quận. (Chế độ nhà Hán lấy châu lãnh quận, trừ hai quận Châu Nhai, Đạm Nhĩ đều ở giữa biển, còn 7 quận thuộc về Giao Châu, Đái làm châu Thái thú63. Thời Tây Hán, trị sở của Thái Thú đặt tại Long Uyên, tức là Long Biên, thời Đông Hán đặt tại Mê Linh tức là Yên Lăng.)"
    }, {
        "id": 4,
        "title": "Triệu Vũ Vương - Triệu Đà",
        "description": "Triệu Vũ Vương - Triệu Đà. Họ Triệu, nhân lúc nhà Tần suy loạn, giết trưởng lại Tần, chiếm giữ đất Lĩnh Nam, xưng đế, đòi ngang với nhà Hán, hưởng nước truyền ngôi 100 năm mới mất, cũng là bậc vua anh hùng. Họ Triệu, tên húy là Đà, người huyện Chân Định nước Hán, đóng đô ở Phiên Ngung (nay ở tỉnh Quảng Đông). Giáp Ngọ, năm thứ 1 [207 TCN] , (Tần Nhị Thế năm thứ 3). Vua chiếm lấy đất Lâm Ấp và Tượng Quận, tự lập làm Nam Việt Vương."
    }, {
        "id": 5,
        "title": "Triệu Văn Vương - Triệu Hồ",
        "description": "Triệu Văn Vương - Triệu Hồ. Triệu Văng Vương Tên húy là Hồ, con trai Trọng Thủy, cháu Vũ Đế. Vua lấy nghĩa để cảm nước láng giềng, đánh lui địch, yên biên cảnh, cũng gọi là bậc vua có ý muốn thịnh trị vậy. Bính Ngọ, năm thứ 2 [135 TCN], (Hán Kiến Nguyên năm thứ 6). Mùa thu, tháng 8, có sao Chổi mọc ở phương đông, đuôi dài hết trời. Mân Việt Vương Sính xâm lấn biên ấp nước ta. Vua giữ ước với nhà Hán, không tự tiện dấy quân, sai người đem thư nói việc đó với nhà Hán. Nhà Hán khen là nghĩa, vì vua mà phát đại binh, sai Vương Khôi xuất quân từ Dự Chương, Hàn An Quốc xuất quân từ Cối Kê, để đánh Mân Việt."
    }, {
        "id": 6,
        "title": "Triệu Minh Vương - Triệu Anh Tề",
        "description": "Triệu Minh Vương - Triệu Anh Tề. Minh Vương Ở ngôi 12 năm. Vua không cẩn thận mối vợ chồng, gây thành loạn cho quốc gia, không có gì đáng khen. Tên húy là Anh Tề, con trưởng của Văn Vương. Đinh Tỵ, năm thứ 1 [124 TCN], (Hán Nguyên Sóc năm thứ 5). Lấy Lữ Gia làm Thái phó. Kỷ Mùi, năm thứ 3 [122 TCN], (Hán Nguyên Thú năm thứ 1). Mùa hạ, tháng 5, ngày 30, nhật thực. Nhâm Tuất, năm thứ 6 [119 TCN], (Hán Nguyên Thú năm thứ 4). Mùa xuân, sao Chổi mọc ở phía đông bắc. Mùa hạ, sao Chổi dài mọc [12b] ở phương tây. Ất Sửu, năm thứ 9 [116 TCN], (Hán Nguyên Đỉnh năm thứ 1). Mậu Thìn, năm thứ 12 [113 TCN], (Hán Nguyên Đỉnh năm thứ 4). Trước kia vua làm thế tử, sang làm con tin cho nhà Hán ở Trường An, lấy con gái người họ Cù ở Hàm Đan, sinh con tên là Hưng. Đến khi lên ngôi, giấu ấn của tiên đế đi, dâng thư sang nhà Hán xin lập Cù thị làm hoàng hậu, Hưng làm thế tử. Nhà Hán mấy lần sai sứ giả sang khuyên vua vào chầu. Vua sợ vào yết kiến phải theo pháp độ nhà Hán ngang với các chư hầu ở trong, cố ý cáo ốm không đi, bèn sai con là Thứ công vào làm con tin. Năm ấy vua mất, thụy là Minh Vương. Con là Hưng nối ngôi."
    }, {
        "id": 7,
        "title": "Triệu Ai Vương - Triệu Hưng",
        "description": "Triệu Ai Vương - Triệu Hưng. Ở ngôi 1 năm [112 TCN]. Tên húy là Hưng, con thứ của Minh Vương. Năm ấy, vua đã lên ngôi, tôn mẹ là Cù thị là thái hậu. Trước kia, thái hậu chưa lấy Minh Vương, đã từng thông dâm với An Quốc Thiếu Quý người Bá Lăng. An Quốc là họ, Thiếu Quý là tên. Năm ấy nhà Hán sai An Quốc Thiếu Quý sang dụ vua và thái hậu vào chầu, như đối với các chư hầu ở trong, lại sai biện sĩ là bọn Gián nghị đại phu Chung Quân tuyên dụ, dũng sĩ là bọn Ngụy Thần giúp việc, vệ úy Lộ Bác Đức đem quân đóng ở Quế Dương để đợi sứ giả. Khi ấy vua còn ít tuổi, Cù hậu là người Hán, Thiếu Quý đến, lại tư thông. Người nước biết, phần nhiều không theo thái hậu. Thái hậu sợ loạn nổi, muốn dựa uy nhà Hán, nhiều lần khuyên vua và các quan xin nội phụ nhà Hán. Bèn nhờ sứ nhà Hán dâng thư, xin theo như các chư hầu ở trong, cứ 3 năm một lần vào chầu, triệt bỏ cửa quan ở biên giới. Vua Hán bằng lòng, ban cho vua và tướng Lữ Gia ấn bằng bạc và các ấn nội sử, trung úy, thái phó, còn các chức khác được tự đặt lấy. Bỏ hình phạt cũ thích chữ, cắt mũi, dùng pháp luật nhà Hán như các chư hầu ở trong. Các sứ giả đều ở lại để trấn giữ vỗ về."
    }, {
        "id": 8,
        "title": "Triệu Thuật Dương Vương - Triệu Kiến Đức",
        "description": "Triệu Thuật Dương Vương - Triệu Kiến Đức. Triệu Kiến Đức ở ngôi được gần 1 năm. Năm 113 trCN nội tình nhà Triệu rất rối ren, Vua Hán sai An Quốc Thiếu Quý sang dụ Nam Việt về hàng. Thiếu Quý nguyên là tình nhân của Cù Thị (mẹ của An Vương) nên tư thông với nhau và dụ dỗ Ai Vương dâng nước Nam Việt cho nhà Hán. Tể tướng Lữ Gia đã cùng với một số đại thần đem quân cấm binh vào giết chết sứ nhà Hán. Cù Thị và Ai Vương tôn Kiến Đức là con trưởng của Minh Vương lên làm vua. Vũ Đế nhà Hán sai Phục ba tướng quân Lộ Bác Đức và Dương Bộc đem 5 đạo quân sang xâm lược Nam Việt. Tể tướng Lữ Gia chống không nổi bèn đưa Dương Vương chạy trốn. Quân Hán đuổi theo bắt được. Vua tôi đều bị hại. Nhà Hán chiếm được Nam Việt, đổi là Giao Chỉ bộ."
    }, {
        "id": 9,
        "title": "Hai Bà Trưng",
        "description": "Hai Bà Trưng. Trưng Vương tên húy là Trắc, họ Trưng. Nguyên là họ Lạc, con gái của Lạc tướng huyện Mê Linh, Phong Châu, vợ của Thi Sách ở huyện Chu Diên. (Thi Sách cũng là con Lạc tướng, con hai nhà tướng kết hôn với nhau. Sách Cương mục tập lãm lấy Lạc làm họ là lầm). Đóng đô ở Mê Linh. Canh Tý, năm thứ 1 [40], (Hán Kiến Vũ năm thứ 16). Mùa xuân, tháng 2, vua khổ vì Thái thú Tô Định dùng pháp luật trói buộc, lại thù Định giết chồng mình, mới cùng với em gái là Nhị nổi binh đánh hãm trị sở ở châu. Định chạy về nước. Các quận Nam Hải, Cửu Chân, Nhật Nam, Hợp Phố đều hưởng ứng, lấy được [2b] 65 thành ở Lĩnh Nam, tự lập làm vua, mới xưng là họ Trưng."
    }, {
        "id": 10,
        "title": "Kỷ Thuộc Đông Hán",
        "description": "Kỷ Thuộc Đông Hán. Quý Mão, [Trưng Vương, năm thứ 4], (Hán Kiến Vũ năm thứ 19). Mùa xuân, tháng giêng, Trưng Nữ Vương cùng em gái là Nhị chống cự lại với quân nhà Hán, thế cô, đều thua chết. Mã Viện đuổi theo đánh quân còn sót là bọn Đô Dương. Đến huyện Cư Phong thì [bọn Đô Dương] đầu hàng, [Viện] bèn dựng cột đồng làm giới hạn cuối cùng của nhà Hán. (Cột đồng tương truyền ở trên động Cổ Lâu châu Khâm. Viện có câu thề: \"Cột đồng gãy thì Giao Châu diệt\". Người Việt ta đi qua dưới cột ấy, thường lấy đá chất vào, thành như gò đống, vì sợ cột ấy gãy. Mã Tổng nhà Đường lại dựng hai cột đồng ở chỗ cũ của nhà Hán ghi công đức của Mã Viện để tỏ ra mình là dòng dõi của Phục Ba, nay chưa rõ ở chỗ nào. Hai sông Tả Giang, Hữu Giang mỗi nơi có một cột). Viện thấy huyện Tây Vu có 3 vạn 3 nghìn hộ, xin chia làm hai huyện Phong Kê và Vọng Hải, vua Hán nghe theo. Viện lại đắp thành Kiển Giang ở huyện Phong Khê. Thành đắp tròn như hình cái kén, cho nên lấy [chữ Kiển]làm tên. Nước Việt ta lại thuộc vào nhà Hán. Ba năm sau, Viện trở về. Người địa phương thương mến Trưng Nữ Vương, làm đền thờ phụng (đền ở xã Hát Giang, huyện Phúc Lộc, ở đất cũ thành Phiên Ngung cũng có)."
    }, {
        "id": 11,
        "title": "Kỷ Sĩ Vương - Sĩ Nhiếp",
        "description": "Kỷ Sĩ Vương - Sĩ Nhiếp. Sĩ Vương họ Sĩ, tên húy là Nhiếp, tự là Ngạn Uy, người huyện Quảng Tín, quận Thương Ngô. Tổ tiên người Vấn Dương nước Lỗ, hồi loạn Vương Mãng ở Bắc triều, tránh sang ở đất Việt ta, đến vương là sáu đời. Cha là Tứ, thời Hán Hoàn Đế làm Thái thú Nhật Nam. Khi còn ít tuổi, vương du học ở kinh đô nhà Hán, theo học Lưu Tử Kỳ người Dĩnh Xuyên, chuyên trị sách Tả thị Xuân Thu, có làm chú giải: được cử hiếu liêm, bổ làm Thượng thư lang, vì việc công bị miễn chức; hết tang cha, lại được cử mậu tài, bổ làm Huyện lệnh Vu Dương, đổi làm Thái thú Giao Châu, được tước Long Độ Đình hầu, đóng đô ở Liên Lâu (tức là Long Biên). Sau nhà Trần truy phong làm Thiên Cảm Gia Ứng Vũ Đại Vương. Đinh Mão, năm thứ 1 [187], (Hán Trung Bình năm thứ 4). Vương có ba em trai tên là Nhất, Vĩ và Vũ. Bấy giờ Thứ sử Chu [8b] Phù bị giặc Di giết chết, châu quận rối loạn, vương bèn dâng biểu cử Nhất làm Thái thú Hợp Phố, Vĩ làm Thái thú Cửu Chân, Vũ làm Thái thú Nam Hải. Vương độ lượng khoan hậu, khiêm tốn, kính trọng kẻ sĩ, người trong nước yêu mến, đều gọi là vương. Danh sĩ nhà Hán tránh nạn sang nương tựa có hàng trăm người."
    }, {
        "id": 12,
        "title": "Kỷ thuộc Đông Ngô",
        "description": "Kỷ thuộc Đông Ngô. Đinh Mùi, [227], (Hán Kiến Hưng năm thứ 5; Ngô Hoàng Vũ năm thứ 6), Vua Ngô nghe tin Sĩ Nhiếp mất, thấy Giao Châu ở xa cách, mới chia từ quận Hợp Phố trở về bắc thuộc vào Quảng Châu, cho Lữ Đại làm Thứ sử; từ quận Hợp Phố trở về nam thuộc vào Giao Châu, cho Đái Lương làm Thứ sử. Lại sai Trần Thì làm Thái thú thay Sĩ Nhiếp. Đại ở lại Nam Hải. Lương và Thì cùng lên đường. Đến Hợp Phố nghe tin ở Giao Châu con Sĩ Nhiếp là Huy đã tự làm Thái thú, đem tông binh ra chống cự. (Cuối thời nhà Hán, tôn thất nổi loạn, người Nam cũng tụ họp họ hàng làm binh để tự vệ, cho nên gọi là tông binh). Lương ở lại Hợp Phố. Thuộc lại của Sĩ Nhiếp là Hoàn Lân cúi đầu can Huy, xin đón Lương, Huy giận đánh chết Lân. Sử thần Ngô Sĩ Liên nói: Từ xưa hễ giết bề tôi can ngăn thì chưa từng không mất nước. Nước Trần giết [1b] Tiết Dã, nước Tề giết Cô Huyên, việc nước Trần, nước Tề đáng làm gương soi, lấy đó làm răn. Thế mà còn có người giết bề tôi căn ngăn như Sĩ Huy, nối nghiệp chưa kịp quay gót mà đã phải chết là đáng lắm."
    }, {
        "id": 13,
        "title": "Thuộc Lưỡng Tấn",
        "description": "Thuộc Lưỡng Tấn. Giáp Thân, [264], (Ngụy Tào Hoán Hàm Hy năm thứ 1, Ngô Tôn Hạo Nguyên Hưng năm thứ 1). Mùa thu, tháng 7, nhà Ngô tách Giao Châu, đặt Quảng Châu. Bấy giờ Ngô đã phụ vào Tấn. Nhà Tấn cho Lữ Hưng làm An Nam tướng quân đô đốc Giao Châu chư quân sự, cho Nam Trung giáp quân là Hoắc Dặc xa lĩnh Thứ sử Giao Châu, cho được tùy nghi tuyển dụng trưởng lại."
    }, {
        "id": 14,
        "title": "Thuộc Tống, Tề, Lương",
        "description": "Thuộc Tống, Tề, Lương. Từ thời Lưỡng Tấn tới thời Nam Bắc triều, tuy có sự thay đổi triều đại và biến động nhiều ở trung nguyên nhưng Giao châu chỉ có những biến động quân sự, không có nhiều biến động về chính trị. Tại miền bắc, các tộc Ngũ Hồ vào xâm chiếm và cai trị, các triều đại Đông Tấn (317-420), Lưu Tống (420-479), Nam Tề (479-502), Lương (502-557) nối nhau cai trị ở miền nam và giữ được quyền quản lý Giao châu không bị gián đoạn, thay đổi như cuối thời Đông Hán và Tam Quốc. Những cuộc nổi dậy của người Việt chỉ kéo dài một thời gian đều bị dẹp; những cuộc xâm lấn của Lâm Ấp từ phía nam cũng nhanh chóng bị đẩy lùi; một số lực lượng nổi dậy chống triều đình chạy sang Giao châu cũng nhanh chóng bị đánh bại."
    }, {
        "id": 15,
        "title": "Lý Nam Đế - Lý Bí",
        "description": "Lý Nam Đế - Lý Bí. Lý Bôn tức Lý Bí, quê ở Long Hưng (Thái Bình), sinh ngày 12 tháng 9 năm Quý Mùi (17/10/503), là con hào trưởng Lý Toản, mẹ là Lê Thị Oánh người Ái Châu (Thanh Hoá), 5 tuổi bố mất, 7 tuổi mẹ mất, phải ở với chú ruột. Vị pháp tổ thiền sư thấy khôi ngô tuấn tú xin làm con nuôi đưa về chùa Linh Bảo nuôi dạy. Hơn mười năm đèn sách chuyên cần, lại được vị thiền sư hết lòng dạy bảo, Lý Bí trở thành người học rộng hiểu sâu, ít người sánh kịp. Nhờ có tài kiêm văn võ, Lý Bí được tôn làm thủ lĩnh địa phương. Thấy nhân dân ta vô cùng thống khổ dưới sự đô hộ tàn ác của Tiêu Tư. Tháng 1 năm 542 Lý Bí lãnh đạo nhân dân khởi binh tấn công quân Lương. Thứ sử Tiêu Tư khiếp sợ bỏ chạy về nước. Chưa đầy 3 tháng Lý Bí đã chiếm được hầu hết các quận, huyện và thành Long Biên. Nhà Lương sai tướng đem quân sang phản công chiếm lại, Lý Bí đã cho quân mai phục đánh tan bọn xâm lược. Đầu năm 543, vua Lương lại huy động binh mã sang xâm lược nước ta một lần nữa. Lý Bí chủ động đem quân đón đánh giặc ở bán đảo Hợp Phố, quân Lương bị tiêu diệt gần hết. Tháng Hai năm Giáp Tý - 544, Lý Bí lên ngôi Hoàng đế lấy hiệu là Lý Nam Đế, đặt tên nước là Vạn Xuân, đóng đô ở Long Biên."
    }, {
        "id": 16,
        "title": "Triệu Việt Vương - Triệu Quang Phục",
        "description": "Triệu Việt Vương - Triệu Quang Phục. Triệu Quang Phục là con Triệu Túc, Tù trưởng ở Chu Diên (Hưng Yên). Khi được Lý Nam Đế trao quyền lãnh đạo cuộc kháng chiến chống quân Lương, ông đưa quân về Dạ Trạch (bãi Màn Trò, Hưng Yên) là một vùng đồng lầy rộng mênh mông, lau sậy um tùm, ở giữa có một bãi đất cao khô ráo để đóng quân. Ông cho quân lính vừa sản xuất lương thực, vừa tiếp tục cuộc kháng chiến lâu dài. Đêm đêm nghĩa quân kéo ra đánh các đồn địch, làm cho lực lượng địch bị tiêu hao và mất ăn, mất ngủ. Ngày 13/4/548, Triệu Quang Phục lên ngôi vua, xưng là Triệu Việt Vương, dân gian gọi ông là Dạ Trạch Vương. Năm 550, từ căn cứ Dạ Trạch ông tiến quân ra đánh giết được tướng giặc là Dương San, thu lại được thành Long Biên."
    }, {
        "id": 17,
        "title": "Hậu Lý Nam Đế - Lý Phật Tử",
        "description": "Hậu Lý Nam Đế - Lý Phật Tử. Diệt xong Triệu Việt Vương, Lý Phật Tử xưng là hậu Lý Nam Đế, đóng đô ở Phong Châu (Bạch Hạc - Phú Thọ). Trong lúc Lý Phật Tử làm vua ở nước ta, thì bên Trung Quốc Tuỳ Văn Đế dẹp yên được Nam Bắc triều, thống nhất được đất nước Trung Hoa. Năm Nhâm Tuất (602) nhà Tuỳ sai danh tướng Lưu Phương đem quân sang xâm lược nước ta. Lý Phật Tử hèn nhát đầu hàng, dâng nước ta cho giặc. Từ đó nước ta lại bị nhà Tuỳ đô hộ"
    }, {
        "id": 18,
        "title": "Thuộc Tuỳ",
        "description": "Thuộc Tuỳ. Năm 602, nhà Tùy sai Lưu Phương đem quân 27 dinh sang đánh nước Vạn Xuân. Vua đời thứ ba của Vạn Xuân là Lý Phật Tử sợ giặc và đầu hàng, bị bắt sang Trung Hoa. Việt Nam vào thời kỳ Bắc thuộc lần thứ 3 mà trước hết là thuộc Tùy. Thời đó, Việt Nam bị xếp làm một châu của Tùy, gọi là châu Giao."
    }, {
        "id": 19,
        "title": "Thuộc Đường",
        "description": "Thuộc Đường. Lý Uyên lên ngôi Đường Cao Tổ trị vì Trung Hoa. Năm 671, nhà Đường chia đất Giao Châu thành 12 châu, 59 huyện và gọi nước ta là An Nam đô hộ phủ. Nhà Đường dùng chính sách tàn bạo, hà khắc để cai trị nhân dân ta, chúng muốn đồng hoá nhân dân ta bằng chính sách \"sát phu, hiếp phụ\", nhưng với ý chí quật cường của một dân tộc anh hùng, nhân dân ta đã có nhiều cuộc nổi dậy chống lại kẻ thù xâm lược như các cuộc khởi nghĩa của Lý Tự Tiên, Đinh Kiến (687), Mai Thúc Loan (722), Phùng Hưng (766-791), Dương Thanh (819-820)"
    }, {
        "id": 20,
        "title": "Thuộc Ngũ Đại",
        "description": "Thuộc Ngũ Đại. Ngũ Đại Thập Quốc là một thời kỳ trong lịch sử Trung Quốc, bắt đầu từ khi triều Đường diệt vong, kéo dài đến khi triều Tống thống nhất Trung Quốc bản thổ. Thời kỳ này phân thành Ngũ Đại (907-960) cùng Thập Quốc (907-979). Ngũ Đại Thập Quốc là một thời kỳ trọng yếu trong lịch sử Trung Quốc, trong giai đoạn này Việt Nam cuối cùng thoát ly Trung Quốc để trở thành một quốc gia độc lập."
    }, {
        "id": 21,
        "title": "Dương Đình Nghệ",
        "description": "Dương Đình Nghệ. Dương Đình Nghệ (931-938) người Ái Châu (Thanh Hoá), là tướng của họ Khúc đã khởi binh đánh đuổi Lý Khắc Chính và Lý Tiến giải phóng thành Đại La (Hà Nội) xưng là Tiết độ sứ vào năm 931."
    }, {
        "id": 22,
        "title": "Khúc Thừa Dụ",
        "description": "Khúc Thừa Dụ. Khúc Thừa Dụ (905-907) quê ở Cúc Bồ (Ninh Thanh, Hải Dương), vốn là một hào phú, tính khoan hoà, được nhân dân kính phục. Thấy nhân dân ta vô cùng thống khổ dưới ách đô hộ của nhà Đường, ông khởi binh tiến công thành Tống Bình (Hà Nội), đuổi giặc về nước tự xưng là Tiết độ sứ. Thế cùng, nhà Đường buộc phải công nhận Khúc Thừa Dụ là người đứng đầu đất Việt. Ngày 23/7/907, Khúc Thừa Dụ mất, giao quyền lại cho con là Khúc Hạo."
    }, {
        "id": 23,
        "title": "Khúc Hạo",
        "description": "Khúc Hạo. Khúc Hạo (907-917) Năm 907, nhà Đường mất, nhà Hậu Lương thay thế cũng phải công nhận Khúc Hạo là \" An Nam đô hộ Tiết độ sứ\". Khúc Hạo chia nước ta thành 5 cấp hành chính: Lộ, phủ, châu, giáp, xã. Giáp, xã là cấp hành chính cơ sở lần đầu tiên được đặt ra ở nước ta. Năm Đinh Sửu (917), Khúc Hạo mất, truyền ngôi cho con là Khúc Thừa Mỹ."
    }, {
        "id": 24,
        "title": "Khúc Thừa Mỹ",
        "description": "Khúc Thừa Mỹ. Khúc Thừa Mỹ (917-923) thay cha nhậm chức Tiết độ sứ của nhà Lương, chứ không phục nhà Nam Hán. Năm 923, vua Nam Hán sai tướng là Lý Khắc Chính đem quân sang đánh và bắt được Khúc Thừa Mỹ, rồi sai Lý Tiến sang cùng với Lý Khắc Chính làm thứ sử Giao Châu."
    }, {
        "id": 25,
        "title": "Tiền Ngô Vương - Ngô Quyền",
        "description": "Tiền Ngô Vương - Ngô Quyền. Ngô Vương (Ngô Quyền 939-944): Ngô Quyền sinh ngày 12 tháng 3 năm Đinh Tỵ (897) ở Đường Lâm (thuộc huyện Ba Vì, tỉnh Hà Tây ngày nay), cha là Ngô Mân, một hào trưởng có tài đức. Ngô Quyền thông minh, khôi ngô, mắt sáng như chớp, văn võ toàn tài, được Dương Đình Nghệ tin yêu, gả con gái là Dương Thị Ngọc và giao cho Ngô Quyền cai quản đất ái Châu (Thanh Hóa)."
    }, {
        "id": 26,
        "title": "Dương Bình Vương - Dương Tam Kha",
        "description": "Dương Bình Vương - Dương Tam Kha. Ngô Quyền làm Vua được 5 năm (939-944) thì mất, thọ 48 tuổi. Ngô Quyền mất, em vợ là Dương Tam Kha cướp ngôi tự lập làm vua là Dương Bình Vương (944-950)."
    }, {
        "id": 27,
        "title": "Hậu Ngô Vương - Ngô Xương Văn",
        "description": "Hậu Ngô Vương - Ngô Xương Văn. 1. Nam Tấn Vương (Ngô Xương Căn 950-965): Ngô Xương Căn là con thứ hai của Ngô Quyền và Dương Thị Ngọc, năm 950 đã dùng mưu lật đổ Dương Tam Kha giành lại ngôi Vua cho nhà Ngô. Theo thỉnh cầu của các tướng lĩnh và triều thần, được sự chuẩn tấu của Dương Thái hậu, Ngô Xương Căn lên ngôi Vua lấy niên hiệu là Nam Tấn Vương (950-965) đóng đô ở Cổ Loa. Nam Tấn Vương cho người đi tìm anh là Thái tửu Ngô Xươnng Ngập, giả làm thầy đồ trốn ở Nam Sách (Hải Dương) lấy vợ và có con trai là Ngô Xương Văn. Được Dương Thái Hậu chuẩn tấu cả hai anh em đều làm Vua (như vậy nước ta lúc đó có hai Vua). 2. Thiên Sách Vương (Ngô Xương Ngập 951-959): Ngô Xương Ngập lên ngôi vua, đặt niên hiệu là Thiên Sách Vương (951-959) sau Ngô Xương Ngập bị bệnh thượng mã phong mà chết. Làm vua được 8 năm."
    }, {
        "id": 28,
        "title": "Ngô Sứ Quân - Ngô Xương Xí",
        "description": "Ngô Sứ Quân - Ngô Xương Xí. Năm 965, Nam Tấn Vương Ngô Xương Văn bị bắn chết trong một trận giao chiến ở Thái Bình, con Thiên Sách Vương là Ngô Xương Xí nối nghiệp làm vua, thế lực ngày càng yếu kém phải lui về giữ đất Bình Kiều, từ 966 hình thành 12 sứ quân"
    }, {
        "id": 29,
        "title": "Đinh Tiên Hoàng - Đinh Bộ Lĩnh",
        "description": "Đinh Tiên Hoàng - Đinh Bộ Lĩnh. Đinh Tiên Hoàng (Đinh Bộ Lĩnh 968-979) Đinh Bộ Lĩnh người động Hoa Lư, châu Đại Hoàng (Hoa Lư, Ninh Bình), con trai ông Đinh Công Trứ, một nha tướng của Dương Đình Nghệ, giữ chức thứ sử Châu Hoan. Cha mất sớm, Đinh Bộ Lĩnh theo mẹ về quê ở, thường đi chăn trâu, bắt lũ trẻ khoanh tay làm kiệu để ngồi cho chúng rước và lấy bông lau làm cờ bày trận giả đánh nhau. Lớn lên rất thông minh, có khí phách và có tài thao lược. Thấy nhân dân khổ sở vì loạn 12 sứ quân, Ông dựng cờ nghĩa, mong lập nghiệp lớn. Đinh Bộ Lĩnh theo về dưới cờ của Trần Minh Công (Trần Lãm) ở Bố Hải Khẩu, được Trần Lãm nhận làm con nuôi. Khi Trần Lãm mất, Đinh Bộ Lĩnh thay quyền đem quân về giữ Hoa Lư, chiêu mộ hào kiệt để dẹp loạn 12 sứ quân. Năm Mậu Thìn (968) sau khi dẹp xong loạn 12 sứ quân, Đinh Bộ Lĩnh lên ngôi Hoàng đế lấy niên hiệu là Tiên Hoàng đế, đặt quốc hiệu là Đại Cồ Việt, đóng đô ở Hoa Lư."
    }, {
        "id": 30,
        "title": "Đinh Phế Đế - Đinh Toàn",
        "description": "Đinh Phế Đế - Đinh Toàn. Đinh Phế Đế (Đinh Toàn 979-980) Đinh Toàn mới lên 6 tuổi, được triều thần đưa lên ngôi vua. Nhân cơ hội đó nhà Tống cho quân sang xâm lược nước ta. Vì lợi ích của dân tộc, Thái hậu Dương Vân Nga (vợ của Đinh Tiên Hoàng, mẹ đẻ của Đinh Toàn), thể theo nguyện vọng các tướng sĩ, đã trao áo \"Long Cổn\" (biểu tượng của ngôi vua) cho Thập đạo Tướng quân Lê Hoàn, tức là Lê Đại Hành."
    }, {
        "id": 31,
        "title": "Lê Đại Hành - Lê Hoàn",
        "description": "Lê Đại Hành - Lê Hoàn. Lê Đại Hành (980-1005) Lê Hoàn sinh năm 941 ở Xuân Lập, Thọ Xuân, Thanh Hoá (có thuyết nói: Lê Hoàn sinh ở Thanh Liêm, Hà Nam) trong một gia đình nghèo khổ, bố là Lê Mịch, mẹ là Đặng Thị Sen. Cha mẹ mất sớm, Lê Hoàn phải đi làm con nuôi cho một vị quan nhỏ. Lớn lên, ông đi theo Nam Việt Vương Đinh Liễn và lập được nhiều chiến công khi Đinh Tiên Hoàng dẹp loạn 12 sứ quân, thống nhất đất nước, lập nên cơ nghiệp Nhà Đinh. Ông được Đinh Tiên Hoàng phong làm Thập Đạo tướng quân lúc vừa tròn 30 tuổi. Khi cha con Đinh Tiên Hoàng bị Đỗ Thích giết hại, Đinh Toàn mới 6 tuổi lên ngôi vua. Nhân cơ hội đó, Nhà Tống cho quân sang xâm lược nước ta. Vì lợi ích của dân tộc, Thái hậu Dương Vân Nga đã trao ngôi vua cho Lê Hoàn. Lê Hoàn lên ngôi vua lấy niên hiệu là Lê Đại Hành. Vẫn lấy tên nước là Đại Cồ Việt, đóng đô tại Hoa Lư."
    }, {
        "id": 32,
        "title": "Lê Trung Tông - Lê Long Việt",
        "description": "Lê Trung Tông - Lê Long Việt. Lê Trung Tông (1005) Vua Lê Đại Hành có 4 hoàng tử: Long Du, Ngân Trích, Long Việt và Long Đĩnh. Lê Đại Hành đã cho con thứ ba là Long Việt làm Thái tử. Khi vua Lê Đại Hành băng hà, các hoàng tử tranh ngôi, đánh nhau 7 tháng, đến khi Long Việt lên ngôi làm vua là Lê Trung Tông được 3 ngày thì bị em cùng mẹ là Long Đĩnh giết chết lúc 23 tuổi (983 - 1005)."
    }, {
        "id": 33,
        "title": "Lê Ngoạ Triều - Lê Long Đĩnh",
        "description": "Lê Ngoạ Triều - Lê Long Đĩnh. Lê Ngọa Triều (1005 - 1009) Lê Long Đĩnh cướp ngôi của anh là Lê Trung Tông, lên ngôi hoàng đế lấy hiệu là Đại Thắng Minh Quang Hiếu Hoàng đế vẫn đóng đô ở Hoa Lư. Lê Long Đĩnh đã làm việc càn dỡ giết Vua cướp ngôi, thích dâm đãng, tàn bạo, róc mía trên đầu nhà sư... Do chơi bời trác táng quá, nên khi ra thiết triều phải nằm, tục gọi là Lê Ngoạ Triều. Lê Ngoạ Triều làm vua được 4 năm (1005 - 1009) thì mất, thọ 24 tuổi. Long Đĩnh mất, con tên là Sạ còn bé, dưới sự đạo diễn của quan Chi Hậu Đào Cam Mộc, triều thần đã tôn Lý Công Uẩn lên ngôi Hoàng đế."
    }, {
        "id": 34,
        "title": "Lý Thái Tổ - Lý Công Uẩn",
        "description": "Lý Thái Tổ - Lý Công Uẩn. Lý Thái Tổ (1010 – 1028) Lý Công Uẩn người làng Cổ Pháp (Từ Sơn, Bắc Ninh), mẹ họ Phạm, sinh ngày 12 tháng 2 năm Giáp Tuất (974), mẹ chết khi mới sinh, thiền sư Lý Khánh Văn nhận làm con nuôi, Lý Công Uẩn thông minh và có chí khí khác người ngay từ nhỏ. Nhờ sự nuôi dạy của nhà sư Lý Khánh Văn và Lý Vạn Hạnh, Lý Công Uẩn trở thành người xuất chúng, văn võ kiêm toàn, làm đến chức Điện tiền chỉ huy sứ, khi Lê Ngọa Triều mất, triều thần tôn Lý Công Uẩn lên ngôi Hoàng đế, niên hiệu Thuận Thiên, vẫn lấy Quốc hiệu là Đại Cồ Việt, đóng đô tại Hoa Lư. Tháng 7 năm 1010, vua Lý Thái Tổ cho dời đô về thành Đại La, một buổi sáng đẹp trời, thuyền vừa cập bến, Nhà Vua thấy Rồng vàng bay lên, do đó đặt tên là Kinh đô Thăng Long (tức là Hà Nội ngày nay)."
    }, {
        "id": 35,
        "title": "Lý Thái Tông - Lý Phật Mã",
        "description": "Lý Thái Tông - Lý Phật Mã. Lý Thái Tông (1028 – 1054) Vua Lý Thái Tổ sinh các hoàng tử: Thái tử Phật Mã, Dực Thánh Vương, Khai Quốc Vương Bồ, Đông Chính Vương Lực, Võ Đức Vương Hoàng. Khi Vua Thái Tổ vừa mất, chưa kịp làm lễ tang, các hoàng tử Võ Đức Vương, Dực Thánh Vương, Đông Chính Vương đem quân vây Hoàng thành để tranh ngôi vua với Thái tử, nhờ có Lê Phụng Hiểu trung dũng xông ra chém chết Võ Đức Vương, hai hoàng tử kia bỏ chạy. Triều thần cùng Lê Phụng Hiểu phò Thái tử Phật Mã lên ngôi Hoàng đế, niên hiệu Lý Thái Tông."
    }, {
        "id": 36,
        "title": "Lý Thánh Tông - Lý Nhật Tôn",
        "description": "Lý Thánh Tông - Lý Nhật Tôn. Lý Thánh Tông (1054 – 1072) Lý Thánh Tông tên húy là Nhật Tôn, sinh ngày 25 tháng 2 năm Quý Hợi (1023), là con bà Kim Thiên Thái Hậu họ Mai. Nhà sử học Ngô Sỹ Liên ghi trong “Đại Việt sử ký toàn thư”: “... Vua khéo kế thừa, thực lòng thương dân, trọng việc làm ruộng, thương kẻ bị hình, vỗ về thu phục người xa, đặt khoa bác sĩ, hậu lễ dưỡng liêm, sửa sang việc văn, phòng bị việc võ, trong nước yên tĩnh, đáng gọi là bậc Vua tốt. Song nhọc sức xây tháp Báo Thiên, phí của dân làm cung Dâm Đàm, đó là chỗ kém”."
    }, {
        "id": 37,
        "title": "Lý Nhân Tông - Lý Càn Đức",
        "description": "Lý Nhân Tông - Lý Càn Đức. Lý Nhân Tông (1072 – 1128) Thái tử Càn Đức là con trưởng của Lý Thánh Tông, mẹ là bà Nguyên phi Ỷ Lan, sau là Thái hậu Linh Nhân, Thái tử sinh ngày 25 tháng Giêng năm Bính Ngọ (1066), khi Lý Thánh Tông mất, Thái tử lên ngôi Hoàng đế (1072) lúc mới 6 tuổi, Hoàng Thái hậu Ỷ Lan phải buông rèm nhiếp chính. Năm 1075, thời Tống Thần Tông, Vương An Thạch làm Tể tướng âm mưu xâm lược nước ta, Thái úy Lý Thường Kiệt biết rõ âm mưu xâm lược của nhà Tống nên đã đánh phá các căn cứ tập kết lương thực, vũ khí của chúng ở Châu Khâm, Châu Liêm, Châu Ung (Quảng Đông, Quảng Tây) rồi chủ động rút quân về nước lập phòng tuyến ở bờ nam sông Cầu để chặn giặc."
    }, {
        "id": 38,
        "title": "Lý Thần Tông - Lý Dương Hoán",
        "description": "Lý Thần Tông - Lý Dương Hoán. Lý Thần Tông (1128 - 1138) Vua Lý Nhân Tông không có con trai, lập con của em trai là Sùng Hiền Hầu Dương Hoán lên làm Thái tử, kế vị Hoàng đế là vua Lý Thần Tông. Vua Lý Thần Tông khuyến khích phát triển nông nghiệp, thực hiện chính sách \"ngụ binh ư nông\", cho binh lính đổi phiên, cứ lần lượt 6 tháng một được về làm ruộng, do vậy nhân dân no đủ, an cư lạc nghiệp."
    }, {
        "id": 39,
        "title": "Lý Anh Tông - Lý Thiên Tộ",
        "description": "Lý Anh Tông - Lý Thiên Tộ. Lý Anh Tông (1138 - 1175) Lý Thiên Tộ là con đích trưởng của Lý Thần Tông, con bà Lê Hoàng hậu, sinh tháng 4 năm Bính Thìn (1136), lên ngôi Hoàng đế năm 1138, lúc đó mới 3 tuổi. Lê Hoàng hậu cầm quyền nhiếp chính lại tư thông với Đỗ Anh Vũ làm cho triều đình đổ nát, sau nhờ có các trung thần như Tô Hiến Thành, Hoàng Nghĩa Hiền, Lý Công Tín nên giữ vững được cơ đồ nhà Lý."
    }, {
        "id": 40,
        "title": "Lý Cao Tông - Lý Long Trát",
        "description": "Lý Cao Tông - Lý Long Trát. Lý Cao Tông (1176 - 1210) Lý Anh Tông mất, Thái tử Long Cán lúc đó chưa đầy 3 tuổi, bà Chiêu Linh Thái hậu muốn lập con cả của mình là Long Xưởng lên ngôi vua. Bà đem vàng bạc đút lót cho vợ Tô Hiến Thành, nhưng Tô Hiến Thành nhất định không nghe cứ theo di chiếu lập Long Cán lên làm vua, hiệu là Lý Cao Tông. Lớn lên Cao Tông chơi bời vô độ, chính sự hình pháp không rõ ràng, giặc cướp nổi lên như ong, đói kém liên miên, cơ nghiệp nhà Lý từ đó suy đồi."
    }, {
        "id": 41,
        "title": "Lý Huệ Tông - Lý Sảm",
        "description": "Lý Huệ Tông - Lý Sảm. Lý Huệ Tông (1211 - 1224) Thái tử Sảm lên ngôi Hoàng đế, hiệu là Huệ Tông, lập Trần Thị Dung làm nguyên phi, phong cho Trần Tự Khánh làm Chương Tín hầu, Tô Trung Tự làm Thái uý, Thuận Lưu Bá, Trần Thừa làm Nội thị phán thủ. Thái tử Sảm sinh tháng 7 năm Giáp Dần (1194) con cả của Cao Tông và bà Hoàng hậu họ Đàm. Vua Huệ Tông thường rượu chè say khướt suốt ngày, bỏ bê triều chính. Huệ Tông không có con trai. Hoàng hậu Trần Thị Dung chỉ sinh được hai con gái. Con gái lớn là Thuận Thiên công chúa đã gả cho Phụng kiều vương Trần Liễu, công chúa thứ 2 là Phật Kim (công chúa Chiêu Thánh) mới 7 tuổi được làm Thái tử."
    }, {
        "id": 42,
        "title": "Lý Chiêu Hoàng - Lý Phật Kim",
        "description": "Lý Chiêu Hoàng - Lý Phật Kim. Lý Chiêu Hoàng (1224 - 1225) Dưới sự đạo diễn của Trần Thủ Độ, Lý Huệ Tông bị ép đi tu, nhường ngôi vua cho con gái là công chúa Chiêu Thánh (lúc đó mới 7 tuổi) niên hiệu là Lý Chiêu Hoàng. Binh quyền về tay Trần Thủ Độ. Cũng dưới sự đạo diễn của Trần Thủ Độ, Trần Cảnh (8 tuổi) là con ông Trần Thừa được đưa vào hầu cận Lý Chiêu Hoàng. Trần Cảnh được Chiêu Hoàng yêu mến, thường hay té nước, ném khăn trêu đùa. Trần Thủ Độ tung tin là Lý Chiêu Hoàng đã lấy chồng là Trần Cảnh. Ngày 21 tháng 10 năm Ất Dậu (1225), Lý Chiêu Hoàng mở hội lớn ở điện Thiên An, trước bá quan văn võ, Chiêu Hoàng cởi hoàng bào mời Trần Cảnh lên ngôi Hoàng đế đổi niên hiệu là Kiến Trung năm thứ nhất, dựng lên triều đại nhà Trần từ đấy."
    }, {
        "id": 43,
        "title": "Trần Thái Tông - Trần Cảnh",
        "description": "Trần Thái Tông - Trần Cảnh. Trần Thái Tông (1225 - 1258) Sinh ngày 16 tháng 6 năm Mậu Dần - 1218, con thứ của ông Trần Thừa và bà họ Lê. Tổ tiên Nhà Trần là Trần Kính vốn gốc ở Đông Triều (Quảng Ninh) chuyên nghề đánh cá, đến ở hương Tức Mạc, phủ Thiên Trường (nay là xã Tức Mặc, huyện Mỹ Lộc, tỉnh Nam Định), sinh ra Trần Hấp, Trần Hấp sinh ra Trần Lý. Trần Lý sinh ra Trần Thừa, Trần Tự Khánh và Trần Thị Dung. Trần Thủ Độ là cháu họ, được Trần Lý nuôi nấng từ nhỏ coi như con. Trần Thừa sinh ra Trần Liễu và Trần Cảnh là con trai, sau có mối tình với cô thôn nữ ở thôn Bà Liệt tên là Tần, sinh ra Trần Bá Liệt. Dưới sự đạo diễn của Trần Thủ Độ, lúc đó là Điện Tiền chỉ huy sứ, ngày 21 tháng 10 năm Ất Dậu - 1225, Lý Chiêu Hoàng xuống chiếu nhường ngôi cho chồng là Trần Cảnh. Ngày 11 tháng 12 năm Ất Dậu - 1225, Trần Cảnh chính thức lên ngôi Hoàng đế, đổi niên hiệu là Kiến Trung, phong Lý Chiêu Hoàng làm Chiêu Thánh Hoàng hậu, phong Trần Thủ Độ là Thái sư thống quốc hành quân vụ chinh thảo sự."
    }, {
        "id": 44,
        "title": "Trần Thánh Tông - Trần Hoảng",
        "description": "Trần Thánh Tông - Trần Hoảng. Trần Thánh Tông (1258 - 1278) Là con trưởng dòng đích của Thái Tông, mẹ là Hiển Từ Thuận Thiên Hoàng Thái hậu Lý Thị, sinh ngày 25 tháng 9 năm Canh Tý - 1240. Ngày 24 tháng 2 năm Mậu Ngọ - 1258 lên ngôi hoàng đế đổi niên hiệu là Thiệu Long năm thứ 1. Thánh Tông là một vị vua nhân từ độ lượng, hết lòng chăm lo việc nước. Về đối nội, nhà vua khuyến khích khai khẩn đất hoang, mở mang điền trang thái ấp bằng cách chiêu tập những người nghèo đói lưu lạc, giúp họ an cư lạc nghiệp. Nhà vua khuyến khích việc học hành bằng cách mở các khoa thi để lựa chọn người tài mà trọng dụng, thời Trần đã xuất hiện \"Lưỡng quốc Trạng nguyên\" Mạc Đĩnh Chi, nhà sử học Lê Văn Hưu đã viết bộ quốc sử đầu tiên của nước ta là \"Đại Việt sử ký\"."
    }, {
        "id": 45,
        "title": "Trần Nhân Tông - Trần Khâm",
        "description": "Trần Nhân Tông - Trần Khâm. Trần Nhân Tông (1279-1293) Con trưởng Thánh Tông, mẹ là Nguyên Thánh Thiên Cảm Hoàng thái hậu, sinh ngày 11 tháng 11 Mậu Ngọ - 1258, ngày mồng 1 tháng Giêng năm Kỷ Mão - 1279 lên ngôi Hoàng đế đổi niên hiệu là Thiệu Bảo. Vua Trần Nhân Tông là một vị vua nhân từ, hoà nhã, cố kết lòng dân, quyết đoán, hết lòng vì dân vì nước trong thời gian 14 năm ở ngôi khi đất nước Đại Việt ta trải qua hai cuộc kháng chiến chống quân xâm lược Nguyên Mông hùng mạnh nhất thế giới thời bấy giờ."
    }, {
        "id": 46,
        "title": "Trần Anh Tông - Trần Thuyên",
        "description": "Trần Anh Tông - Trần Thuyên. Trần Anh Tông (1293 - 1314) Tên huý là Thuyên, con trưởng của Trần Nhân Tông và mẹ là Khâm Từ Bảo Khánh hoàng thái hậu, có hai em là Huệ Võ Vương Quốc Chuẩn và em gái là Huyền Trân công chúa. Trần Anh Tông khéo biết kế thừa sự nghiệp của tổ tiên, cho nên thời cuộc đi đến thái bình, chính trị trở nên tốt đẹp, văn vật chế độ ngày càng thịnh vượng, cũng là một vua tốt của triều Trần."
    }, {
        "id": 47,
        "title": "Trần Minh Tông - Trần Mạnh",
        "description": "Trần Minh Tông - Trần Mạnh. Trần Minh Tông (1314 - 1329) Tên huý là Mạnh, con thứ tư của Trần Anh Tông. Mẹ là Chiêu Hiền hoàng thái hậu Trần Thị, con gái của Bảo Nghĩa đại vương Trần Bình Trọng, sinh năm Canh Tý - 1300. Trần Minh Tông có lòng nhân hậu, biết tôn trọng nhân tài nên có nhiều hiền thần dưới trướng như Phạm Ngũ Lão, Trương Hán Siêu, Chu Văn An, Nguyễn Trung Ngạn, Đoàn Nhữ Hài, nhưng đã quá tin bọn nịnh thần giết oan chú ruột, đồng thời là bố vợ là Huệ Võ Vương Trần Quốc Chẩn, một lỗi lầm lớn của Trần Minh Tông."
    }, {
        "id": 48,
        "title": "Trần Hiến Tông - Trần Vượng",
        "description": "Trần Hiến Tông - Trần Vượng. Trần Hiến Tông (1329 - 1341) Tên huý là Vượng, con bà Minh Từ hoàng thái phi Lê Thị, sinh ngày 17 tháng 5 năm Kỷ Mùi - 1319. Năm 1329 lên ngôi vua mới 10 tuổi, ở ngôi 12 năm, nhưng việc điều khiển triều chính đều do Thượng hoàng Minh Tông đảm nhận."
    }, {
        "id": 49,
        "title": "Trần Dụ Tông - Trần Hạo",
        "description": "Trần Dụ Tông - Trần Hạo. Trần Dụ Tông (1341 - 1369) Tên huý là Trần Hạo, con thứ 10 của Minh Tông, do Hiến Từ hoàng hậu sinh ra. Vua rất thông tuệ, học vấn cao minh, chăm lo việc võ, sửa sang việc văn, cho nên đời Thiệu Phong chính sự tốt đẹp. Năm 1358 đổi niên hiệu là Đại Trị. Thượng hoàng Minh Tông mất, các trung thần như Trương Hán Siêu, Nguyễn Trung Ngạn cũng đã mất, bọn gian thần kéo bè kéo đảng, Dụ Tông thì rượu chè chơi bời quá độ khiến cho triều đình đổ nát, giặc giã nổi lên như ong, nhân dân cực khổ trăm bề. Chu Văn An dâng \"Thất trảm sớ\" xin chém đầu 7 tên gian thần, nhưng vua không nghe, ông liền treo ấn từ quan về dạy học."
    }, {
        "id": 50,
        "title": "Trần Nghệ Tông - Trần Phủ",
        "description": "Trần Nghệ Tông - Trần Phủ. Trần Nghệ Tông (1370 - 1372) Tên huý là Trần Phủ, con thứ ba của Minh Tông, mẹ đẻ là thứ phi họ Lê, ở ngôi được 2 năm, nhường ngôi 27 năm, thọ 74 tuổi. Vua dẹp yên được nạn bên trong, khôi phục cơ đồ nhà Trần, song cung kính kiệm ước thì có thừa mà cương nghị, quyết đoán lại không đủ. Bên ngoài, vua Chiêm Thành là Chế Bồng Nga đem quân vượt biển vào cửa Đại An tiến đánh kinh đô Thăng Long, quân Trần chống không nổi. Vua Nghệ Tông phải bỏ kinh thành chạy sang Đình Bảng lánh nạn. Quân Chiêm Thành vào đốt sạch cung đình, bắt đàn bà con gái, lấy hết tiền bạc châu báu rồi rút quân về. Ngày 9 tháng 11 năm Nhâm Tý - 1372, Nghệ Tông nhường ngôi cho em là Trần Kính, lui về Thiên Trường làm Thái thượng hoàng."
    }, {
        "id": 51,
        "title": "Trần Duệ Tông - Trần Kính",
        "description": "Trần Duệ Tông - Trần Kính. Trần Duệ Tông (1372-1377) Tên huý là Kính, con thứ 11 của Minh Tông, em Nghệ Tông, mẹ là Đôn Từ hoàng thái phi. Sinh ngày 2 tháng 6 năm Đinh Sửu - 1337. Khi Nghệ Tông lánh nạn Trấn Kính chiêu mộ quân lính, vũ khí, lương thực để đánh Nhật Lễ, đón Nghệ Tông về, nên được nhường ngôi, làm vua được 5 năm, thọ 41 tuổi. Duệ Tông ương gàn, cố chấp, không nghe lời can, khinh thường quân giặc nên mang hoạ vào thân. Tháng 12 năm 1376, nghe lời tấu man của Đỗ Tử Bình (trấn thủ Hoá Châu), nhà vua thân chinh đem 12 vạn quân đi đánh Chiêm Thành, tháng Giêng năm 1377 đại quân tiến đến cửa Thị Nại (Quy Nhơn). Chế Bồng Nga dựng trại bên ngoài thành Đồ Bàn (Bình Định) rồi cho Mục Bà Na đến trá hàng nói là Chế Bồng Nga đã bỏ thành chạy trốn. Ngày 24 tháng Giêng, vua thúc quân tiến vào thành. Đại tướng Đỗ Lễ can mãi vua không nghe cứ tiến quân đến chân thành Đồ Bàn thì quân Chiêm Thành ở bốn phía đổ ra đánh, quân ta thua to. Vua chết trong đám loạn quân."
    }, {
        "id": 52,
        "title": "Trần Phế Đế - Trần Hiện",
        "description": "Trần Phế Đế - Trần Hiện. Trần Phế Đế (1377-1388) Tên huý là Trần Hiệu, con trưởng của Duệ Tông, mẹ là bà Gia Từ hoàng hậu Lê Thị, sinh ngày 6 tháng 3 năm Tân Sửu - 1361. Khi Duệ Tông chết ở mặt trận phương Nam, Nghệ Tông lập Hiệu lên ngôi vua. Vua u mê, nhu nhược không làm được việc gì, uy quyền ngày càng về tay Hồ Quý Ly."
    }, {
        "id": 53,
        "title": "Trần Thuận Tông - Trần Ngung",
        "description": "Trần Thuận Tông - Trần Ngung. Trần Thuận Tông (1388-1398) Tên huý là Trần Ngung, là con út của Nghệ Tông, ở ngôi được 10 năm, xuất gia hơn 1 năm, thì bị Hồ Qúy Ly giết, thọ 22 tuổi. Vua chỉ ngồi giữ ngôi không, còn việc nước thì ở trong tay bố vợ là Hồ Quý Ly."
    }, {
        "id": 54,
        "title": "Trần Thiếu Đế - Trần Án",
        "description": "Trần Thiếu Đế - Trần Án. Trần Thiếu Đế (1398-1400) Tên huý là Trần Án, mưói 3 tuổi lên kế nghiệp tức là Thiếu Đế. Hồ Quý Ly xưng là Khâm đức Hưng liệt Đại Vương, rồi sai người giết con rể là Thuận Tông. Ngày 28 tháng 2 năm Canh Thìn - 1400, Hồ Quý Ly bức Thiếu Đế nhường ngôi, phế làm Bảo Ninh Đại Vương.. Triều Trần kể từ Trần Thái Tông Đến Trần Thiếu Đế là 12 đời vua, trị vì được 175 năm."
    }, {
        "id": 55,
        "title": "Hồ Quý Ly",
        "description": "Hồ Quý Ly. Hồ Quý Ly (1400-1401) tự là Thánh Nguyên, cháu 16 đời của Trạng nguyên Hồ Hưng Dật, vốn gốc thuộc tộc Việt ở Chiết Giang, phương nam Trung Quốc, đời Hậu Hán (thời Ngũ Qúy) sang làm Thái thú Diễn Châu, sau định cư ở hương Bào Đột (Nghĩa Đàn, Nghệ An). Nhà Hồ cho đo đạc lại ruộng đất, cải cách chế độ thi cử, mở mang việc giáo dục, tăng cường quân đội thường trực, xây dựng các tuyến phòng thủ, lập xưởng đúc binh khí kỹ thuật để chống giặc phương Bắc. Các cải cách của Hồ Quý Ly có tính chất toàn diện, có những cải cách đi trước thời đại, giá trị thực tiễn của nó đến nay vẫn còn hấp dẫn, nhiều nhà kinh tế nước ngoài đã ca ngợi Hồ Quý Ly là một nhà cải cách kinh tế lớn. Nhưng Hồ Quý Ly mắc tội giết vua Thiếu Đế cùng tôn tộc và quan lại nhà Trần, kể cả tướng Trần Khát Chân, gồm hơn 370 người để cướp ngôi nhà Trần. Do vậy bị nhân dân oán hận. Khi quân Minh sang xâm lược nước ta, Hồ Qúy Ly đã không tập hợp được lực lượng toàn dân đánh giặc, bố con Hồ Qúy Ly bị quân Minh bắt đem về Trung Quốc."
    }, {
        "id": 56,
        "title": "Hồ Hán Thương",
        "description": "Hồ Hán Thương. Hồ Hán Thương (1401-1407) Cũng như nhà Trần, ngày 12/1/1401, Hồ Qúy Ly nhường ngôi cho con thứ hai là Hồ Hán Thương, còn mình thì tự xưng là Thái Thượng hoàng cùng coi chính sự. Hồ Qúy Ly nhường ngôi cho Hồ Hán Thương, nhưng vẫn tự mình quyết đoán mọi việc. Nhà Minh lấy cớ Hồ Qúy Ly cướp ngôi nhà Trần, đem quân sang đánh chiếm nước ta. Ngày 20 tháng 1 năm 1407, quân Minh hạ thành Đa Bang (Ba Vì), bố con Hồ Quý Ly bỏ chạy vào Thanh Hoá, đến ngày 17/6/1407, quân Minh bắt được cha con Hồ Qúy Ly. Thế là đất nước ta lại bị nhà Minh đô hộ với một chính sự vô cùng hà khắc. Chúng vơ vét của cải, hãm hiếp đàn bà, con gái, giết đàn ông và còn thiến hoạn nhiều con trai nhỏ tuổi, để mong đồng hoá dân ta."
    }, {
        "id": 57,
        "title": "Giản Định Đế - Trần Ngỗi",
        "description": "Giản Định Đế - Trần Ngỗi. Giản Định Đế (1407-1409) Trần Ngỗi là con thứ của Trần Nghệ Tông, cuối thời Hồ đã khởi binh khôi phục nhà Trần, ở ngôi được 2 năm. Vua không có tài dẹp loạn, lại nghe gian thần giết oan 2 vị trung thần là Đặng Tất và Nguyễn Cảnh Chân, nên tự chuốc lấy hoạ diệt vong."
    }, {
        "id": 58,
        "title": "Trần Trùng Quang - Trần Quý Khoáng",
        "description": "Trần Trùng Quang - Trần Quý Khoáng. Trùng Quang Đế (1409-1414) Trần Quý Khoáng là con thứ của Mẫn Vương Ngạc, cháu nội của vua Trần Nghệ Tông, gọi Giản Định đế bằng chú ruột. Đặng Dung là con Quốc công Đặng Tất, Nguyễn Cảnh Dị là con Tham mưu quân sự Nguyễn Cảnh Chân căm giận vì cha bị giết oan, mới đem quân Thuận Hoá về Thanh Hoá đón Trần Quý Khoáng đến Nghệ An làm vua là Trùng Quang Đế để lãnh đạo cuộc kháng chiến chống quân Minh. Tháng 4 năm Giáp Ngọ - 1414, do quân ít không thể chống lại được với quân Minh, Trương Phụ, Mộc Thạch cho quân bao vây đã bắt được Trùng Quang Đế, Đặng Dung, Nguyễn Suý giải về Trung Quốc, trên đường đi vua tôi nhà Hậu Trần đã nhảy xuống biển tự tử để tỏ rõ khí phách, nhà Hậu Trần chấm dứt từ đó."
    }, {
        "id": 59,
        "title": "Kỷ Thuộc Minh",
        "description": "Kỷ Thuộc Minh. Giáp Ngọ, [1414], (Minh Vĩnh Lạc năm thứ 12). Mùa xuân, tháng giêng, Trương Phụ và Mộc Thạnh nhà Minh chiêu dụ, vỗ về Tân Bình, Thuận Hóa, chia đặt quan cai trị để cùng làm việc với thổ quan, khám xét nhân khẩu, gộp làm sổ hộ. [25a] Phủ Thăng Hoa tuy có đặt quan, nhưng Chiêm Thành vẫn có trưởng lộ chiếm giữ cai trị, nên nhà Minh chỉ ghi tên không mà thôi. Quan lại ở kinh lộ, những ai lánh giặc đi theo Trùng Quang Đế đến Hóa Châu, đến đây người thì mang cả nhà chạy sang nước Lão Qua, người thì chạy sang Chiêm Thành, còn người trong nước từ đấy đều làm thần thiếp cho người Minh cả. Mùa hạ, tháng 4, tổng binh Trương Phụ, Mộc Thạnh, Binh bộ thị lang Trần Hiệp của nhà Minh đem trùng Quang Đế, Nguyễn Súy và Đặng Dung về Đông Quan. Quan lại các phủ, châu, huyện sắm lễ vật cùng trướng vẽ cờ thêu đến mừng. Sai người giải về Yên Kinh. Trùng Quang Đế đ đến nửa đường nhảy xuống nước chết. Súy thấy Trùng Quang Đế đã nhảy xuống nước chết, ngày ngày chơi cờ với viên chỉ huy coi giữ mình, thành quen, mới lấy bàn cờ đánh hắn ngã xuống nước chết, Súy cũng nhảy xuống nước chết. Quốc thống từ đấy thuộc về nhà Minh. Mùa thu, tháng 7, [25b] Trương Phụ nhà Minh ra lệnh cho các phủ, châu, huyện, phàn quân nhân bắt được tôi tớ, cùng đàn bà con gái trốn đi xứ khác thì giải về cửa quân. Bọn quan lại chìu ý cấp trên bắt nhiều dân nghèo xiêu tán giải nộp. Tháng 8, Trương Phụ, Mộc Thạnh và Trần Hiệp trở về bắc, chia quân trấn giữ. Tháng 9, Hoàng Phúc nhà Minh truyền bảng cho các phủ, châu, huyện dựng Văn Miếu và các đàn thờ thần xã tắc, thần gió, thần mây, thần núi, thần sông và những thần không ai thờ cúng để tế lễ thường xuyên. Nhà Minh cấm con trai, con gái không được cắt tóc; phụ nữ mặc áo ngắn, quần dài, đồng hóa theo phong tục phương bắc. Mùa đông, tháng 10, nhà Minh mở học hiệu và sức tìm tòi những người nho học, thầy thuốc, thầy tướng số, nhà sư, đạo sĩ, hạ lệnh cho các phủ, châu, huyện lấy lễ mà thành tân thỉnh mời. Đó là làm theo lời của Hữu tham tri Bành Đạo Trường. Nhà Minh bắt khai số ruộng và đất trồng dâu, trưng thu lương thực, tơ tằm. Mỗi hộ 1 mẫu thì bắt khai thành 3 mẫu. [26] Đến sau xét hộ khẩu tăng hàng năm, định số ruộng mỗi hộ là 10 mẫu (nghĩa là mỗi mẫu chỉ có 3 sào, 10 mẫu thực ra chỉ có 3 mẫu). Mỗi mẫu thu 5 thăng thóc, đất bãi mỗi hộ một mẫu thu 1 lạng tơ, mỗi cân tơ dệt được 1 tấm lụa. Ất Mùi, [1415], (Minh Vĩnh Lạc năm thứ 13). Mùa thu, tháng 8, nhà Minh khám thu các mỏ vàng, bạc, mộ phụ đãi nhặt vàng bạc và bắt voi trắng, mò trân châu. Thuế khóa nặng, vơ vét nhiều, dân chúng điêu đứng. Bãi muối ven biển cấm dân mua bán riêng, sai nội quan coi giữ cả. Lại đặt chức cục sứ và phó của từng bãi muối để chia nhau trông coi. Các phủ, châu, huyện đêù đặt phó sứ ty Thuế khóa và sở Hà bạc. Phép lấy muối của nhà Minh: Trước hết sai viên cục sứ và viên phó đốc thúc dân nấu muối, mỗi tháng được bao nhiêu đưa tới ty Đề cử thu giữ. Các viên nội quan mộ người buôn bỏ tiền ra lĩnh giấy khám hợp1378của ty Bố chính. Giấy khám hợp lớn [26b] thì lấy 10 cân muối, giấy khám hợp nhỏ thì lấy 1 cân rồi mới được đem bán. Nếu không có giấy [giấy khám hợp] thì [xử tội] như luật nấu lậu. Lạ cấm người đi đường, lệ chỉ được đem 3 bát muối và 1 lọ nước mắm thôi. Tháng 9, Hoàng Phúc nhà Minh sai quan áp giải đích thân những bọn nho học, thầy thuốc, thầy tướng số, nhà sư, đạo sĩ đưa về Yên Kinh trao cho quan chức rồi đưa về các nha môn làm việc. Lại ra lệnh cho các quan ty sở tại cấp cho tiền đi đường và ngưoời bạn tống, nếu không sẽ bị trừng trị; dọc đường phải cấp cơm ăn và tiền đi đường. Mùa đông, tháng 10, Tổng binh nhà Minh là Trương Phụ giữ chức Chinh lỗ phó tướng quân, lại sang trấn thủ. Nhà Minh mở đường thủy Vĩnh An, Vạn Ninh, đặt trạm đón chuyển đường thủy đến thẳng Khân Châu. Lại đặt trạm chạy ngựa đến thẳng Hoàn Châu1379. Bính Thân, [1416], (Minh Vĩnh Lạc năm thứ 14). Mùa xuân, tháng giêng, nhà Minh bắt đầu đưa những thượng quan văn võ và kỳ lão sang Yên [27a] Kinh, đổi trát văn của Tổng binh mà dùng giấy vàng của bộ để thực thụ quan chức. Thăng Tham nhgị Nguyễn Huân làm Tả bố chính sứ; Tri phủ Lương Nhữ Hốt, Đỗ Duy Trung làm Tham chính. Còn lại thì thăng chức Tri phủ, Đồng tri phủ, Tri châu, Đồng tri châu, Tri huyện. Nhân đó, ban sắc rằng: \"Trước kia bình định Giao Chỉ, các ngươi đã tỏ lòng thành, làm việc nghĩa, lòng hướng về triều đình, trẫm khen ngợi lòng thành của các ngươi mà trao cho quan chức. Từ khi nhận mệnh đến nay, đã biết tận tâm hết sức, hăng hái trung thành, quét diệt phản nghịch, vỗ yên bờ cõi, cố gắng làm tròn chức phận, đã nhiều lần thăng thưởng để biểu dương công trạng của các ngươi. Nay các ngươi đến cửa khuyết triều cống, trẫm xét lòng thành, đánh nên khuyến khích. Nay đặc ân thăng cho các ngươi làm chức mỗ... Các ngươi hãy cố gắng trung thành, cần mẫn hơn nữa, kính cẩn giữ khí tiết của người bề tôi, úy lạo, vỗ về, khiến cho dân chúng đều được yên nghiệp sinh sống, cùng hưởng phúc thái bình [27b] thì sẽ được trời che chở, các ngơi sẽ được phúc lộc dồi dào nối đến đời con đời cháu, mà tiếng tốt của các ngươi sẽ lưu truyền trong sử sách, mãi mãi không cùng\". Tháng 2, Trương Phụ nhà Minh ra lệnh xét duyệt danh số thổ quân, lấy một phần ba số hộ khẩu chia về c1c vệ, sở. Mỗi hộ định mức là 3 đinh. Từ Thanh Hóa trở vào Nam, nhân đinh thưa thớt, định mức là 2 đinh. Chỗ nào không phải là vệ, sở mà là nơi quan yếu, cũng lập đồn lũy, lấy dân binh canh giữ. Mùa thu, tháng 9, quân lính huyện Tân An nổi lên, Trương Phụ dẹp được. Nhà Minh chiêu dụ các quan cũ của triều trước, giả cách bổ đi các nha môn quân, dân làm việc rồi chuyển đưa về Yên Kinh giữ lại. Bọn người bon chen, vốn không phải là quan lại cũ, chưa được thực thụ quan chức, cũng hănh hái ra nhận, trong nước vì thế trở nên trống rỗng. Ở được vài năm, thấy vất vả khổ sở, thỉnh thoảnh họ lại trốn về. Nhà Minh bắt đầu đưa các thổ lại đi, [28a] người nào đủ 9 năm thì giữ lại nha môn ở Kinh để làm việc, người nào chưa đủ năm thì cho về. Đinh Dậu, [1417], (Minh Vĩnh Lạc năm thứ 15). Nội quan nhà Minh là Mã Kỳ tâu rằng Tổng binh Trương Phụ ở Giao Chỉ chọn lấy những thổ nhân mạnh khỏe can đảm làm vi tử thủ1380, vua Minh nghi ngờ, gọi Phụ về, sai Phong Thành hầu Lý Bân với chức Tổng binh Chinh Di tướng quân sang thay Phụ trấn giữ. Nhà Minh sai Giám sát ngự sử chia giữ việc tuần xét bắt đầu từ đấy. Binh bộ thượng thư nhà Minh là Trần Hiệp, lại giúp việc quân chính cho Tổng binh. Nhà Minh định lệ mỗi năm cống các nho học, sinh viên saung vào Quốc tử giám; Nhà phủ học mỗi năm 2 tên, nhà châu học 2 năm 5 tên, nhà huyên học mỗi năm 1 tên. Sau lại quy định nhà phủ học mỗi năm 1 tên, nhà châu học 3 năm 2 tên, nhà huyện học 2 năm 1 tên. Bộ Lại khám hợp, lệnh cho 2 ty Bố chính và Án sát cùng [28b] các quchâu, huyện, ở Giao Chỉ, hẹn đến ngày mồng 1 tháng giêng sang năm đến kinh triều cận, không kể là chức chánh hay chức tá, chỉ cần người giữ chức lâu năm, cho dẫn đầu, đưa các quan lại cùng đi. Lại khám các hạng mục hộ khẩu, ruộng đất lương thực trong 3 năm, từ tháng 7 năm Giáp Ngọ, đến cuối tháng 6 năm này, làm thành sổ \"tu tri\"1381dâng lên để kê xét. Hoàng Phúc sức cho các hào phú, thổ quan là bọn Nguyễn Huân, Lương Nhữ Hốt, Đỗ Duy Trung, Đỗ Hy Vọng, Lương Sĩ Vĩnh, Dương Cự Giác đều phải đem người nhà sang Yên Kinh phục dịch, xây dựng cung điện. Vua Minh nói là làm khó nhọc người phương xa, ban cho ưu hậu rồi cho về. 1378 Giấy khám hợo: giấy chứnh nhận có đónh dấu, được cắt làm hai nửa, người được phéo cầm một nửa, quan nhà giữ một nửa, để khi khám xét, có thể ráp lại xem đúng con dấu hay không. 1379 Hoành Châu: thuộc phủ Nam Ninh, sau là Hoành Huyện, tỉnh Quảng Tây, Trung Quốc. 1380 Vi tử thủ: là những người sung vào làm công việc ở nơi quan phủ. Ở đây, có lẽ Phụ chọn những người khỏe mạnh, can đảm đem vào dinh thự của mình để sai khiến và đề phòng bất trắc. 1381 Tu tri: có nghĩa \"cần biết . Sổ \"tu tri\" có nghĩa là sổ ghi số hộ khẩu, ruộng đất, lương thực cần phải biết để nắm tình hình."
    }, {
        "id": 60,
        "title": "Lê Thái Tổ - Lê Lợi",
        "description": "Lê Thái Tổ - Lê Lợi. Lê Thái Tổ (1428-1433) sinh ngày 6 tháng Tám năm Ất Sửu - 10/9/1385, là con trai thứ 3 của ông Lê Khoáng và bà Trịnh Thị Thương, người ở hương Lam Sơn, huyện Lương Giang, trấn Thanh Hoá. Ngay từ khi còn trẻ, Lê Lợi đã tỏ ra là người thông minh, dũng lược, đức độ hơn người, dáng người hùng vĩ, mắt sáng, miệng rộng, mũi cao, trên vai phải có nốt ruồi đỏ lớn, tiếng nói như chuông, bậc thức giả biết ngay là người phi thường. Lớn lên, ông làm chức Phụ đạo ở Khả Lam, ông chăm chỉ dùi mài đọc sách và binh pháp, nghiền ngẫm thao lược, tìm mời những người mưu trí, chiêu tập dân lưu tán, hăng hái dấy nghĩa binh, mong trừ loạn lớn. Mùa xuân năm Mậu Tuất - 1418, Lê Lợi đã cùng những hào kiệt đồng chí hướng như Nguyễn Trãi, Trần Nguyên Hãn, Lê Văn An, Lê Văn Linh, Bùi Quốc Hưng, Lưu Nhân Chú v.v... phất cờ khởi nghĩa ở Lam Sơn, xưng là Bình Định Vương, kêu gọi nhân dân đồng lòng đứng lên đánh giặc cứu nước. Suốt 10 năm nằm gai nếm mật, vào sinh ra tử, Lê Lợi đã lãnh đạo cuộc kháng chiến chống quân Minh thắng lợi."
    }, {
        "id": 61,
        "title": "Lê Thái Tông - Lê Nguyên Long",
        "description": "Lê Thái Tông - Lê Nguyên Long. Lê Thái Tông (1433-1442) tên huý là Nguyên Long, sinh ngày 20 tháng 11 năm Quý Mão - 1423, là con thứ hai của Lê Lợi và bà Phạm Thị Ngọc Trần, lên ngôi vua ngày 8 tháng 9 năm Qúy Sửu - 1433, lấy niên hiệu là Thiệu Bình. \"Đại Việt sử ký toàn thư\" ghi: \"Vua thiên tư sáng suốt nối vận thái bình: bên trong ức chế quyền thần, bên ngoài đánh dẹp Di địch. Trọng đạo sùng Nho, mở khoa thi chọn hiền sĩ, xử tù, xét án phần nhiều tha thứ khoan hồng. Cũng là bậc vua tài giỏi nối giữ cơ đồ. Song đam mê tửu sắc, đến nỗi thình lình băng ở bên ngoài cũng là tự mình chuốc lấy hoạ...\" Lê Thái Tông lên ngôi vua mới 11 tuổi, còn quá trẻ lại phải đối phó với tình hình triều đình khá phức tạp. Mâu thuẫn và chia rẽ giữa hai lực lượng: một bên là các công thần khai quốc, đứng đầu là Đại tư đồ Lê Sát, Lê Ngân; một bên là những quan lại khoa bảng. Mặc dù vậy Thái Tông vẫn đủ bản lĩnh để không cho các đại thần hoàn toàn thao túng."
    }, {
        "id": 62,
        "title": "Lê Nhân Tông - Lê Bang Cơ",
        "description": "Lê Nhân Tông - Lê Bang Cơ. Lê Nhân Tông (1442-1459) tên huý là Bang Cơ, con thứ của Lê Thái Tông, sinh ngày 9 tháng 6 năm Tân Dậu - 1441. Ngày 16 tháng 11 năm Tân Dậu - 1441 được lập là Hoàng Thái tử, ngày 12 tháng 8 năm Nhâm Tuất - 1442 lên ngôi vua đổi niên hiệu là Thái Hoà. Lúc đó Lê Nhân Tông mới 2 tuổi, Thái hậu Tuyên Từ phải buông rèm nhiếp chính. Tháng 11 năm Quý Dậu - 1453, vua 12 tuổi, Thái hậu trả quyền chính cho vua rồi lui về ở cung riêng. Vua đổi niên hiệu là Diên Ninh, đại xá cho thiên hạ. Người đời bấy giờ ca ngợi tài năng và đức độ của vua. \"Đại Việt sử ký toàn thư\" ghi: \"Vua tuổi còn thơ ấu đã có thiên tư sáng suốt, vẻ người tuấn tú, đàng hoàng, dáng điệu nghiêm trang, sùng đạo Nho, nghe can gián, thương người làm ruộng, yêu nuôi muôn dân, thực là bậc vua giỏi, biết giữ cơ đồ, không may bị cướp ngôi, giết hại. Thương thay!\". Trước kia, Dương Thị Bí là mẹ Nghi Dân có tội với Lê Thái Tông, nên Nghi Dân không được lập làm thái tử, mới ngầm chứa mưu gian nhòm ngó ngôi báu, cùng bọn đồng đảng là Phạm Đồn, Phan Ban, Trần Lăng cầm đầu bọn vô lại côn đồ, đêm ngày 3 tháng 10 năm Kỷ Mão - 1459 bắc thang chia làm ba đường, trèo thành cửa Đông, lẻn vào cung cấm giết chết vua Lê Nhân Tông và Tuyên Từ Hoàng thái hậu. Lê Nhân Tông bị giết chết lúc mới 19 tuổi, làm vua được 17 năm. Nghi Dân tự lập làm vua, nhưng chỉ 8 tháng sau lại bị các đại thần là Nguyễn Xí, Đinh Liệt xướng nghĩa giết bọn phản nghịch, giáng Nghi Dân xuống tước hầu, rồi lập Hoàng tử Tư Thành lên làm vua, đó là Lê Thánh Tông."
    }, {
        "id": 63,
        "title": "Lê Thánh Tông - Lê Tư Thành",
        "description": "Lê Thánh Tông - Lê Tư Thành. Lê Thánh Tông (1460-1497) tự là Tư Thành có tên huý là Hạo, con trai út của Lê Thái Tông và bà Ngô Thị Ngọc Giao - con gái Thái Bảo Ngô Từ. Sống giữa chốn dân gian từ nhỏ đến năm lên 4 tuổi. Mẹ Nhân Tông khi đó đang buông rèm nghe chính sự, cho đón Tư Thành về ở trong cung rồi phong làm Bình Nguyên vương hằng ngày cùng vua Nhân Tông và các vương hầu khác học tập tại toà Kính Diên. Tư Thành chăm chỉ học tập, dáng dấp đoan chính, thông tuệ hơn người, được vua Nhân Tông rất yêu quý. Lê Thánh Tông sinh ngày 20 tháng 7 năm Nhâm Tuất - 1442. Ngày 6 tháng 6 năm Canh Thìn - 1460, các quan đại thần phế truất Nghi Dân, rước Tư Thành - lúc đó 18 tuổi - lên ngôi vua. Lê Thánh Tông hết lòng chăm lo việc nước: mở khoa thi, kén chọn hiền tài, khuyến khích sản xuất nông nghiệp, mở mang ngành nghề, mở rộng giao lưu buôn bán, ban hành chế độ quân điền, coi trọng việc bảo vệ biên giới quốc gia. Bản đồ biên giới quốc gia Đại Việt được hoàn thành dưới triều Lê Thánh Tông. Bộ luật Hồng Đức nổi tiếng mang niên hiệu vua Lê Thánh Tông còn lại cho đến nay là một trong những bộ luật hoàn chỉnh và có nhiều điểm tiến bộ nhất dưới thời phong kiến nước ta. Bộ Đại việt sử ký toàn thư do sử quan Ngô Sĩ Liên biên soạn năm Kỷ Hợi - 1479 dưới sự chỉ đạo của vua Lê Thánh Tông. Lê Thánh Tông còn lập ra Hội Tao Đàn gồm 28 ông tiến sĩ giỏi văn thơ nhất nước thời đó gọi là \"Tao Đàn nhị thập bát tú\" do nhà vua làm nguyên suý."
    }, {
        "id": 64,
        "title": "Lê Hiến Tông - Lê Sanh",
        "description": "Lê Hiến Tông - Lê Sanh. Lê Hiến Tông (1498-1504) tên huý là Huy, con trưởng của Lê Thánh Tông, mẹ là Trường Lạc Thánh Từ Hoàng Thái hậu Nguyễn Thị Hằng, con gái thứ hai của Trình quốc công Đức Trung. Hiến Tông sinh ngày 10 tháng 8 năm Tân Tỵ - 1461. Ông mất ngày 23 tháng 5 năm Giáp Tý - 1504, ở ngôi được 6 năm, thọ 44 tuổi."
    }, {
        "id": 65,
        "title": "Lê Túc Tông - Lê Thuần",
        "description": "Lê Túc Tông - Lê Thuần. Lê Túc Tông (6/6/1504-7/12/1504) tên huý là Thuần, là con trai thứ 3 của Lê Hiến Tông, mẹ là Trang Thuận Hoàng Thái hậu Nguyễn Thị Hoàn, quê ở Bình Lăng, Thiên Thi, Hưng Yên. Lê Túc Tông ham học hỏi, thân người hiền, vui điều thiện, đúng là một vị vua giỏi giữ nghiệp thái bình. Lê Túc Tông lên ngôi vua ngày 6 tháng 6 năm 1504. Tháng 11 năm 1504 mắc bệnh nặng, biết không qua khỏi mới mời các quan triều thần đến để chỉ định người anh thứ 2 là Lê Tuấn lên ngôi vua. Ngày 7 tháng 12 năm 1504 vua Túc Tông mất, ở ngôi được 6 tháng, thọ 17 tuổi."
    }, {
        "id": 66,
        "title": "Lê Uy Mục - Lê Tuấn",
        "description": "Lê Uy Mục - Lê Tuấn. Lê Uy Mục (1505-1509) tên huý là Tuấn, sinh ngày 5 tháng 5 năm 1488, mẹ là Chiêu Nhân Hoàng Thái hậu Nguyễn Thị Cận, người làng Phù Chẩn, huyện Đông Ngàn, Bắc Giang, lên ngôi vua ngày 22 tháng 1 năm 1505. Lê Uy Mục từ khi lên ngôi vua ham rượu chè, gái đẹp, thích giết người, tin dùng người họ mẹ. Sự tàn bạo quá đáng của Lê Uy Mục đã gây bất bình trong dân chúng và triều thần. Tháng 11 năm 1509, Giản Tu Công Oanh tự xưng là Cẩm Giang Vương ở Tây Đô (Thanh Hoá) đưa quân về chiếm Đông Kinh (Hà Nội) bắt được và bức Lê Uy Mục tự tử tháng 12/1509."
    }, {
        "id": 67,
        "title": "Lê Tương Dực - Lê Oanh",
        "description": "Lê Tương Dực - Lê Oanh. Lê Tương Dực (1509-1516) tên huý là Oanh, là cháu nội của vua Lê Thánh Tông, con thứ hai của Kiến Vương Lê Tân và bà Huy từ Hoàng Thái hậu Trịnh Thị Tuyên, người làng Thuỷ Chú, huyện Lôi Dương (tức Thọ Xuân, Thanh Hoá), sinh ngày 25 tháng 6 năm 1495. Sau khi giết Lê Uy Mục, Oanh tự lập làm Vua. Bản thân Lê Tương Dực cũng lao vào con đường ăn chơi truỵ lạc. Tháng 5/1514 nghe sàm tấu của Hiệu uý Hữu Vĩnh giết chết 15 Vương Công, cho gọi các cung nhân của triều trước vào cung để gian dâm. Trịnh Duy Sản nhiều lần can ngăn, Vua không nghe, còn đem Sản ra đánh bằng trượng. Tháng 4/1516, Trịnh Duy Sản sai đâm chết Tương Dực."
    }, {
        "id": 68,
        "title": "Lê Chiêu Tông - Lê Y",
        "description": "Lê Chiêu Tông - Lê Y. Lê Chiêu Tông (1516-1522) tên huý là Ý, có tên nữa là Huệ, cháu bốn đời của Lê Thánh Tông, con trưởng của Cẩm Giang Vương Lê Sùng và bà Hoàng Thái hậu Trịnh Thị Loan, người xã Phi Bạo, huyện Thanh Chương (Nghệ An). Sau khi giết Tương Dực, Trịnh Duy Sản và Lê Nghĩa Chiêu đón Lê Ý về tôn làm vua Lê Chiêu Tông lúc đó mới 11 tuổi. Dưới triều Lê Chiêu Tông, giặc giã nổi lên như ong, dân chúng khổ sở về cảnh loạn lạc, đầu rơi máu chảy. Mạc Đăng Dung là một trong những người phò lập vua, bằng tài năng quân sự nổi bật đã khôn khéo thâu tóm quyền hành. Quyền uy của Mạc Đăng Dung ngày một lớn. Bố con Mạc Đăng Dung ngày càng có mưu đồ thoán đoạt. Trước tình hình đó, Lê Chiêu Tông mưu ngầm với Trịnh Tuy tìm cách triệt hạ thế lực của họ Mạc. Mưu bị bại lộ, vua phải bỏ chạy khỏi kinh thành. Mạc Đăng Dung đã cùng triều thần lập Lê Xuân, em của Lê Chiêu Tông lên làm vua vào ngày 1 tháng 8 năm Nhâm Ngọ - 1522."
    }, {
        "id": 69,
        "title": "Lê Cung Hoàng - Lê Xuân",
        "description": "Lê Cung Hoàng - Lê Xuân. Lê Cung Hoàng (1522-1527) tên húy là Xuân được Mạc Đăng Dung lập lên làm vua khi 15 tuổi. Năm 1524, Mạc Đăng Dung tự mình thăng tước Bình Chương quân quốc trọng sự Thái phó Nhân quốc công. Tháng 10 năm 1525, Mạc Đăng Dung tự làm Đô tướng dẫn tất cả thuỷ, lục quân vào đánh Thanh Hoá, bắt được vua Lê Chiêu Tông đem về kinh sư giam cầm và đến tháng 12/1526 thì đem giết chết. Sau khi giết chết Lê Chiêu Tông, Mạc Đăng Dung rút quân về đóng ở Cổ Trai, nhưng vẫn chế ngự triều đình. Tháng 4/1527, Cung Hoàng sai Trung sứ Đỗ Hiếu Đế đến làng Cổ Trai tấn phong cho Đăng Dung làm An Hưng Vương. Mặc dù được vua ân sủng hậu đãi và giao phó trọng trách, nhưng Mạc Đăng Dung vẫn kiên quyết chớp thời cơ giành ngôi hoàng đế về cho họ Mạc. Ngày 15 tháng 6 năm Đinh Hợi - 1527, Mạc Đăng Dung đem quân từ Cổ Trai vào kinh đô Thăng Long ép vua phải nhường ngôi, bắt Vua và Thái hậu tự tử. Như vậy Lê Cung Hoàng ở ngôi được 5 năm, thọ 21 tuổi. Kể từ Lê Thái Tổ lên ngôi năm 1428 đến Lê Cung Hoàng bị giết vào năm 1527, trải qua 10 đời Vua, cả thảy đúng 99 năm. Các nhà sử học gọi là triều Lê Sơ."
    }, {
        "id": 70,
        "title": "Lê Trang Tông - Lê Duy Ninh",
        "description": "Lê Trang Tông - Lê Duy Ninh. Lê Trang Tông (1533-1548) tên huý là Duy Ninh, là con của vua Lê Chiêu Tông, mẹ là Phạm Thị Ngọc Quỳnh, cháu năm đời của Lê Thánh Tông. Khi Mạc Đăng Dung cướp ngôi nhà Lê, Duy Ninh mới 11 tuổi được Lê Quán cõng chạy sang Ai Lao đổi tên là Huyến. Đến tháng giêng năm Quý Tỵ - 1533 được Chiêu huân công Nguyễn Kim đón về lập lên làm vua, lúc đó Duy Ninh 19 tuổi. Duy Ninh lên làm vua đặt niên hiệu là Nguyên Hoà, tôn Nguyễn Kim làm Thượng phụ Thái sư Hưng quốc công, lấy Sầm Hà làm nơi hành tại, giao kết với vua Ai Lao là Xạ Đẩu để nhờ quân lương, mưu việc lấy lại nước."
    }, {
        "id": 71,
        "title": "Lê Trung Tông - Lê Huyên",
        "description": "Lê Trung Tông - Lê Huyên. Lê Trung Tông (1548-1556) tên huý là Huyên, là con của Lê Trang Tông, tính tình khoan dung, thông tuệ, có tài lược đế vương. Năm 1548 được lập làm vua khi mới 15 tuổi, lấy hiệu là Trung Tông, phong cho Trịnh Kiểm là Lương quốc công quyết định mọi việc triều chính. Năm 1554, nhà Lê mở khoa thi để chọn nhân tài, lấy đỗ Tiến sĩ đệ nhất giáp 5 người, đệ nhị giáp 8 người như Đinh Bạt Tuỵ, Chu Quang Trứ,... một số tướng tài giỏi như Lê Bá Ly, Nguyễn Khải Khang, Nguyễn Thiếu, Lê Khắc Thận... bỏ nhà Mạc vào Tây Đô phò giúp nhà Lê Trung Hưng. Tháng giêng năm 1556, Lê Trung Tông mất mới 22 tuổi, không có con, ở ngôi được 8 năm. Trịnh Kiểm bàn với các đại thần rằng: \"Nước không thể một ngày không vua\", liền sai người đi tìm con cháu nhà Lê, tìm được Lê Duy Bang là cháu sáu đời của Lam quốc công Lê Trừ (anh thứ hai của Lê Lợi) đang ở hương Bố Vệ, huyện Đông Sơn, Thanh Hoá, đón về lập làm vua."
    }, {
        "id": 72,
        "title": "Lê Anh Tông - Lê Duy Bang",
        "description": "Lê Anh Tông - Lê Duy Bang. Lê Anh Tông (1556-1573) tên huý là Duy Bang, dòng dõi nhà Lê. Anh thứ hai của Lê Lợi là Lê Trừ được phong là Lam quốc công, Trừ sinh ra Khang, Khang sinh ra Thọ, Thọ sinh ra Duy Thiệu, Thiệu sinh ra Duy Khoáng, Duy Khoáng lấy vợ ở hướng Bố Vệ sinh ra Duy Bang. Khi Lê Trung Tông mất không có con nối, thái sư Trịnh Kiểm và các đại thần tìm được Duy Bang đón về làm vua khi đó đã 25 tuổi. Mọi việc trong triều đều do Trịnh Kiểm quyết định, vua chỉ việc nghe theo. Cũng trong thời gian đó, Nguyễn Hoàng, con thứ 2 của Nguyễn Kim, nhờ chị gái là Ngọc Bảo - vợ Trịnh Kiểm, xin anh rể cho vào trấn thủ xứ Thuận - Quảng, được Trịnh Kiểm đồng ý cho đi. Tháng 2/1570, Trịnh Kiểm ốm nặng rồi mất. Anh em Trịnh Cối, Trịnh Tùng tranh giành nhau quyền bính, đánh lẫn nhau. Vua Lê Anh Tông đã trực tiếp điều hành triều chính và đứng ra dàn xếp các mâu thuẫn này, sau Trịnh Cối đem cả vợ con ra hàng nhà Mạc. Lê Anh Tông phong cho Trịnh Tùng tước Trưởng quận công nắm giữ binh quyền để đánh nhà Mạc. Tháng 3/1572, Lê Cập Đệ, cận thần nhà Lê, mưu giết tả tướng Trịnh Tùng. Việc không thành, Lê Cập Đệ bị Trịnh Tùng giết. Một số cận thần khác như Cảnh Hấp và Đình Ngạn nói với vua rằng: \"Tả tướng cầm quân quyền thế rất lớn, bệ hạ khó lòng tồn tại với ông ta được\", vua nghi hoặc, đang đêm đem theo bốn hoàng tử cùng chạy đến thành Nghệ An và ở lại đó. Tả tướng Trịnh Tùng cùng với triều thần lập con thứ 5 của Lê Anh Tông là Duy Đàm lên ngôi vua, và sai Nguyễn Hữu Liên đi đón vua Lê Anh Tông, khi về đến Lôi Dương - Thanh Hoá, ngầm bức hại vua rồi phao tin là vua tự thắt cổ. Như vậy Lê Anh Tông ở ngôi được16 năm, thọ 42 tuổi."
    }, {
        "id": 73,
        "title": "Lê Thế Tông - Lê Duy Đàm",
        "description": "Lê Thế Tông - Lê Duy Đàm. Lê Thế Tông (1573-1599) tên huý là Duy Đàm, sinh tháng 11/1567. Tháng 1/1573 được lập làm vua khi mới 7 tuổi, quyền hành tất cả ở trong tay tả tướng Trịnh Tùng. Sau gần 50 năm nội chiến Nam - Bắc Triều với gần 40 trận đánh lớn nhỏ, hàng vạn dân lành bị bắt vào lính, phục vụ cho các cuộc tàn sát khủng khiếp. Có trận mỗi bên huy động hàng chục vạn quân, hai bên giằng co khá quyết liệt, mãi đến năm 1591, Trịnh Tùng huy động tổng lực đánh trận quyết định ở Đông Kinh, tháng 11/1592 bắt được Mạc Mậu Hợp, chiếm được kinh thành. Tháng 2/1593, Trịnh Tùng đón Lê Thế Tông về kinh đô Đông Đô. Công cuộc Lê Trung Hưng đã hoàn thành. Trịnh Tùng tự xưng là Đô Nguyên suý Tổng quốc chính Thượng phụ Bình an vương toàn quyền quyết định. Vua chỉ ngồi chắp tay làm vì, bắt đầu thời kỳ \"vua Lê chúa Trịnh\". Ngày 24 tháng Tám năm Kỷ Hợi - 1599, Lê Thế Tông mất, ở ngôi được 26 năm, thọ 33 tuổi."
    }, {
        "id": 74,
        "title": "Mạc Thái Tổ - Mạc Đăng Dung",
        "description": "Mạc Thái Tổ - Mạc Đăng Dung. Mạc Đăng Dung (1527-1529) Mạc Đăng Dung quê ở làng Cổ Trai, huyện Nghi Dương (Hải Dương) là cháu bảy đời của trạng nguyên Mạc Đĩnh Chi làm quan đến chức Nhập nội hành khiển (Tể tướng) thời Trần, bố là Mạc Hịch, mẹ là Đặng Thị Hiến. Ông bà Mạc Hịch - Đặng Thị Hiến sinh được 3 người con trai là: Mạc Đăng Dung, Mạc Đăng Đốc và Mạc Đăng Quyết. Mạc Đăng Dung sinh ngày 23 tháng 11 năm Quý Mão - 1483. Thời trẻ, Mạc Đăng Dung có sức khoẻ phi thường, tướng mạo khôi ngô. Ông xuất thân từ một thanh niên nghèo, làm nghề đánh cá, trong một dịp đi thi võ ở kinh đô đã trúng Đô lực sĩ và được sung vào Châu túc vệ chuyên cầm dù đi theo vua. Mạc Đăng Dung tiến rất nhanh trên con đường hoan lộ, năm 1511 mới 29 tuổi đã được phong tước Vũ xuyên bá. Năm 1516, Mạc Đăng Dung được cử làm Trấn thủ Sơn Nam với chức Phó tướng tả đô đốc. Trải qua 3 đời vua Lê, Mạc Đăng Dung được phong Thái sư Nhân quốc công rồi đến An hưng vương. Lợi dụng lúc vua Lê Cung Hoàng ươn hèn, tháng 6 năm 1527, Mạc Đăng Dung từ Cổ Trai đem quân về kinh đô ép vua nhường ngôi, lập lên triều Mạc. Cũng như nhà Trần, tháng 12 năm 1529, Mạc Đăng Dung nhường ngôi cho con là Mạc Đăng Doanh làm vua, còn mình làm Thái thượng hoàng. Lúc đó Mạc Đăng Dung mới 46 tuổi. Mạc Đăng Dung mất tháng 8 năm Tân Sửu - 1541, thọ 59 tuổi."
    }, {
        "id": 75,
        "title": "Mạc Thái Tông - Mạc Đăng Doanh",
        "description": "Mạc Thái Tông - Mạc Đăng Doanh. Mạc Đăng Doanh (1530-1540) Mạc Đăng Doanh là con trưởng của Mạc Đăng Dung. Tháng Giêng năm 1530 Mạc Đăng Doanh lên ngôi vua, đổi niên hiệu là Đại Chính, tôn cha làm Thái thượng hoàng. Mạc Đăng Doanh làm cung điện nguy nga ở Cổ Trai để Thái thượng hoàng sống ở đó vui thú điền viên, nhưng ngụ ý là trấn giữ một vùng quan trọng làm ngoại viện cho Mạc Đăng Doanh và vẫn định đoạt những việc trọng đại của quốc gia. Từ khi Mạc Đăng Doanh lên ngôi vua thì ở Thanh Hoá, cựu thần nhà Lê là Nguyễn Kim dựa vào rừng núi ở biên giới Việt - Lào lãnh đạo lực lượng trung hưng nhà Lê ngày càng lớn mạnh. Năm Quý Tỵ - 1533, các cựu thần nhà Lê lập Lê Duy Ninh lên làm vua gọi là Lê Trang Tông. Dưới triều nhà Mạc, cứ 3 năm mở một kỳ thi Hội, thi Đình để tuyển chọn nhân tài. Nguyễn Bỉnh Khiêm đỗ trạng Nguyên dưới triều Mạc Đăng Doanh. Ngày 15 tháng Giêng năm Canh Tý - 1540, Mạc Đăng Doanh chết, ở ngôi được 10 năm."
    }, {
        "id": 76,
        "title": "Mạc Hiến Tông - Mạc Phúc Hải",
        "description": "Mạc Hiến Tông - Mạc Phúc Hải. Mạc Phúc Hải (1541-1546) Mạc Phúc Hải là con trưởng của Mạc Đăng Doanh, được ông nội là Thái thượng hoàng Mạc Đăng Dung lập làm vua vào năm Tân Sửu - 1541. Thời Mạc Phúc Hải đã tiến hành chia cấp lộc điền, đặc biệt ưu tiên binh sĩ, vì lực lượng quân sĩ to lớn được nuôi dưỡng để chống lại nhà Lê trung hưng (Nam Triều). Ngày 8 tháng 5 năm Bính Ngọ - 1546, Mạc Phúc Hải chết, ở ngôi vua được 5 năm. Con trưởng là Mạc Phúc Nguyên kế vị."
    }, {
        "id": 77,
        "title": "Mạc Tuyên Tông - Mạc Phúc Nguyên",
        "description": "Mạc Tuyên Tông - Mạc Phúc Nguyên. Mạc Phúc Nguyên (1546-1561) Mạc Phúc Nguyên lên ngôi vua vào tháng 5 năm 1546, lúc đó còn nhỏ tuổi, mọi công việc triều chính đều do chú ruột là Khiêm vương Mạc Kính Điển quyết đoán cả. Tháng 7/1557, Mạc Phúc Nguyên sai Mạc Kính Điển đem quân vào đánh Thanh Hoá. Quân Mạc thua to, Mạc Kính Điển phải nhảy xuống sông ẩn nấp suốt 3 ngày mới thoát chết. Đến năm Kỷ Mùi - 1559, quân Lê - Trịnh mở cuộc tấn công vào hậu phương của nhà Mạc ở Sơn Tây, Tuyên Quang, Hưng Hoá, Kinh Bắc, Hải Dương... Mạc Phúc Nguyên phải rút vào phòng thủ ở ngoài thành Đông Đô. Tháng 12/1561, giữa lúc cuộc chiến Lê - Mạc đang gay go quyết liệt nhất thì Mạc Phúc Nguyên chết vì bệnh đậu mùa. Mạc Phúc Nguyên làm vua được 15 năm."
    }, {
        "id": 78,
        "title": "Mạc Mậu Hợp",
        "description": "Mạc Mậu Hợp. Mạc Mậu Hợp (1562-1592) Mạc Mậu Hợp là con cả của Mạc Phúc Nguyên, năm 1562 lên ngôi vua hãy còn bé, ứng vương Mạc Đăng Nhượng (con út Mạc Đăng Dung) làm Nhập nội phụ chính ẵm Mạc Mậu Hợp ra coi chầu, tôn ông chú là Khiêm vương Mạc Kính Điển làm Khiêm đại vương cùng trông coi việc triều chính. Ngày 21 tháng 2 năm Mậu Dần - 1578, Mạc Mậu Hợp bị sét đánh ở trong cung, liệt nửa người, sau chữa thuốc lại khỏi, bèn đổi niên hiệu là Diên Khánh. Tháng 10 năm Canh Thìn - 1580, Phụ chính Mạc Kính Điển, trụ cột của triều Mạc chết, ứng vương Mạc Đăng Nhượng giữ quyền phụ chính quyết định mọi việc nhưng lại thường về sống ở Dương Kinh vì vậy việc triều chính bê bối không ai quyết đoán. Năm 1581, Mạc Mậu Hợp bị chứng thong manh, chữa mãi mới khỏi. Khỏi bệnh, Mạc Mậu Hợp lao vào ăn chơi truỵ lạc. Chính sự nhà Mạc ngày càng đổ nát, binh lực suy yếu, lòng người ly tán. Ngày 25 tháng 11 năm 1592, thủy quân Lê - Trịnh gồm 300 chiến thuyền đánh vào các huyện Kim Thành, Thanh Hà, Nam Sách, Kinh Môn (tỉnh Hải Dương ngày nay). Quân Mạc tan vỡ, dư Đảng nhà Mạc xin hàng Trịnh Tùng rất đông. Mạc Mậu Hợp chạy trốn, bị bắt giải về kinh đô Đông Đô, bị treo sống 3 ngày rồi bị chém đầu ở bãi cát Bồ Đề. Mạc Mậu Hợp ở ngôi vua được 30 năm, khi chết 31 tuổi. Con trai Mạc Mậu Hợp là Mạc Toàn chạy trốn, sau bị quân Trịnh bắt được đem chém đầu tại bến Thảo Tân. Họ Mạc từ Mạc Đăng Dung đến Mạc Mậu Hợp truyền ngôi được 5 đời thì mất, tổng cộng được 65 năm. Con cháu nhà Mạc theo lời dạy của Trạng Trình Nguyễn Bỉnh Khiêm rút lên Cao bằng, còn kéo dài được đến năm 1677 mới bị diệt hẳn: Mạc Toàn (1592-1592) Mạc Kính Chỉ (1592-1593) Mạc Kính Cung (1593-1625) Mạc Kính Khoan (1623-1625) Mạc Kính Vũ (1638 - 1677) Như vậy nhà Mạc tồn tại đúng 150 năm."
    }, {
        "id": 79,
        "title": "Lê Kính Tông - Lê Duy Tân",
        "description": "Lê Kính Tông - Lê Duy Tân. Lê Kính Tông (1600-1619) tên huý là Duy Tân, con thứ của Lê Thế Tông, ngày 27 tháng Tám năm Kỷ Hợi - 1599 được Trịnh Tùng lập làm vua, khi đó mới 11 tuổi. Từ đầu thế kỷ 17, sau khi đánh tan nhà Mạc, giành lại được kinh đô Đông Đô (dư đảng nhà Mạc phải rút lên Cao Bằng) quyền lực của Trịnh Tùng ngày càng lớn, triều đình chỉ biết phục vụ nhà chúa. Trước tình hình đó, vua Lê Kính Tông cùng với Trịnh Xuân - con thứ của Trịnh Tùng - mưu giết Trịnh Tùng. Việc bại lộ, Trịnh Xuân bị bắt giam, còn Kính Tông bị bức thắt cổ chết vào ngày 12 tháng Năm năm Kỷ Mùi - 1619. Lê Kính Tông ở ngôi được 19 năm, thọ 32 tuổi."
    }, {
        "id": 80,
        "title": "Lê Thần Tông - Lê Duy Kỳ",
        "description": "Lê Thần Tông - Lê Duy Kỳ. Lê Thần Tông (1619-1643 và 1649-1662) tên huý là Duy Kỳ, con trưởng của Lê Kính Tông và bà Trịnh Thị Ngọc Trinh (con thứ của Trịnh Tùng). Duy Kỳ sinh ngày 19 tháng 11 năm Đinh Mùi - 1607, là cháu ngoại của Bình An Vương Trịnh Tùng, tháng 6 năm 1619 được lập làm vua khi đó mới 12 tuổi. Vua có sống mũi cao, thông minh, học rộng, mưu lược sâu, văn chương giỏi. Song lấy Trịnh Thị Ngọc Trúc (là vợ của chú họ) để tiếng xấu về sau. Tháng 10/1643, Lê Thần Tông nhường ngôi cho con là Lê Duy Hựu (tức Lê Chân Tông) để làm Thái thượng hoàng."
    }, {
        "id": 81,
        "title": "Lê Chân Tông - Lê Duy Hựu",
        "description": "Lê Chân Tông - Lê Duy Hựu. Lê Chân Tông (1643-1649) tên huý là Duy Hựu, con trưởng của Lê Thần Tông, được truyền ngôi vào năm 13 tuổi, ở ngôi được 6 năm, năm 1649 bị bệnh mất, mới 20 tuổi, chưa có con nối ngôi. Lê Thần tông trở lại ngôi vua lần thứ 2"
    }, {
        "id": 82,
        "title": "Lê Thần Tông - Lê Duy Kỳ (Hạ)",
        "description": "Lê Thần Tông - Lê Duy Kỳ (Hạ). Ngày 22 tháng 9 năm 1662, Lê Thần Tông mất thọ 56 tuổi, ở ngôi 24 năm, làm Thái thượng hoàng 6 năm, lại lên ngôi 13 năm, tổng cộng làm vua 2 lần 37 năm."
    }, {
        "id": 83,
        "title": "Lê Huyền Tông - Lê Duy Vũ",
        "description": "Lê Huyền Tông - Lê Duy Vũ. Lê Huyền Tông (1663-1671) tên huý là Duy Vũ, con thứ của Lê Thần Tông, em của Lê Chân Tông, được lập làm vua mới 9 tuổi, ở ngôi vua được 8 năm, ngày 15 tháng 10 năm Tân Hợi - 1671, Lê Huyền Tông mất mới 18 tuổi, chưa có con nối."
    }, {
        "id": 84,
        "title": "Lê Gia Tông - Lê Duy Hợi",
        "description": "Lê Gia Tông - Lê Duy Hợi. Lê Gia Tông (1672-1675) tên huý là Duy Hợi con thứ của Lê Thần Tông, em của Lê Chân Tông và Lê Huyền Tông, được lập làm vua lúc mới 11 tuổi. Vua tướng mạo anh tú, tính tình khoan hoà, có đức độ làm vua, tiếc rằng ở ngôi được 3 năm, chết mới 15 tuổi, chưa có con nối."
    }, {
        "id": 85,
        "title": "Lê Hy Tông - Lê Duy Hợp",
        "description": "Lê Hy Tông - Lê Duy Hợp. Lê Hy Tông (1675-1705) Lê Hy Tông tên huý là Duy Hợp, con thứ của Lê Thần Tông, em của Lê Gia Tông, được Tây vương Trịnh Tạc lập làm vua lúc mới 13 tuổi. Nhà vua dựa vào chúa Trịnh để giữ cơ nghiệp có sẵn, kỷ cương được chấn hưng, được người đời ca ngợi là vua bậc nhất thời Lê Trung Hưng. Tháng 4 năm Ất Dậu - 1705, nhường ngôi cho con trưởng là Lê Duy Đường. Vua Lê Hy Tông còn vui sống trong cảnh nhàn 12 năm sau mới mất, ở ngôi được 30 năm, thọ 54 tuổi."
    }, {
        "id": 86,
        "title": "Lê Dụ Tông - Lê Duy Đường",
        "description": "Lê Dụ Tông - Lê Duy Đường. Lê Dụ Tông (1705-1729) Lê Dụ Tông tên huý là Duy Đường, con trưởng của Lê Hy Tông, được lên ngôi vua năm 1705. Nhà vua rũ áo, ngồi ở trên, dựa vào chúa Trịnh Cương và quần thần giúp việc đắc lực như Nguyễn Công Hãng, Lê Anh Tuấn v.v... Họ đưa ra chủ trương cải cách trên nhiều lĩnh vực về kinh tế - tài chính, thi cử, tổ chức hành chính... nhưng các cải cách đó chưa thu được kết quả thì chúa Trịnh Cương qua đời. Ngày 20 tháng 4 năm 1729, Lê Dụ Tông nhường ngôi cho con là Duy Phường. Tháng Giêng năm 1731, Thượng hoàng Lê Dụ Tông mất, thọ 52 tuổi, ở ngôi 24 năm."
    }, {
        "id": 87,
        "title": "Hôn Đức Công - Lê Duy Phường",
        "description": "Hôn Đức Công - Lê Duy Phường. Lê Duy Phường (1729-1732) Thái tử Lê Duy Phường là con thứ của Lê Dụ Tông, cháu ngoại của chúa Trịnh Cương, được vua cha nhường ngôi năm 1729, nhưng khi Trịnh Cương mất thì ngôi vua của Duy Phường không đứng vững. Khi Trịnh Giang lên nối ngôi chúa, tháng 8/1732 đã giáng Duy Phường xuống làm Hôn Đức Công và buộc thắt cổ chết vào tháng 9/1735. Trịnh Giang lập con trưởng của Lê Dụ Tông là Duy Tường lên làm vua."
    }, {
        "id": 88,
        "title": "Lê Thuần Tông - Lê Duy Tường",
        "description": "Lê Thuần Tông - Lê Duy Tường. Lê Thuần Tông (1732-1735) Lê Thuần Tông tên huý là Duy Tường, con trưởng của Lê Dụ Tông được chúa Trịnh Giang lập làm vua năm 1732, đổi niên hiệu là Long Đức. Năm 1735, Thuần Tông mất, thọ 37 tuổi, làm vua được 3 năm. Lê Thuần Tông mất, chúa Trịnh Giang lập Duy Thìn là con thứ 11 của Lê Dụ Tông lên làm vua."
    }, {
        "id": 89,
        "title": "Lê Ý Tông - Lê Duy Thìn",
        "description": "Lê Ý Tông - Lê Duy Thìn. Lê Ý Tông (1735-1740) Lê Ý Tông tên huý là Duy Thìn lêm làm vua mới 17 tuổi. Chúa Trịnh Giang là kẻ vô cùng bạo ngược, sát hại công thần, giết vua nọ lập vua kia. Vì thế, tháng 12 năm 1738, các tôn thất nhà Lê như Duy Mật, Duy Quý (con Dụ Tông), Duy Chúc (con Hy Tông) nổi lên chiếm cứ miền thượng du tây nam Thanh Hoá chống nhau với nhà Trịnh ròng rã 30 năm. Từ ngày giết vua, Trịnh Giang ngày càng lấn át quyền vua. Trịnh Giang tha hồ ăn chơi trác táng, vì thế mắc bệnh kinh quý, sợ sấm sét. Bọn hoạn quan Hoàng Công Phụ cho đào đất làm cung thưởng trì dưới hầm cho Trịnh Giang ở. Bọn hoạn quan tha hồ lũng đoạn triều đình. Các quan đại thần kế tiếp nhau bị giết hại, thuế khoá nặng nề, lòng dân ly tán. Các cuộc khởi nghĩa của nhân dân nổ ra khắp nơi. Trước tình hình nguy ngập đó. Trịnh Thái Phi (mẹ Trịnh Giang và Trịnh Đường) cho triệu quần thần đến đưa Trịnh Doanh lên thay Trịnh Giang để trừ hoạn nạn. Năm 1740, Trịnh Doanh lên thay Trịnh Giang, tháng 5 năm 1740, Trịnh Doanh ép Lê ý Tông nhường ngôi cho con trưởng của Thuần Tông là Duy Diêu. 19 năm sau Lê ý Tông mất, thọ 40 tuổi, trị vì được 5 năm."
    }, {
        "id": 90,
        "title": "Lê Hiển Tông - Lê Duy Diêu",
        "description": "Lê Hiển Tông - Lê Duy Diêu. Lê Hiển Tông (1740-1786) Lê Hiển Tông tên huý là Duy Diêu, là ông vua trị vì lâu thứ 2 trong lịch sử phong kiến nước ta - 46 năm, và thọ 70 tuổi. Nhờ có tài giúp đỡ của Minh Vương Trịnh Doanh nên mười năm sau đất nước trở lại bình yên, dân được an cư lạc nghiệp, được ca ngợi là thời thái bình. Tháng Giêng năm 1764, Hiển Tông lập Duy Vĩ làm thái tử. Năm 1767 Trịnh Doanh mất, Trịnh Sâm lên thay làm nguyên soái Tĩnh Đô Vương, tháng 3 năm 1769, Trịnh Sâm truất ngôi thái tử của Duy Vĩ rồi bắt giam vào ngục. Tháng 8 năm 1769, Trịnh Sâm giả mệnh vua truất thái tử làm thứ dân rồi vẫn giam ở ngục, lập Duy Cận con thứ của Lê Hiển Tông làm thái tử. Tháng 12/1771, Trịnh Sâm sai giết thái tử Duy Vĩ, đến tháng Giêng năm 1783 lập Duy Kỳ làm Hoàng Thái Tôn, truất Duy Cận làm Sùng nhượng công."
    }, {
        "id": 91,
        "title": "Lê Chiêu Thống - Lê Duy Kỳ",
        "description": "Lê Chiêu Thống - Lê Duy Kỳ. Lê Mẫn Đế (Chiêu Thống, 1787-1788) Lê Chiêu Thống tên huý là Duy Kỳ, cháu đích tôn của Lê Hiển Tông. Duy Kỳ được quân tam phủ đưa từ trại giam về ép vua và chúa Trịnh Khải lập làm Hoàng Thái Tôn.Tháng 7/1786, trước khi vua Lê Hiển Tông mất đã cho gọi Thái Tôn, Duy Kỳ vào trối lời truyền ngôi. Duy Kỳ vừa lạy vừa khóc xin nhận mệnh. Lúc đó Bắc Bình Vương Nguyễn Huệ đã cưới công chúa Ngọc Hân. Khi Nguyễn Nhạc và Nguyễn Huệ rút quân về Phú Xuân (Huế) thì các hào mục ở các nơi nổi dậy cắt cứ. Trịnh Bồng cũng trở lại kinh đô Thăng Long tự lập làm nguyên soái Yến Đô vương và lấn át nhà vua như trước, khiến cho triều chính rối ren, chém giết lẫn nhau. Nguyễn Huệ lại phải kéo quân ra Bắc dẹp loạn, chiêu tập các cựu thần văn võ nhà Lê, lấy Sùng Nhượng Công Lê Duy Cận đứng làm Giám quốc và giao cho Ngô Văn Sở làm Đại đô đốc ở Thăng Long, rồi Nguyễn Huệ lại rút quân về Phú Xuân. Để khôi phục lại triều Lê, tháng 7/1788 Hoàng thái hậu nhà Lê sang cầu viện nhà Mãn Thanh. Dựa vào thế quân Mãn Thanh, Lê Chiêu Thống trở lại kinh đô Thăng Long đã trả thù tàn bạo những người theo Tây Sơn. Mồng 5 tết năm Kỷ Dậu (1789), quân đội Tây Sơn do hoàng đế Quang Trung trực tiếp chỉ huy kéo ra Bắc đã đánh tan 29 vạn quân xâm lược Mãn Thanh ở gò Đống Đa giành độc lập cho tổ quốc ta. Lê Chiêu Thống, vua bán nước, đã cùng 25 bầy tôi chạy theo tàn quân nhà Thanh sang Trung Quốc. Sau năm năm sống lưu vong nhục nhã trên đất Mãn Thanh, tháng 10 năm Quý Sửu (1793), Lê Chiêu Thống chết ở Yên Kinh (Trung Quốc) thọ 28 tuổi, ở ngôi vua chưa được 3 năm. Như vậy nhà Lê Trung Hưng từ Lê Trang Tông đến vua Lê Chiêu Thống trải qua 16 đời vua với 255 năm trị vì."
    }, {
        "id": 92,
        "title": "Thế Tổ Minh Khang - Thái Vương Trịnh Kiểm",
        "description": "Thế Tổ Minh Khang - Thái Vương Trịnh Kiểm. Thế tổ Minh khang Thái vương (Trịnh Kiểm, 1545-1570) Trịnh Kiểm người làng Sóc Sơn, huyện Vĩnh Lộc, tỉnh Thanh Hoá. Truyện kể rằng: Trịnh Kiểm mồ côi cha từ nhỏ, nhà nghèo hai mẹ con rau cháo nuôi nhau, khi mẹ đã già thì Kiểm đi làm thuê, gánh mướn nuôi mẹ. Một hôm đi làm về, không thấy mẹ, Kiểm bổ đi tìm đến sáng thì được tin mẹ anh đã chết đuối ở vực gần nhà, khi ra vực, Kiểm thấy mối đã đùn thành gò rồi, Kiểm buồn lắm bỏ làng ra đi, vào nương nhờ làm gia tướng cho thái phó Nguyễn Kim. Trịnh Kiểm không được học hành nhiều, nhưng rất thông minh, can đảm và mưu lược hơn người. Nguyễn Kim mến tài đem con gái yêu là Ngọc Bảo gả cho Kiểm. Năm 1533, Nguyễn Kim sai Trịnh Kiểm đem quân sang Ai Lao đón Lê Duy Ninh về lập làm vua là Lê Trang Tông. Vua thấy Trịnh Kiểm tướng mạo khác thường, bèn phong cho là Đại tướng quân, lúc đó Kiểm 37 tuổi. Năm Ất Tỵ - 1545, Nguyễn Kim bị hàng tướng nhà Mạc đánh thuốc độc chết, binh quyền về tay Trịnh Kiểm. Vua Lê Trang Tông ở ngôi chí tôn nhưng quyền hành đều do Trịnh Kiểm nắm giữ. Năm 1548 Trang Tông mất, Trịnh Kiểm lập thái tử Huyên (con Trang Tông) lên nối ngôi là Trung Tông. Vua Trung Tông cũng chỉ ở ngôi được 8 năm thì mất khi mới 22 tuổi, không có con nối ngôi. Trịnh Kiểm muốn nhân dịp này tự lập làm vua, nhưng còn phân vân, bèn sai Phùng Khắc Khoan đi hỏi ý kiến Trạng Trình. Cụ Trạng trả lời với thâm ý khuyên Trịnh Kiểm hãy tôn phò nhà Lê cho thuận lòng dân. Hiểu ý, Trịnh Kiểm sai người đến làng Bố Vệ rước Lê Duy Bang về lập làm vua tức là Lê Anh Tông. Từ khi nắm quyền bính, Trịnh Kiểm ra sức củng cố lực lượng, thu hút nhân tài, nên Nam triều ngày càng mạnh lên. Nhà Mạc (Bắc triều) sai đại tướng Mạc Kính Điển đem quân vào đánh Thanh Hoá tới 10 lần, ngược lại Trịnh Kiểm cũng kéo quân ra đánh Sơn Nam trước sau 6 lần. Nam triều đã lấy lại được các huyện Yên Mô, Yên Khang, Phụng Hoá, Gia Viễn. Năm Kỷ Tỵ - 1569, vua Lê gia phong cho Trịnh Kiểm làm Thượng tướng Thái quốc công và tôn là Thượng phụ. Tháng 2 năm Mậu Ngọ - 1570, Trịnh Kiểm mất, truy tôn làm Minh khang Thái vương, thuỵ là Trung Huân. Trịnh Kiểm nắm quyền của Nam triều 26 năm trải qua ba đời vua, thọ 68 tuổi."
    }, {
        "id": 93,
        "title": "Bình An Vương - Trịnh Tùng",
        "description": "Bình An Vương - Trịnh Tùng. Bình An Vương (Trịnh Tùng, 1570-1623) Khi Trịnh Kiểm chết, vua Lê Anh Tông trao quyền bính cho Trịnh Cối (con vợ cả của Trịnh Kiểm). Nhưng Trịnh Cối ham mê tửu sắc, ngày càng kiêu ngạo, càn rỡ, các tướng lĩnh không phục. Tháng 4 năm Canh Ngọ - 1570, các tướng như Lê Cập Đệ, Trịnh Vĩnh Thiệu, Trịnh Bách, Phan Công Tích đem quân theo về với Trịnh Tùng. Trịnh Tùng là con thứ của Trịnh Kiểm với Ngọc Bảo (con gái Nguyễn Kim). Tùng khôi ngô tuấn tú, có tài thao lược, trọng nhân tài nên được tướng sĩ yêu mến. Trịnh Tùng cùng các tướng sĩ phò giá vua Lê Anh Tông vào thành Vạn Lại, chia quân canh giữ đề phòng Trịnh Cối. Trịnh Cối đích thân đem hơn một vạn quân đến bao vây thành Vạn Lại. Hai bên đánh nhau giằng co bảy ngày, vua Lê Anh Tông đứng ra hoà giải cũng không được. Cuối cùng Trịnh Cối phải rút quân về Biện Thượng. Được tin anh em họ Trịnh đánh nhau, tháng 8 năm Canh Ngọ - 1570, vua Mạc sai Mạc Kính Điển đem 10 vạn quân và 700 chiến thuyền vào đánh Thanh Hoá. Trịnh Cối lo sợ, vội đem mẹ, vợ con và các thuộc tướng đến hàng nhà Mạc. Mạc Kính Điển phong cho Cối làm Trung Lương hầu. Vua Lê Anh Tông phong cho Trịnh Tùng làm Trưởng quân công, Tiết chế thuỷ bộ chủ dinh cầm quân đánh Mạc. Tháng 12 năm đó, sau 4 tháng tấn công vào Thanh Hoá không thắng được. Mạc Kính Điển phải rút quân về Bắc. Trịnh Cối cùng mẹ và vợ con chạy theo quân Mạc. Năm Nhâm Thân - 1572, Lê Cập Đệ mưu giết Trịnh Tùng bị lộ, Lê Cập Đệ bị Trịnh Tùng giết chết. Vua Lê Anh Tông sợ hãi đang đêm đem 4 hoàng tử chạy vào thành Nghệ An. Trịnh Tùng đưa hoàng tử thứ 5 của vua Lê là Duy Đàm lên làm vua, hiệu là Lê Thế Tông. Sau hơn mười năm liên tục mở các cuộc tấn công ra Bắc, cuối cùng Trịnh Tùng đã đánh bại được nhà Mạc. Khôi phục được cố đô Thăng Long vào năm 1592. Năm Ất Mùi - 1595, Trịnh Tùng đón vua vào Thăng Long và bắt đầu tổ chức bộ máy cai trị theo quy mô của bậc đế vương. Trịnh Tùng sai sứ sang nhà Minh xin sắc phong cho vua Lê là An Nam thống sứ, và buộc vua Lê phong cho mình làm Đô nguyên suý Tổng quân quốc chính thượng phụ, tước Bình An vương. Trịnh Tùng cho lập phủ liêu riêng gồm đủ cả lục phiên tương đương với lục bộ của triều vua. Phủ chúa toàn quyền đặt quan chức, thu thuế, bắt lính... Vua chỉ có mặt trong những dịp long trọng đặc biệt như tiếp sứ Tàu mà thôi. Từ đấy bắt đầu thời kỳ \"vua Lê - chúa Trịnh\". Con chúa Trịnh được quyền thế tập gọi là Thế tử. Trước sự hống hách lộng quyền của chúa Trịnh, vua Lê Kính Tông đã cùng với con Trịnh Tùng là Trịnh Xuân mưu giết Trịnh Tùng. Việc bại lộ, Trịnh Tùng bức vua thắt cổ chết, lúc đó mới 32 tuổi. Tùng đưa thái tử Duy Kỳ lên ngôi vua là Lê Thần Tông. Ngày 20 tháng 6 năm Quý Hợi - 1623, Trịnh Tùng mất, cầm quyền 53 năm, thọ 74 tuổi."
    }, {
        "id": 94,
        "title": "Thanh Đô Vương - Trịnh Tráng",
        "description": "Thanh Đô Vương - Trịnh Tráng. Thanh Đô Vương (Trịnh Tráng, 1623-1652) Mạc Kính Khoan đang chiếm cứ Cao Bằng nghe tin Trịnh Tùng chết, các con (Trịnh Xuân, Trịnh Tráng) đánh nhau để giành ngôi chúa, liền từ Cao Bằng kéo hàng vạn quân xuống Gia Lâm. Trịnh Tráng phải rước vua Lê chạy vào Thanh Hoá. Tháng 8 năm Quí Hợi - 1523, Trịnh Tráng đem quân ra phá tan quân của Kính Khoan. Kính Khoan một mình chạy thoát thân. Trịnh Tráng lại rước vua Lê trở lại kinh đô, vua Lê phong cho Trịnh Tráng chức Nguyên suý thống quốc chính Thanh Đô Vương. Tạm yên mặt Bắc, Trịnh Tráng lo đối phó mặt Nam. Lúc này ở Đàng Trong, chúa Nguyễn Phúc Nguyên đã ra mặt chống lại chúa Trịnh ở Đàng Ngoài. Trịnh Tráng nhiều lần lấy danh nghĩa vua Lê đem quân đi đánh Phúc Nguyên nhưng quân Nguyễn lợi dụng địa thế hiểm trở, đắp luỹ dài chống cự quyết liệt, quân Trịnh không làm gì được, phải rút về. Để thắt chặt thêm quan hệ gắn bó giữa nhà chúa và vua Lê, Trịnh Tráng đem con gái của mình (đã lấy chồng có bốn con với chú họ của vua Lê) gả cho vua Lê, ép vua lập làm Hoàng hậu. Vua Lê phải chấp nhận. Năm ất Dậu - 1645, Trịnh Tráng xin vua Lê phong cho con thứ hai là Tây quận công Trịnh Tạc làm Khâm sai tiết chế các sứ thuỷ bộ chủ dinh chương quốc quyền binh, tả tướng thái uý Tây quốc công và được quyền nối ngôi chúa. Năm Đinh Dậu - 1657, Trịnh Tráng mất thọ 81 tuổi, ở ngôi chúa 30 năm."
    }, {
        "id": 95,
        "title": "Tây Định Vương - Trịnh Tạc",
        "description": "Tây Định Vương - Trịnh Tạc. Tây Đô Vương (Trịnh Tạc, 1653-1682) Trịnh Tạc là con thứ hai được cha chọn làm Nguyên suý chưởng quốc chính Tây Định Vương từ năm Quí Tỵ - 1653, khi Trịnh Tráng đang còn sống. Sự không chọn Trịnh Toàn là con trưởng nối ngôi chúa đã dẫn đến mâu thuẫn ngấm ngầm giữa Toàn và Tạc. Năm Định Dậu - 1657, Trịnh Tạc đã sai đình thần tống ngục và tra hỏi Trịnh Toàn cho đến chết. Năm Đình Mùi - 1667, Trịnh Tạc tự gia phong Đại nguyên soái thượng sư Thái phụ Tây Đô Vương. Năm Nhâm Tí - 1672, Trịnh Tạc ép vua Lê đem quân vào đánh chúa Nguyễn một trận lớn ở châu Bố Chính, quân Trịnh chiếm được luỹ Trấn Ninh, huy động 3 vạn quân vượt sông Gianh đánh vào cửa Nhật Lệ. Quân Nguyễn ra sức chống cự nhờ có hệ thống thành luỹ kiên cố, tháng 12/1672, Trịnh Tạc phải rút đại binh về chỉ để Lê Thời Hiến trấn giữ Nghệ An. Từ đó Đàng Ngoài và Đàng Trong tạm ngừng chiến, lấy sông Gianh làm giới tuyến. Tháng 7 năm Giáp Dần - 1674, Trịnh Tạc xin vua Lê phong cho con là Trịnh Căn làm Nguyên soái. Năm Tân Dậu - 1682, Trịnh Tạc mất, thọ 77 tuổi, ở ngôi chúa 29 năm."
    }, {
        "id": 96,
        "title": "Định Nam Vương - Trịnh Căn",
        "description": "Định Nam Vương - Trịnh Căn. Định Vương (Trịnh Căn, 1682-1709) Trịnh Căn là con trưởng của Trịnh Tạc được nối ngôi chúa là Định Vương. Dưới thời Trịnh Căn, chiến tranh Trịnh - Nguyễn đã tạm dừng. Trịnh Căn có điều kiện để củng cố bộ máy cai trị. Giúp việc cho chúa Trịnh lúc đó có nhiều người đỗ đạt cao như Nguyễn Danh Nho, Nguyễn Tông Quai, Nguyễn Quí Đức, Đặng Đình Tường nên đã ổn định được xã hội, kinh tế phát triển. Bằng nhiều cố gắng ngoại giao, chúa Trịnh buộc nhà Thanh trả lại một số thôn ấp vùng biên giới mà họ đã lấn chiếm của ta, nhưng chưa được nhiều. Chúa Trịnh Căn gặp nhiều trắc trở trong việc lập người kế nghiệp. Năm Giáp Tí - 1684, Trịnh Căn phong cho con thứ là Trịnh Bách làm Tiết chế thay cho con cả là Vĩnh đã chết, nhưng đến năm Đinh Mão - 1687, Trịnh Bách lại chết sớm. Trịnh Căn lại phong cho Trịnh Bính là cháu nội đích tôn (con Trịnh Vĩnh) nối ngôi, nhưng đến năm Quí Mùi - 1703, Trịnh Bính cũng chết, Trịnh Căn lại phải phong cho chắt nội (con cả Trịnh Bính) là Trịnh Cương làm Tiết chế An quốc công. Năm Kỷ Sửu - 1709, Trịnh Căn mất. Chắt là Trịnh Cương lên nối ngôi. Trịnh Căn thọ 77 tuổi ở ngôi chúa 27 năm."
    }, {
        "id": 97,
        "title": "An Đô Vương - Trịnh Cương",
        "description": "An Đô Vương - Trịnh Cương. An đô vương (Trịnh Cương, 1709-1729) Trịnh Cương lên ngôi chúa, được phong làm Nguyên soái tổng quốc chính An đô vương năm 1709. Tháng 9 năm Giáp Ngọ (17 14) Trịnh Cương lại được tiến phong Đại nguyên soái tổng quốc chính Thượng sư An đô vương. Trịnh Cương biết giữ mối quan hệ tốt với vua Lê, đồng thời chăm lo việc trị nước. Chúa trọng dụng ba đại thần rất trẻ nhưng có tài là Lê Anh Tuấn, Nguyên Công Cơ và Nguyễn Công Hãng. Họ đã đưa ra chủ trương cải cách trên nhiều lĩnh vực về kinh tế, tài chính, thi cử, tổ chức hành chính.. . nhưng các cải cách tiến bộ đó đang được tiến hành thì Trịnh Cương mất. Năm Kỷ Dậu (1729), Trịnh Cương đi vãng cảnh chùa Phật Tích rồi Như Kinh, bị bệnh, chết ngay tại đó, quan quân bí mật đưa về phủ Chúa phát tang. Tiếc thay vị chúa có nhiều tâm huyết với công cuộc cải cách kinh tế, chính trị đã mất ở tuổi 44, ở ngôi chúa 20 năm."
    }, {
        "id": 98,
        "title": "Uy Nam Vương - Trịnh Giang",
        "description": "Uy Nam Vương - Trịnh Giang. Uy nam vương (Trịnh Giang, 1729-1740) Trịnh Giang là con cả Trịnh Cương. Khi Giang còn làm Thế từ, bảo phó của Giang là Nguyễn Công Hãng đã dâng một số nhận xét rằng Giang là người ươn hèn không thể gánh vác được ngôi chúa. Trịnh Cương đã có ý thay ngôi Thế tử, nhưng chưa dứt khoát thì Trịnh Cương đột ngột mất, Trịnh Giang với tư cách là Thế tử lên nối ngôi chúa. Tháng 4 năm Canh Tuất (1739) Giang tự tiến phong là Nguyên soái thống quốc chính Uy nam vương. Chúa Trịnh Giang là kẻ vô cùng bạo ngược, sát hại công thần, giết vua Lê Duy Phường, lập vua Lê ý Tông. Trịnh Giang ngày càng lấn át quyền vua, tha hồ ăn chơi trác táng. Một hôm Trịnh Giang bị sét đánh gần chết nên mắc bệnh kinh hãi, sợ sấm sét. Bọn hoạn quan Hoàng Công Phụ cho đào đất làm Cung Thưởng Trì dưới hầm cho Trịnh Giang ở. Bọn hoạn quan tha hồ lũng đoạn triều chính. Các quan đại thần kế tiếp nhau bị giết hại, thuế khóa nặng nề, lòng dân ly tán. Các cuộc khởi nghĩa của nhân dân nổ ra khắp nơi. Trước tình hình nguy ngập đó, Trịnh Thái Phi (mẹ Trịnh Giang và Trịnh Doanh) cho triệu quần thần đến đưa Trịnh Doanh lên thay Trịnh Giang để trừ họa nạn. Trịnh Giang ở ngôi chúa 11 năm, năm 1760 mới mất thọ 51 tuổi."
    }, {
        "id": 99,
        "title": "Minh Đô Vương - Trịnh Doanh",
        "description": "Minh Đô Vương - Trịnh Doanh. Minh đô vương (Trịnh Doanh, 1740-1767) Năm Canh Thân (1740), 'Trịnh Doanh lên ngôi chúa lấy hiệu là Minh đô vương tiến tôn Trịnh Giang làm Thái thượng vương. Trịnh Doanh liền ban hành nhiều quyết định hợp lòng người, được quần thần và dân chúng ủng hộ. Chính sách cai trị dưới thời Trịnh Doanh khá chắc chắn và hoàn chỉnh. Nhiều sắc chỉ được ban hành dưới thời Trịnh Cương (đã bị Trịnh Giang bỏ) nay được thực hiện. Trịnh Doanh chăm lo chính sự. Cho đặt ống đồng ở cửa phủ để nhận thư từ dân chúng tố giác việc làm sai trái của quan lại: Khi cần tuyển chọn và cất nhắc quan lại, Trịnh Doanh coi trọng thực tài nên trước khi bổ nhiệm ai người đó phải vào phủ đường yết kiến để chúa trực tiếp hỏi về việc là làm. ai có khả năng mới trao cho chức quyền. Chúa thưởng phạt rất công minh. Nhiều danh sĩ xuất thân khoa bảng được trọng dụng, tiêu biểu là Lê Quí Đôn. Ngô Thì Sĩ... Lịch sử đã ghi nhận những năm Trịnh Doanh cầm quyền ở Bắc Hà là thời kỳ đất nước ổn định và thịnh đạt. Song khi mới lên ngôi chúa, để dẹp loạn bằng mọi giá Trịnh Doanh đă mắc một sai lầm không thể tha thứ là đốt hết sổ sách thư từ, thu nhặt hết chuông khánh các chùa chiền để đúc binh khí. Tháng Giêng năm Đinh Hợi (1767). Trịnh Doanh mất thọ 48 tuổi, ở ngôi chúa 27 năm."
    }, {
        "id": 100,
        "title": "Tĩnh Đô Vương - Trịnh Sâm",
        "description": "Tĩnh Đô Vương - Trịnh Sâm. Tĩnh đô vương (Trịnh Sâm, 1767-1782) Trịnh Sâm là con trưởng của Trịnh Doanh. Năm ất Sửu (1745) Sâm được lập làm Thế tử. Trịnh Doanh cử hai tiến sĩ danh tiếng là Dương Công Chú và Nguyễn Hoàn làm tư giảng cho Trịnh Sâm. Năm Đinh Hợi (1767). Trịnh Doanh mất, Trịnh Sâm lên ngôi chúa, tiến phong là Nguyên soái Tổng quốc chính Tĩnh đô vương... Trịnh Sâm là người cứng rắn, thông minh, quyết đoán. Khi lên ngôi chúa, Trịnh Sâm cho sửa đổi kỷ cương, chính sự cả nước vì cho rằng phép tắc của triều trước là nhỏ hẹp, nay Sâm muốn làm to rộng hơn, nên phần nhiều tự quyết đoán, không theo phép cũ. Năm Kỷ Sửu (1769), sau hai năm lên ngôi vì ghen ghét tài năng, đức độ và địa vị của Thái tử Duy Vĩ, Sâm đã vu tội cho Thái tử, sai người bắt giữ, truất ngôi và tống giam, chết trong ngục. Năm Canh Mão (1770), sau khi đánh tan Lê Duy Mật, buộc Duy Mật tự tử, Trịnh Sâm kiêu mãn, cho mình có công lớn nên tự tiến phong là Đại nguyên soái tổng quốc chính, Thượng sư thượng phụ, Duệ đoán văn công võ đức Tĩnh đô vương. Năm Giáp Ngọ (1774), để khuếch trương thanh thế, Sâm sai Hoàng Ngũ Phúc làm thống tướng đem quân vào Nam đánh chúa Nguyễn, tháng 10 năm đó, Sâm đích thân cầm quân kéo vào Thuận Hóa, chiếm được Thuận Hóa và đặt quan cai trị đất Thuận Quảng, trong đó có Lê Qúy Đôn, tác giả sách ''Phủ biên tạp lục\". Trịnh Sâm sau khi đã dẹp yên các cuộc khởi nghĩa, bốn phương yên ổn, kho đụn đầy đủ, dần dần sinh bụng kiêu căng: xa xỉ, kén nhiều thần phi thị nữ, mặc ý vui chơi thỏa thích. Đặng Thi Huệ là nữ tỳ của tiệp dư Trần Thị Vinh, ả mắt phượng mày ngài, vẻ người rất xinh đẹp và hấp dẫn. Trịnh Sâm trông thấy đem lòng yêu mến đặc biệt. Đặng Thị Huệ được sống với chúa như vợ chồng. Xe hiệu quần áo của ả đều được sắm sửa như của chúa. Để chiều lòng người đẹp, mỗi năm cứ đến tết Trung Thu là cho tổ chức đêm ''Hội Long Trì\" treo hàng ngàn chiếc đèn lồng, trông xa tựa hàng vạn ngôi sao sáng để vui chơi thỏa thích. Chúa Trịnh Sâm còn gả con gái yêu cho em trai Thị Huệ là Đặng Mậu Lân, một tên ,du côn ỷ quyền thế chuyên cướp bóc, cưỡng hiếp phụ nữ giữa phố phường. Đặng Thị Huệ còn liên kết với Huy quận công Hoàng Đình Bảo gạt bỏ Thế tử Trịnh Khải (con cả của Trịnh Sâm) lập Trịnh Cán (con của Thị Huệ) làm thế tử mới 5 tuổi. Tháng 9 năm Nhâm Dần (1782), Trịnh Sâm mất, thọ 44 tuổi, ở ngôi chúa 15 năm."
    }, {
        "id": 101,
        "title": "Điện Đô Vương - Trịnh Cán",
        "description": "Điện Đô Vương - Trịnh Cán. Điện Đô Vương (Trịnh Cán, 2 tháng trong nǎm 1782) Trịnh Sâm mất, Đặng Thị Huệ và Huy quận công Hoàng Đình Bảo lập Trịnh Cán lên ngôi chúa với tước hiệu Điện đô vương, lúc đó Cán mới 6 tuổi. Tuyên phi Đặng Thị Huệ nghiễm nhiên trở thành người điều khiển triều chính giúp con. Lòng người lo sợ, từ phủ chúa ra kinh thành, thôn dã, ai cũng biết chắc hoạ loạn sắp xẩy ra. Tháng 10 nǎm Nhâm Dần - 1782, Dự Vũ là tay chân của Trịnh Khải xúi kiêu binh (lính Tam phủ) nổi loạn, truất ngôi Cán, giáng xuống làm Cung quốc công, giết chết Hoàng Đình Bảo. Đặng Thị Huệ bị truất xuống thứ dân, sau tự tử. Trịnh Cán bị đưa ra ở phủ Lượng quốc, ốm chết, ở ngôi được gần hai tháng."
    }, {
        "id": 102,
        "title": "Đoan Nam Vương - Trịnh Khải",
        "description": "Đoan Nam Vương - Trịnh Khải. Đoan Nam Vương (Trịnh Khải, 1782-1786) Lính Tam phủ nổi loạn lật đổ Trịnh Cán đưa Trịnh Khải lên ngôi chúa, tiến phong là Đoan nam vương. Tháng 6 nǎm Bính Ngọ - 1786, đang lúc phủ chúa rối ren, khốn khổ vì nạn kiêu binh hoành hành khắp kinh kỳ, dân chúng ngày đêm nơm nớp lo sợ thì nghĩa quân Tây Sơn của Nguyễn Huệ với danh nghĩa \"phù Lê diệt Trịnh\" kéo ra Bắc Hà. Quân Trịnh chống cự yếu ớt, mau chóng tan rã, bỏ chạy. Tướng Hoàng Phùng Cơ, Nguyễn Lệ rút chạy lên phía Bắc, Trịnh Khải mặc nhung phục, cưỡi voi, cầm cờ lệnh chỉ huy, nhưng quân sĩ đã bỏ chạy hết. Trịnh Khải phải một mình bỏ chạy lên Sơn Tây. Trịnh Khải bị Nguyễn Trang bắt giải về nộp cho quân Tây Sơn, trên đường giải về Trịnh Khải dùng dao tự tử. Trịnh Khải làm chúa chưa được 4 nǎm thì chết, lúc đó mới 24 tuổi. 12. án đô vương (Trịnh Bồng, 1787-1788) Trịnh Bồng là con Trịnh Giang, bác ruột của Trịnh Khải. Trịnh Bồng đã được phong là Côn quận công. Khi Trịnh Khải bỏ trốn lên Sơn Tây, Trịnh Bồng lánh nạn ở huyện Vǎn Giang (Hưng Yên). Khi Nguyễn Huệ và vua Thái Đức Nguyễn Nhạc rút về Nam Hà, Trịnh Bồng đã về yết kiến vua Lê, được vua Lê phong cho làm Nguyên soái, Tổng quốc chính, án đô vương. Trịnh Bồng nhu nhược, lười biếng, không điều khiển công việc, do đó chính sự lại vào tay Đinh Tích Nhưỡng, chúng lấn át vua Lê, từ đó vua và chúa lại càng mâu thuẫn. Vua Lê đã vời Nguyễn Hữu Chỉnh từ Nghệ An đem quân về giúp. Trịnh Bồng trốn chạy về xã Dương Xá rồi Quế Võ (Bắc Ninh). Trịnh Bồng đi Hải Dương - Quảng Yên và Thái Bình mộ quân lương mưu đánh lại Nguyễn Hữu Chỉnh, nhưng đánh mấy trận đều thất bại. Nǎm 1788, Trịnh Bồng sau nhiều lần thất bại, đã bỏ đi tu ở vùng Lạng Sơn, Cao Bằng. Như vậy, họ Trịnh từ Thái vương Trịnh Kiểm nắm quyền đến án đô vương Trịnh Bồng (1545-1788) trải qua 12 đời chúa với 243 nǎm trị vì."
    }, {
        "id": 103,
        "title": "Án Đô Vương - Trịnh Bồng",
        "description": "Án Đô Vương - Trịnh Bồng. Án Đô Vương (Trịnh Bồng) (1787-1788) Trịnh Bồng là con Trịnh Giang, bác ruột của Trịnh Khải. Trịnh Bồng đã được phong là Côn quận công. Khi Trịnh Khải bỏ trốn lên Sơn Tây, Trịnh Bồng lánh nạn ở huyện Văn Giang (Hưng Yên). Khi Nguyễn Huệ và vua Thái Đức Nguyễn Nhạc rút về Nam Hà, Trịnh Bồng đã về yết kiến Vua Lê, được Vua Lê phong cho làm Nguyên soái, tổng quốc chính Án Đô Vương. Trịnh Bồng nhu nhược, lười biếng, không điều khiển được công việc, do đó chính sự lại vào tay Đinh Tích Nhưỡng, chúng lấn át Vua Lê, từ đó Vua và Chúa lại càng mâu thuẫn. Vua Lê đã vời Nguyễn Hữu Chỉnh từ Nghệ An đem quân về giúp. Trịnh Bồng trốn chạy về xã Dương Xá rồi Quế Võ (Bắc Ninh). Trịnh Bồng đi Hải Dương - Quảng Yên và Thái Bình mộ quân lương mưu đánh lại Nguyễn Hữu Chỉnh, nhưng đánh mấy trận đều thất bại. Năm 1788, Trịnh Bồng sau nhiều lần thất bại, đã bỏ đi tu ở vùng Lạng Sơn, Cao Bằng. Như vậy, họ Trịnh từ Thái Vương Trịnh Kiểm nắm quyền đến Án Đô Vương Trịnh Bồng (1545 – 1788) trải qua 12 đời chúa với 243 năm trị vì."
    }, {
        "id": 104,
        "title": "Tiên Vương - Nguyễn Hoàng",
        "description": "Tiên Vương - Nguyễn Hoàng. Nguyễn Hoàng (Chúa Tiên, 1558-1613) Nguyễn Kim quê ở Gia Miêu, Tống Sơn, Hà Trung, Thanh Hóa, là con của Trừng quốc công Nguyễn Hoàng Dụ đã từng giúp vua Lê Tương Dực khởi binh ở Thanh Hóa lật đổ Lê Uy Mục, nhân đó được phong là Thái phó Trừng quốc công. Mạc Đǎng Dung cướp ngôi nhà Lê, Nguyễn Kim lánh sang Ai Lao, thu nạp hào kiệt, phò giúp nhà Lê trung hưng, được vua Lê Trang Tông phong là Thượng phụ Thái sư Hưng quốc công. Nǎm Canh Tý - l540 Nguyễn Kim đem quân về chiếm Nghệ An, nǎm l542 chiếm được Tây Đô - Thanh Hóa. Nǎm ất Tị - 1545, Nguyễn Kim bị hàng tướng nhà Mạc là Dương Chấp Nhất đầu độc chết, thọ 75 tuổi, quyền hành rơi vào tay con rể là Trịnh Kiểm. Khi Nguyễn Kim chạy sang Ai Lao thì Nguyễn Hoàng mới 2 tuổi, được Thái phó Nguyễn Ư Dĩ là cậu ruột nuôi dạy nên người. Trịnh Kiểm là anh rể, muốn thâu tóm quyền hành nên đã ngấm ngầm ám hại các em vợ. Nguyễn Uông, con trưởng của Nguyễn Kim đã bị hãm hại. Nguyễn Hoàng rất lo sợ, sai người đến yết kiến Trạng Trình Nguyễn Bỉnh Khiêm xin mách cho kế an toàn, Trạng Trình đã ứng khẩu câu thơ: ''Hoành Sơn nhất đái, vạn đại dung thân!'' (một dãy núi Hoành Sơn có thể dung thân muôn đời). Nguyễn Hoàng nghĩ ra, đến nói với chị gái là Ngọc Bảo xin với anh rể là Trịnh Kiểm cho vào trấn thủ Thuận Hoá là nơi hoang vu nhiều giặc dã. Trịnh Kiểm đồng ý cho Nguyễn Hoàng vào trấn thủ Thuận Hoá với ý đồ mượn tay giặc giết em vợ. Nǎm Mậu Ngọ - 1558, Trịnh Kiểm tâu với vua Lê Anh Tông cho Nguyễn Hoàng vào trấn thủ Thuận Hoá. Được lệnh vào Nam, bất chấp mùa đông giá rét, Nguyễn Hoàng giong buồm đi ngay, những người họ hàng ở huyện Tống Sơn cùng quân lính ở đất Thanh - Nghệ nhiều người đem cả vợ con đi theo có đến nghìn người. Các danh thần cùng đi có Nguyễn Ư Dĩ, Tống Phước Trị, Mạc Cảnh Huống... Vào Nam, đoàn người của Nguyễn Hoàng đổ bộ lên cảng Cửa Việt, dựng dinh thự ở ái Tử thuộc huyện Đǎng Xương, Quảng Trị. Nguyễn Hoàng là người khôn ngoan, nhân hậu, lưu tâm đến dân tình, hết lòng thu dung hào kiệt. ông giảm sưu, hạ thuế khiến lòng người ai cũng mến phục. Nhân dân xưng tụng ông là chúa Tiên. Để tránh sự nghi kỵ của chúa Trịnh, nǎm 1569, ông ra chầu vua Lê ở An Trường, được vua Lê, chúa Trịnh khen ngợi. Nǎm 1570, Nguyễn Hoàng được giao trấn thủ luôn đất Quảng Nam với ấn Tổng trấn. ông dời đô vào làng Trà Bát (tức Cát Dinh) cũng thuộc huyện Đǎng Xương. Nǎm 1572, tướng Lập Bạo của nhà Mạc theo đường biển đem quân vào đóng ở hai làng Hồ Xá và Lang Uyển (Quảng Trị) định phá sự nghiệp ở Thuận - Quảng của Nguyễn Hoàng. Nguyễn Hoàng đã dùng kế mỹ nhân phá được âm mưu của Lập Bạo và đánh tan được quân nhà Mạc. Nǎm 1593, Nguyễn Hoàng đem quân ra Đông Đô giúp Trịnh Tùng đánh dẹp dư đảng họ Mạc. Vì lập được nhiều chiến công, ông được vua Lê tấn phong làm Trung quân Đô đốc phủ tả đô đốc chưởng phủ sự thái uý Đoan quốc công. Để tránh Trịnh Tùng hãm hại, nǎm Canh Tý - 1600 Nguyễn Hoàng lấy cớ đem quân đi dẹp cuộc nổi loạn ở Nam Định, sau đó cùng các tướng tâm phúc ra biển giong thẳng vào đất Thuận - Quảng để con trai thứ 5 là Hải và cháu là Hắc ở lại làm con tin. Vua Lê sai sứ giả vào phủ dụ và vẫn để Nguyễn Hoàng trấn thủ Thuận - Quảng. Tháng 10 nǎm Canh Tý - 1600, Nguyễn Hoàng gả con gái là Ngọc Tú cho Trịnh Tráng (con cả Trịnh Tùng). Có thể nói từ nǎm 1600, Nguyễn Hoàng bắt đầu xây dựng giang sơn riêng cho họ Nguyễn ở Đàng Trong. Thuận - Quảng vốn là đất cũ của người Chǎm chịu ảnh hưởng vǎn hóa Chǎmpa, chúa Tiên dã dùng Phật giáo để thuần hoá nhân dân. ông sửa sang và xây dựng nhiều ngôi chùa. Đặc biệt, nǎm 1601 ông cho xây dựng chùa Thiên Mụ là công việc to lớn có giá trị nhất. Ngôi chùa lịch sử này đã có quan hệ mật thiết với quá trình phát triển đất Thuận Hoá và triều Nguyễn ở Việt Nam. Nguyễn Hoàng sinh ngày 28/8/1525, mất ngày 21/5/1613 thọ 89 tuổi, trấn thủ Thuận - Quảng 55 nǎm (1558-1613). ông sinh 10 con trai và 2 con gái. Sau này, triều Nguyễn truy tôn ông là Thái tổ Gia dụ Hoàng đế."
    }, {
        "id": 105,
        "title": "Sãi vương - Nguyễn Phúc Nguyên",
        "description": "Sãi vương - Nguyễn Phúc Nguyên. Nguyễn Phúc Nguyên (Chúa Sãi, 1613-1635) Nguyễn Hoàng sắp mất, gọi con thứ 6 là Nguyễn Phúc Nguyên vào dặn dò: Đất Thuận - Quảng này phía bắc thì có núi Hoành Sơn, sông Linh Giang, phía nam thì có núi Hải Vân và núi Bi Sơn thật là nơi trời để cho người anh hùng dụng võ. Vậy con phải thương yêu nhân dân, luyện tập binh sĩ mới gây dựng cơ nghiệp muôn đời. Nguyễn Phúc Nguyên khóc và bái tạ lãnh mạng. Vua Lê sai sứ giả vào viếng và truy tặng Nguyễn Hoàng là Cẩn nghi công, vẫn cho Nguyễn Phúc Nguyên làm trấn thủ Thuận - Quảng với hàm Thái bảo, tước Thuỵ quận công. Nguyễn Phúc Nguyên xưng là Sãi vương và cho rời cung phủ về xã Phúc Yên, huyện Quảng Điền, ngày đêm lo việc chính sự, thu dụng nhân tài. Quan khám lý Trần Đức Hoà tiến cử Đào Duy Từ cho chúa Nguyễn, chúa mừng lắm phong cho Đào Duy Từ tước Lộc kê hầu, chức Nha uý nội tán. Đào Duy Từ giúp chúa Nguyễn đắp luỹ Trường Dục luỹ Thầy để phòng ngự, chống nhau với quân Trịnh, Đào Duy Từ còn bày kế sách cho chúa Nguyễn trả lại sắc phong của vua Lê, không chịu nộp thuế cống cho chúa Trịnh. Chuyện kể rằng nǎm Đinh Mão - 1627, Trịnh Tráng sai sứ mang sắc vua Lê dụ chúa Sãi cho con vào chầu và nộp 30 con voi cùng 30 chiếc thuyền để đưa cống nhà Minh. Nhận được sắc vua, chúa Sãi họp triều thần hỏi mưu kế. Đào Duy Từ dâng kế, cho người làm một cái mâm hai đáy, trên sắp đầy sản vật, giữa để sắc thư, rồi cử Lại Vǎn Khuông làm chánh sứ đem phẩm vật ra tạ ơn chúa Trịnh. Nhờ đã được chuẩn bị trước, khi ra kinh đô yết kiến chúa Trịnh, Lại Vǎn Khuông ứng đối khá trôi chảy. Chúa hậu đãi, cho phép Khuông cùng phái đoàn đi thǎm kinh thành để chờ chúa dạy bảo. Trên đường đi, Khuông lén mở cẩm nang của Đào Duy Từ trao cho từ trước. Sau khi đọc cẩm nang, Khuông cùng cả phái đoàn lẻn trốn về Nam. Thấy phái đoàn đột ngột trốn về, chúa Trịnh nghi hoặc, bèn cho người đập vỡ mâm mới thấy tờ sắc trước, và một bài thơ, mỗi câu bốn chữ như sau. Mâu nhi địch Mịch phi kiến tích Ái lạc tâm trường Lực lai tương địch Cả triều thần không ai hiểu ý nghĩa. Trịnh Tráng phải mời Trạng Bùng Phùng Khắc Hoan giải mã... Đọc xong Phùng Khắc Khoan giải thích: Đấy là lối chơi chữ của Đào Duy Từ, chữ mâu không có dấu phẩy là chữ dư, chữ mịch không thấy chữ kiến thì còn chữ bất, chữ ái rơi chữ tâm thành chữ thụ, chữ lực cùng đối địch với chữ lai thành chữ sắc. Vậy ý nghĩa của bài thơ 4 câu trên là Dư bất thụ sắc tức là Ta không nhận sắc. Nghe xong, Trịnh Tráng vội cho người tìm bắt Lại Vǎn Khuông, nhưng Khuông đã cao chạy xa bay rồi. Tráng muốn phát binh vào đánh chúa Nguyễn, nhưng gặp lúc Cao Bằng và Hải Dương đều có giặc, đành phải hoãn lại chưa đi hỏi tội chúa Nguyễn. Đào Duy Từ còn tiến cử cho chúa Nguyễn một viên tướng tài ba, mưu lược là Nguyễn Hữu Tiến, quân lực của chúa Nguyễn từ đó ngày thêm mạnh. Đào Duy Từ chỉ giúp chúa Nguyễn 8 nǎm mà cơ nghiệp chúa Nguyễn thay đổi hẳn về chất, đất Đàng Trong trở nên có vǎn hiến và quy củ hơn trước nhiều. Đối với lân bang, chúa Sãi chủ trương thân thiện với Chiêm Thành và Chân Lạp. Nǎm 1620, chúa gả công nữ Ngọc Vạn cho vua Chân Lạp Chetta II (1618?1686) để tạo thuận lợi cho dân chúng vào khai khẩn đất hoang ở Thuỷ Chân Lạp. Nǎm 1631, chúa Sãi lại gả công nữ Ngọc Khoa cho vua Chiêm Pô Romê để củng cố nền hoà hiếu một thời gian khá dài giữa hai nước Chiêm ? Việt. Chúa Nguyễn Phúc Nguyên, sinh 16/8/1563, mất ngày 19/12/1635 thọ 73 tuổi, ở ngôi chúa 22 nǎm. Sau triều Nguyễn truy tôn Hy tông Hiếu vǎn Hoàng đế. Chúa Sãi có 15 người con (11 con trai và 4 con gái)."
    }, {
        "id": 106,
        "title": "Thượng vương - Nguyễn Phúc Lan",
        "description": "Thượng vương - Nguyễn Phúc Lan. Chúa Nguyễn Phúc Lan (chúa Thượng, 1635-1648) Nguyễn Phúc Nguyên có 11 con trai. Nguyễn Phúc Lan là con trai thứ hai được truyền ngôi chúa. Năm Ất Hợi (1635) chúa Sãi mất, Nguyễn Phúc Lan lên ngôi chúa gọi là chúa Thượng. Nghe tin Phúc Lan nối nghiệp, hoàng tử thứ 3 là Nguyễn Phúc Anh đang trấn giữ Quảng Nam âm mưu phản nghịch, liên kết với chúa Trịnh đem quân vào đánh miền Nam. Phúc Anh sai đắp luỹ Câu Ðê làm kế cố thủ. Phúc Lan đánh bắt được, không nỡ giết người ruột thịt, nhưng tướng sĩ và ông chú là Trường quận công Nguyễn Phúc Khê đều xin giết để trừ hậu hoạ. Chúa dù đau xót cũng phải nghe theo. Năm Kỷ Mão (1639), Tống Thị (vợ goá của Phúc Anh) dâng cho chúa chuỗi hoa vòng ngọc liên châu rất đẹp. Chúa cầm lên ngửi thấy mùi hương thơm ngát xúc động lòng yêu. Tống Thị lại vào sụp lạy dưới thềm, thưa trình về tình cảnh goá bụa thảm thiết, nhan sắc lại cực kỳ diễm lệ. Chúa Thượng nổi tình riêng, sau đó mời nàng vào nội thất chung chăn gối. Từ đó chúa rất mực sủng ái Tống Thị. Nàng trình bẩm việc gì chúa cũng nghe theo. Tống Thị lựa lời khéo léo để chúa vui lòng, nghĩ cách chiếm đoạt của cải của dân để làm giàu riêng. Các quan đại thần căm ghét Tống Thị, tìm cách can gián nhưng chúa không nghe. Cho hay, nhan sắc, gái đẹp có mãnh lực vô biên, làm lung lạc cả đấng quân vương. Làm chúa được 9 năm, vị chúa đa tình này lập được chiến công vang dội. Lần đầu tiên trong lịch sử, thuỷ quân Việt Nam đã đánh thắng thủy quân Âu Châu. Ðó là năm 1643, Hà Lan theo yêu cầu của chúa Trịnh đã cho 3 chiếc tàu đồng kiểu tròn, trang bị nhiều trọng pháo tiến vào cửa Eo (Thuận An) mưu đồ xâm lược nước ta. Chúa Thượng họp quần thần bàn định có nên đưa chiến thuyền của mình ra đánh tàu Hà Lan hay không. Các quần thần không dám hứa là chắc thắng. Chúa hỏi một người Hà Lan đang giúp việc cho chúa. Người ấy tự phụ trả lời: Tầu Hà Lan chỉ sợ mãnh lực và quân đội của trời thôi. Nghe vậy, chúa cảm thấy bị xúc phạm. Ông thân hành đến Eo, ra lệnh cho thuỷ quân chèo thuyền ra đánh thẳng vào 3 chiếc tàu của Hà Lan. Hàng trăm chiếc thuyền Việt Nam xông thẳng vào các chiếc tàu Hà Lan, mặc đại bác bắn ra như mưa. Bốn mặt tàu Hà Lan đều bị tấn công. Nhờ thuyền nhỏ cơ động, nhanh nhẹn nên mặc dù bị một số đạn, thuyền Việt Nam vẫn bao vây tấn công vào tàu Hà Lan quyết liệt. Chúng vô cùng kinh hoàng, không ngờ thủy quân chúa Nguyễn lại gan dạ đến thế. Chiếc nhỏ nhất vội luồn lách chạy thoát thân. Chiếc thứ hai thảng thốt đâm vào đá, cả đoàn thuỷ thủ và tàu chìm nghỉm xuống biển. Chiếc thứ 3 lớn nhất chống cự lại, các thuỷ quân chúa Nguyễn bám sát tàu bẻ bánh lái. Một số nhảy lên tàu, chặt gẫy cột buồm. Bị dồn vào thế tuyệt vọng, thuyền trưởng Hà Lan cho nổ kho thuốc súng. Thế là tất cả thủy thủ bị hoả thiêu chết la liệt trên biển. Có 7 tên trên tàu nhảy xuống biển, cố bơi thoát nhưng đều bị tóm cổ. Thắng trận trở về, chúa Thượng dẫn 7 tên tù binh đến trước mặt người Hà Lan nói: - Cần chi mãnh lực và quân đội của trời mới phá được. Chiến thuyền của ta cũng khá đấy chứ. Năm 1648, Trịnh Tráng cho các đạo quân thuỷ bộ đánh vào miền Nam. Bộ binh đóng ở đất Nam Bố Chính, còn thuỷ quân thì đánh vào cửa Nhật Lệ. Nguyễn Phúc Lan phải tự cầm quân đánh lại. Sau Phúc Lan thấy trong người không được khoẻ, mới trao binh quyền cho con trai là Nguyễn Phúc Tần và tướng Nguyễn Hữu Dật chỉ huy còn mình thì rút về. Ðến phá Tam Giang thì chúa mất, thọ đến 48 tuổi, ở ngôi chúa 13 năm. Sau triều Nguyễn truy tôn là Thần tôn Hiến chiêu Hoàng đế. Chúa Thượng có 4 người con (3 con trai, 1 con gái)."
    }, {
        "id": 107,
        "title": "Hiền vương - Nguyễn Phúc Tần",
        "description": "Hiền vương - Nguyễn Phúc Tần. Nguyễn Phúc Tần (chúa Hiền, 1648-1687) Nguyễn Phúc Tần sinh năm Canh Thìn (1620). Lúc đầu được phong Phó tướng Dũng lễ hầu, đã từng đánh giặc ở cửa biển, được chúa Phúc Lan rất khen ngợi. Năm Mậu Tý - 1648 được tấn phong là tiết chế chủ quân, thay Phúc Lan phá quân Trịnh ở sông Gianh. Bấy giờ ông 29 tuổi. Chúa Nguyễn Phúc Lan mất đột ngột, bày tôi tôn Nguyễn Phúc Tần lên ngôi chúa, gọi là chúa Hiền. Chúa Nguyễn Phúc Tần là người chăm chỉ chính sự, không chuộng yến tiệc vui chơi. Phúc Tần biết tận dụng hai tướng tài giỏi là Nguyễn Hữu Dật và Nguyễn Hữu Tiến. Quân chúa Nguyễn nhiều lần vượt sông Gianh tiến ra đất Đàng Ngoài. Năm 1656, sau hai năm tấn công ta Bắc, quân Nguyễn đã chiếm được 7 huyện của Nghệ An. Tự thân Nguyễn Phúc Tần đã đem quân ra đến Nghệ An đóng tại xã Vân Cát, quân Nguyễn có thể tiến sâu thêm nữa, nhưng nghe tin Trịnh Tráng mất, con là Trịnh Tạc lên ngôi chúa đang chịu tang, chúa Nguyễn cho người sang điếu rồi rút quân về, lưu các tướng đóng đồn từ sông Lam trở về Nam, đắp luỹ từ núi đến cửa biển để phòng ngự. Sau đợt tấn công đó, quân Nguyễn còn chiếm đất Nghệ An thêm 5 lần nữa, năm 1660 chúa Trịnh mới khôi phục lại được. Từ đó Trịnh - Nguyễn cầm cự nhau suốt mấy chục năm không phân thắng bại. Năm Kỷ Mùi - 1679, chúa Nguyễn cho phép Dương Ngạn Địch, một tướng cũ của triều Minh cùng với Trần Thượng Xuyên đem gia thuộc hơn 3000 người và hơn 50 chiến thuyền đến khai phá vùng đất Gia Định - Mỹ Tho. Từ đó phố xá, chợ búa mọc lên sầm uất, thuyền buôn của các nước Thanh, Nhật Bản và các nước phương Tây ra vào tấp nập, do đó phong hoá ngày càng mở mang Dưới thời chúa Hiền, nhiều kênh dẫn nước tưới ruộng được khơi đào, như Trung Đàn, Mai Xá. Bấy giờ bờ cõi được thái bình, thóc lúa được mùa. Chúa càng chăm lo chính sự, không xây đền đài, không gần gái đẹp, bớt lao dịch thuế khoá, nhân dân đều khen ngợi thời thái bình thịnh trị. Năm Đinh Mão - 1687, chúa Hiền mất, thọ 65 tuổi, ở ngôi chúa 39 năm. Triều Nguyễn truy tôn ông là Thái tông hiền triết hoàng đế. Chúa Hiền có 9 người con (6 con trai, 3 con gái)."
    }, {
        "id": 108,
        "title": "Nghĩa vương - Nguyễn Phúc Trăn",
        "description": "Nghĩa vương - Nguyễn Phúc Trăn. Nguyễn Phúc Thái (chúa Nghĩa, 1687-1691) Nguyễn Phúc Tần có 6 người con trai, Nguyễn Phúc Thái là con thứ 2 của bà vợ thứ hai người họ Tống, nhưng lớn tuổi và hiền đức. Khi Nguyễn Phúc Tần mất, Thái đã 39 tuổi. Nguyễn Phúc Thái nổi tiếng là người rộng rãi, hình phạt và phú thuế đã nhẹ, trăm họ ai cũng vui mừng. Quan lại cũ của triều trước đều được trọng đãi. Người đời sau nhắc đến chúa Nghĩa Nguyễn Phúc Thái là nhớ chúa đã dời phủ từ Kim Long về Phú Xuân địa thế bằng phẳng, đẹp đẽ, tiếp nối nhiều đời chọn làm kinh đô. Chúa không thọ được lâu. Sau 4 năm ở ngôi chúa, năm Tân Mùi - 1691, Nguyễn Phúc Thái mất, thọ 43 tuổi. Triều Nguyễn truy tôn ông là Anh tông hiếu nghĩa hoàng đế. Chúa Nghĩa có 10 người con (5 con trai, 5 con gái)."
    }, {
        "id": 109,
        "title": "Minh vương - Nguyễn Phúc Chu",
        "description": "Minh vương - Nguyễn Phúc Chu. Nguyễn Phúc Chu là con cả Nguyễn Phúc Thái, sinh nǎm ất Mão - 1675, được ǎn học khá cẩn thận vì thế vǎn hay chữ tốt, đủ tài lược vǎn võ. Khi nối ngôi Chúa mới 17 tuổi. Chúa Nguyễn Phúc Chu mộ đạo Phật. Nǎm 1710 chúa sai đúc chuông lớn nặng tới 3.285 cân, đặt ở chùa Thiên Mụ và xây dựng một loạt chùa miếu khác. Chúa cho mở hội lớn ở chùa Thiên Mụ, chùa núi Mỹ An. Tự chúa cũng ǎn chay ở vườn Côn Gia một tháng trời. Chúa phát tiền gạo cho người nghèo. Đây là thời kỳ mà chiến tranh Trịnh - Nguyễn đã tạm ngừng hơn 30 nǎm, đất nước bình yên, chúa Nguyễn Phúc Chu có điều kiện mở mang đất đai về phía Nam và đạt được những thành tựu đáng kể: đặt phủ Bình Thuận nǎm Đinh Sửu - 1697 gồm đất Phan Rang, Phan Rí, chia làm hai huyện An Phúc và Hoà Đa; bắt đầu đặt phủ Gia Định, chia đất Đông Phố lấy xứ Đồng Nai làm huyện Phúc Long; dựng dinh Trấn Biên (tức Biên Hoà) lấy xứ Sài Gòn làm huyện Tân Bình; dựng dinh Phiên Trấn; lập xã Minh Hương... Từ đó người Thanh đi lại buôn bán rất sầm uất. Nǎm 1702, Công ty ấn Độ của Anh do Allen Catohpole đem 200 quân đến chiếm đảo Côn Lôn, chúa Quốc lập tức sai con là Nguyễn Phúc Phan dùng mưu đánh đuổi ra khỏi đảo. Nǎm 1708, chúa Quốc dùng Mạc Cửu làm Tổng binh trấn Hà Tiên. Nǎm 1709, chúa Quốc cho đúc ấn Quốc Bửu \"Đại Việt Quốc, Nguyễn Phúc Vĩnh Trấn chi bửu\" ấn ấy về sau trở thành vật báu truyền ngôi. Nǎm 1714, chúa Quốc đại trùng tu chùa Thiên Mụ và đi thǎm phố Hội An. Nhân thấy cầu do người Nhật làm tụ tập nhiều thuyền buôn các nước, chúa bèn đặt là Lai Viễn Kiều và ban biển chữ vàng ngày nay vẫn còn biển đó. Ngày 1/6/1725, chúa Quốc mất, thọ 51 tuổi, ở ngôi 34 nǎm. Sau triều Nguyễn truy tôn là Hiến Tông Hiếu Minh Hoàng đế. Chúa Quốc có 42 người con (38 con trai và 4 con gái)."
    }, {
        "id": 110,
        "title": "Ninh vương - Nguyễn Phúc Thụ",
        "description": "Ninh vương - Nguyễn Phúc Thụ. Nguyễn Phúc Thụ (Ninh Vương, 1725-1738) Nguyễn Phúc Thụ (nhiều sách viết là Chú) sinh ngày 14/1/1697, là con trai cả của chúa Quốc, khi chúa Quốc mất được lên ngôi Chúa lúc đó đã 30 tuổi, xưng hiệu là Ninh Vương. Nǎm Quý Sửu - 1733, chúa cho đặt đồng hồ mua của Tây phương ở các dinh và các đồn tàu dọc biển. Sau có người thợ thủ công là Nguyễn Vǎn Tú chế tạo được chiếc đồng hồ y hệt. Nǎm Bính Thìn - 1736, Mạc Cửu mất, con trai là Mạc Thiên Tứ được chúa cho làm Đô đốc trấn Hà Tiên. Mạc Thiên Tứ là một nhà cai trị giỏi, mà lại vǎn thơ hay, Mạc Thiên Tứ mở Chiêu Anh Các để tụ họp các vǎn nhân thi sĩ cùng nhau xướng hoạ. Mạc Thiên Tứ để lại 10 bài thơ ca ngợi phong cảnh đẹp của Hà Tiên (Hà Tiên thập vịnh). Ngày 7/6/1738, Ninh Vương mất, thọ 42 tuổi, ở ngôi 13 nǎm. Sau triều Nguyễn truy tôn là Túc Tông Hiếu Ninh Hoàng đế. Ninh Vương có 9 người con (3con trai, 6 con gái)."
    }, {
        "id": 111,
        "title": "Võ Vương - Nguyễn Phúc Khoát",
        "description": "Võ Vương - Nguyễn Phúc Khoát. Nguyễn Phúc Khoát (Võ Vương, 1738-1765) Nguyễn Phúc Khoát, sinh nǎm Giáp Ngọ (1714), là con trưởng của Ninh Vương được lên ngôi chúa ngày 7/6/1738, lấy hiệu là Từ Tế Đạo nhân. Nǎm Giáp Tý (1744), Nguyễn Phúc Khoát lên ngôi vương xưng là Võ Vương cho đúc ấn Quốc Vương. Xuống chiếu bố cáo thiên hạ, lấy Phú Xuân làm kinh đô. Từ nǎm Giáp Tuất (1754), để xứng đáng với kinh đô của Nguyễn Vương, Phú Xuân được xây dựng thêm hàng loạt cung điện theo quy mô đế vương. Đặc biệt chiếc áo dài Việt Nam tha thướt xinh đẹp như hiện nay, phải trải qua một quá trình phát triển, nó được hình thành từ đời Võ Vương Nguyễn Phúc Khoát. Nǎm 1757, Võ Vương đặt Rạch Giá làm đạo Kiên Giang, Cà Mau làm đạo Long Xuyên. Ngày 7/6/1765, Võ Vương Nguyễn Phúc Khoát mất, thọ 52 tuổi, nối ngôi được 27 nǎm. Triều Nguyễn truy tôn ông làThế tông Hiếu vũ Hoàng đế. Võ Vương có 30 người con (18 con trai, 12 con gái)."
    }, {
        "id": 112,
        "title": "Định Vương - Nguyễn Phúc Thuần",
        "description": "Định Vương - Nguyễn Phúc Thuần. Nguyễn Phúc Thuần (Định Vương, 1765-1777) Nguyễn Phúc Thuần sinh ngày 31/12/1753, là con thứ 16 của Nguyễn Phúc Khoát. Võ Vương lúc đầu lập con thứ 9 là Phúc Hiệu làm thái tử, nhưng Hiệu mất sớm, con trai Hiệu là Hoàng tôn Phúc Dương còn thơ ấu mà hoàng tử cả là Chương cũng đã mất. Hoàng tử thứ hai là Nguyễn Phúc Luân cũng rất khôi ngô tuấn tú, theo thứ tự sẽ phải lập Hoàng tôn Dương hoặc Phúc Luân lên ngôi nên đã trao Luân cho một thầy học nổi tiếng là Trương Vǎn Hạnh dạy bảo. Nhưng khi Võ Vương mất, tình hình lại đảo ngược. Quyền thần Trương Phúc Loan không muốn lập Phúc Luân vì Luân đã lớn tuổi, khó bề lộng hành. Trương Phúc Loan lại chọn Nguyễn Phúc Thuần mới 12 tuổi lên ngôi vua. Phúc Luân không được lập mà còn bị bắt giam. Trương Vǎn Hạnh cũng bị giết chết. Nguyễn Phúc Thuần còn nhỏ tuổi, mọi quyền hành đều do Trương Phúc Loan sắp đặt. Loan tự phong là Quốc phó. Loan thâu tóm toàn bộ từ chính sự đến kinh tế. Các nguồn lợi chủ yếu của vương quốc Đàng Trong đều rơi vào tay Trương Phúc Loan và họ hàng của hắn. Ngày nắng, Loan cho đem phơi của cải quý báu làm sáng rực cả một góc trời. Có tiền, có quyền, Loan mặc sức hoành hành ngang ngược, người người ai nấy đều oán giận. Nghĩa quân Tây Sơn do Nguyễn Nhạc cầm đầu ở Quy Nhơn được nhân dân đồng tình ủng hộ ngày càng lớn mạnh. Thêm vào đó, tháng 5 nǎm Giáp Ngọ (1774) Chúa Trịnh lại cho đại quân vào đánh Nguyễn. Cả nghĩa quân Tây Sơn lẫn quân Trịnh đều nêu khẩu hiệu : \"Trừ khử quyền thần Trương Phúc Loan và tôn phò Hoàng tôn Dương\". Chiến tranh loạn lạc lại nổ ra, đất Thuận Hoá trước trù phú là thế mà nay trǎm bề xơ xác tiêu điều, người chết đói đầy đường. Trước tình cảnh đó, không có cách nào khác, tôn thất nhà Nguyễn cùng nhau lập tức bắt trói Trương Phúc Loan nộp cho quân Trịnh. Tháng 12 nǎm 1974, quân Trịnh chiếm được Phú Xuân và đặt quan cai trị Thuận Hoá. Trong số quan lại nhà Trịnh cử vào trấn thủ Thuận Hoá có Lê Quý Đôn (1776). Nghĩa quân Tây Sơn tìm cách hoà hoãn với quân Trịnh để yên mặt Bắc và rảnh tay đánh Nguyễn ở phía Nam. Đại quân Tây Sơn cả thuỷ lẫn bộ đánh vào Gia Định. Chúa Nguyễn Phúc Thuần chạy về Định Tường rồi lại chạy sang Long Xuyên. Tháng 9 nǎm Đinh Dậu (1777), quân Tây Sơn do Nguyễn Huệ thống lĩnh đánh chiếm Long Xuyên, chúa Nguyễn bị chết trận. Như vậy Nguyễn Phúc Thuần ở ngôi chúa được 12 nǎm, thọ 24 tuổi không có con nối. Sau triều Nguyễn truy tôn là Duệ Tông Hiếu định Hoàng đế. Định vương Nguyễn Phúc Thuần chết, kết thúc giai đoạn lịch sử của 9 đời chúa Nguyễn Đàng Trong."
    }, {
        "id": 113,
        "title": "Lật đổ chúa Nguyễn",
        "description": "Lật đổ chúa Nguyễn. Ở Đàng Trong, trong những năm cuối đời, Chúa Nguyễn Phúc Khoát đâm ra say mê tửu sắc, không còn quan tâm việc nước nữa, giao hết mọi việc cho quyền thần Trương Phúc Loan. Chính sự họ Nguyễn ngay từ thời Nguyễn Phúc Khoát đã gây những ảnh hưởng tiêu cực cho dân chúng. Hệ thống thuế khóa phức tạp, cồng kềnh, nặng nề, quan dưới lạm thu khiến dân phải nộp nhiều hơn quy định. Năm 1765, Vũ Vương Nguyễn Phúc Khoát chết, chính quyền chúa Nguyễn rơi vào tay quyền thần Trương Phúc Loan. Loan thao túng triều chính, tự xưng là \"Quốc phó\", giết Nguyễn Phúc Luân (cha Nguyễn Phúc Ánh) và lập Nguyễn Phúc Thuần, lúc đó mới 12 tuổi lên ngôi, tức là Định vương. Trương Phúc Loan trở thành quyền thần lấn lướt, mọi quyền hành đều bị thao túng."
    }, {
        "id": 114,
        "title": "Đánh bại liên quân Xiêm - Nguyễn",
        "description": "Đánh bại liên quân Xiêm - Nguyễn. Trong thời gian còn chống trả Tây Sơn tại Nam Bộ, Nguyễn Ánh nhiều lần thông qua giám mục Pigneau de Béhaine (hay Bá Đa Lộc) để cầu viện người Pháp nhưng không thu được nhiều kết quả. Do đó Ánh có ý chuyển sang cầu viện ở Xiêm La. Tháng 2 năm Giáp Thìn (1784), Nguyễn Ánh từ Hà Tiên sang Xiêm La hội kiến với vua Xiêm La là Chất Tri (Chakri, Rama I) tại Vọng Các (Bangkok). Theo quan điểm của các tác giả Việt Nam hiện đại là Nguyễn Lương Bích và Phạm Ngọc Phụng thì đây là lần \"cõng rắn cắn gà nhà\" đầu tiên của Nguyễn Ánh."
    }, {
        "id": 115,
        "title": "Lật đổ chúa Trịnh",
        "description": "Lật đổ chúa Trịnh. Tại Bắc Hà, năm 1782, Tĩnh Đô vương Trịnh Sâm chết. Con nhỏ Trịnh Cán được lập. Phe người con lớn là Trịnh Tông (hay Trịnh Khải), làm binh biến giết quan phụ chính là Huy quận công Hoàng Tố Lý (cháu lão tướng Hoàng Ngũ Phúc) đưa Trịnh Tông lên ngôi, tức là Đoan Nam vương (1782-1786). Một tướng cùng phe với quận Huy là Nguyễn Hữu Chỉnh không hợp tác với Trịnh Tông, bỏ chạy vào nam hàng Tây Sơn và được Nguyễn Nhạc rất tín nhiệm. Bắc Hà ngày một suy yếu. Kinh thành Thăng Long bị quân kiêu binh - những kẻ có công tôn lập chúa Trịnh - càn quấy, tàn phá. Sau khi đánh bật được Nguyễn Ánh ra khỏi lãnh thổ, Nguyễn Nhạc quyết định đánh chiếm Phú Xuân (đất cũ của chúa Nguyễn). Năm 1786, ông cử Nguyễn Huệ làm tổng chỉ huy đánh ra Bắc."
    }, {
        "id": 116,
        "title": "Mâu thuẫn nội bộ",
        "description": "Mâu thuẫn nội bộ. Sử sách không ghi chép thật rõ ràng về sự kiện mâu thuẫn giữa anh em Tây Sơn. Có tài liệu nói rằng Nguyễn Nhạc yêu cầu Nguyễn Huệ nộp vàng bạc lấy từ kho của họ Trịnh ở Bắc Hà mang về Nam nhưng vua em không chịu; hơn thế vua em lại xin vua anh cho cai quản thêm Quảng Nam và vua anh không chấp thuận, do đó Nguyễn Huệ chủ động mang quân vào Nam đánh Nguyễn Nhạc. Có ý kiến bàn thêm rằng, chủ trương của Nguyễn Nhạc là tập trung tiêu diệt chúa Nguyễn, chỉ đánh chiếm phần đất của chúa Nguyễn để thay thế cai trị tại miền Nam và giữ hòa bình với Bắc Hà, cho nên việc Nguyễn Huệ tự ý đem quân Bắc tiến là trái ý vua anh. Ngay khi biết tin Nguyễn Huệ đánh Thăng Long, vua Tây Sơn vội mang quân ra Bắc, thực chất là để gọi em về. Mặt khác, Nguyễn Nhạc không yên tâm với sự phát triển thế lực riêng của Nguyễn Huệ. Trong khi đó, là người có hùng tâm, Nguyễn Huệ có chủ trương tự lực phát triển ra ngoài tầm kiềm chế của vua anh và việc Bắc tiến của ông không hẳn chỉ vì lời khuyên của Nguyễn Hữu Chỉnh. Đây mới chính là nguyên nhân dẫn tới mâu thuẫn của anh em Tây Sơn."
    }, {
        "id": 117,
        "title": "Đại phá quân Mãn Thanh",
        "description": "Đại phá quân Mãn Thanh. Cuối năm 1788, vua Thanh đương thời là Càn Long sai Tổng đốc Lưỡng Quảng Tôn Sĩ Nghị chỉ huy hơn 29 vạn quân, huy động từ Lưỡng Quảng, Vân Nam và Quý Châu hộ tống Lê Chiêu Thống về Việt Nam với danh nghĩa phù Lê, vào chiếm đóng Thăng Long."
    }, {
        "id": 118,
        "title": "Vua Quang Trung thống nhất nhà Tây Sơn và dựng nước",
        "description": "Vua Quang Trung thống nhất nhà Tây Sơn và dựng nước. Sau cái chết của Nguyễn Văn Duệ và sau đó là Vũ Văn Nhậm và diễn biến chiến trường Nam Bộ, vua Thái Đức (Nguyễn Nhạc) đã tỏ ra buông xuôi. Không thể kìm chế người em tài ba hơn mình, cuối năm 1788, ông từ bỏ đế hiệu và niên hiệu Thái Đức, chỉ xưng là \"Tây Sơn vương\". Ông viết thư cho Nguyễn Huệ, chỉ xin giữ Quy Nhơn và nhường toàn bộ binh quyền, đất đai trong cả nước cho vua em; đồng thời ông cầu khẩn Nguyễn Huệ mang gấp đại binh vào cứu Nam bộ. Tuy nhiên lúc đó Nguyễn Huệ dù biết lời cầu khẩn của anh nhưng không thể vào nam tham chiến vì 20 vạn quân Thanh do Lê Chiêu Thống rước về đã vượt qua biên giới. Nguy cơ phía bắc rõ ràng lớn và gấp hơn nên Nguyễn Huệ đã lên ngôi Hoàng đế, lấy hiệu là Quang Trung rồi kéo quân ra bắc và đã nhanh chóng đánh bại quân Thanh. Sau khi đánh bại quân Thanh, Quang Trung trở thành nhà lãnh đạo tối cao của triều Tây Sơn và là vị Hoàng đế duy nhất cai trị tại Việt Nam"
    }, {
        "id": 119,
        "title": "Sự sụp đổ của nhà Tây Sơn",
        "description": "Sự sụp đổ của nhà Tây Sơn. Kể từ năm 1787, với sự giúp đỡ mạnh mẽ hơn của người Pháp thông qua giám mục Pigneau de Béhaine (tức Bá Đa Lộc), Nguyễn Ánh quay trở lại Gia Định. Trước đó, ngày 25 tháng 1 năm 1787, Bá Đa Lộc (giáo sĩ người Pháp làm cố vấn cho Nguyễn Ánh) đã thay mặt Nguyễn Ánh ký Hiệp ước Versailles (1787) với Pháp. Theo đó, vua Pháp đồng ý cử sang 4 chiếc tàu chiến và một đạo binh: 1.200 lục quân, 200 pháo binh, 250 lính da đen ở Phi Châu (Cafres) và đủ các thứ súng ống thuốc đạn để đánh Tây Sơn."
    }, {
        "id": 120,
        "title": "Gia Long - Nguyễn Phúc Ánh",
        "description": "Gia Long - Nguyễn Phúc Ánh. Gia Long (1802-1820) Nguyễn Phúc Ánh, sinh nǎm Nhâm Ngọ (1762), con thứ ba của Nguyễn Phúc Luân. Mẹ Nguyễn Phúc Ánh là Nguyễn Thị Hoàn con gái Diễm Quốc công Nguyễn Phúc Trung, người làng Minh Linh, phủ Thừa Thiên. Nǎm 1773, Tây Sơn khởi nghĩa, Nguyễn Phúc Ánh 12 tuổi, theo chúa Nguyễn Phúc Thuần vào Quảng Nam. Mùa Thu nǎm Đinh Dậu (1777) Nguyễn Phúc Thuần tử trận. Nguyễn Phúc Ánh một mình chạy thoát ra đảo Thổ Chu, rồi sau chạy sang ẩn náu nhờ bên đất Xiêm. Tháng 7/1792, vua Quang Trung bị bạo bệnh mất, con là Quang Toản còn ít tuổi, nội bộ lục đục, không sao chống nổi với sức tấn công của Nguyễn Ánh (có Pháp ngoại viện). Nǎm 1802, Nguyễn Ánh diệt xong nhà Tây Sơn lên ngôi hoàng đế, niên hiệu là Gia Long đóng đô tại thành Phú Xuân (Huế) vào ngày 1 tháng 6 nǎm Nhâm Tuất (1802)."
    }, {
        "id": 121,
        "title": "Minh Mạng - Nguyễn Phúc Đảm",
        "description": "Minh Mạng - Nguyễn Phúc Đảm. Minh Mạng (1820-1840) tên huý là Nguyễn Phúc Đảm, sinh ngày 23 tháng 4 nǎm Tân Hợi (25/5/1791), là con thứ 4 của Gia Long. Tháng giêng nǎm Canh Thìn (1820), thái tử Đảm lên ngôi vua, niên hiệu là Minh Mạng. Minh Mạng có tư chất thông minh, hiếu học, nǎng động và quyết đoán. Minh Mạng đặt ra lệ: các quan ở Thành, Dinh, Trấn - vǎn từ Hiệp trấn, Cai bạ, Ký lục, Tham hiệp; võ từ Thống quản cơ đến Phó vệ uý... ai được thǎng điện, bổ nhiệm... đều phải đến kinh đô gặp vua, để vua hỏi han công việc, kiểm tra nǎng lực và khuyên bảo. Là người tinh thâm nho học, sùng đạo Khổng Mạnh, Minh Mạng rất quan tâm đến học hành, khoa cử, tuyển chọn nhân tài. Nǎm 1821 cho dựng Quốc Tử Giám, đặt chức Tế Tửu và Tư Nghiệp, mở lại thi Hội và thi Đình, trước 6 nǎm một khoa thi, nay rút xuống 3 nǎm."
    }, {
        "id": 122,
        "title": "Thiệu Trị - Nguyễn Phúc Miên Tông",
        "description": "Thiệu Trị - Nguyễn Phúc Miên Tông. Thiệu Trị (1841-1847) tên huý là Phúc Tuyền sau đổi là Miên Tông, là con trưởng của Minh Mạng và mẹ là Thuận Đức Thần Phi Hổ Thị Hoa, sinh 11 tháng 5 Đinh Mão (1807). Tháng Giêng nǎm Tân Sửu (1841) Miên Tông lên ngôi vua đặt niên hiệu là Thiệu Trị, lúc đó đã 34 tuổi. Thiệu Trị lên ngôi cứ theo quy chế được sắp đặt từ thời Minh Mạng mà làm theo di huấn của cha."
    }, {
        "id": 123,
        "title": "Tự Đức - Nguyễn Phúc Hồng Nhậm",
        "description": "Tự Đức - Nguyễn Phúc Hồng Nhậm. Tự Đức (1847-1883) tên huý là Hồng Nhiệm, sinh ngày 25 tháng 8 nǎm Kỷ Sửu (1829) là con thứ hai của Thiệu Trị và bà Phạm Thị Hằng - con gái Thượng thư Bộ Lễ Phạm Đǎng Hưng. Tháng 10 nǎm 1847, Hồng Nhiệm lên ngôi vua, đặt niên hiệu là Tự Đức, lúc đó 19 tuổi."
    }, {
        "id": 124,
        "title": "Dục Đức - Nguyễn Phúc Ưng Chân",
        "description": "Dục Đức - Nguyễn Phúc Ưng Chân. Dục Đức (1883, làm vua 3 ngày) Tự Đức có hàng trǎm vợ nhưng không có con, phải nuôi ba người con các anh mình làm con nuôi: Ưng Chân, Ưng Xuỵ, Ưng Đǎng. Tự Đức chết, triều thần đưa Ưng Chân lên ngôi vua là Dục Đức."
    }, {
        "id": 125,
        "title": "Hiệp Hoà - Nguyễn Phúc Hồng Dật",
        "description": "Hiệp Hoà - Nguyễn Phúc Hồng Dật. Hiệp Hoà (6/1883-11/1883, làm vua được 6 tháng) tên huý là Hồng Dật, con thứ 29 và là con út của Thiệu Trị, sinh tháng 9 nǎm 1846. Tháng 6/1883 phế xong Dục Đức, Nguyễn Vǎn Tường và Tôn Thất Thuyết xin ý chỉ của Hoàng thái hậu Từ Dũ đưa Hồng Dật lên ngôi vua, niên hiệu Hiệp Hoà."
    }, {
        "id": 126,
        "title": "Kiến Phúc - Nguyễn Phúc Ưng Đăng",
        "description": "Kiến Phúc - Nguyễn Phúc Ưng Đăng. Kiến Phúc (1883-1884) Ưng Đǎng là con nuôi thứ 3 của Tự Đức, sinh ngày 2 tháng Giêng nǎm 1870. Vì Tự Đức không có con, lúc 2 tuổi được sung làm Hoàng thiếu tử, do Học phi Nguyễn Thị Chuyên nuôi dưỡng. Nguyễn Văn Tường và Tôn Thất Thuyết phế Hiệp Hoà cho người đón Ưng Đǎng lập lên làm vua ngày 1/12/1883 niên hiệu là Kiến Phúc, lúc đó mới 14 tuổi."
    }, {
        "id": 127,
        "title": "Hàm Nghi - Nguyễn Phúc Ưng Lịch",
        "description": "Hàm Nghi - Nguyễn Phúc Ưng Lịch. Hàm Nghi (1884-1885) Sau khi Kiến Phúc bị giết, ngày 1/8/1884 Ưng Lịch mới 13 tuổi được đưa lên ngôi vua, niên hiệu là Hàm Nghi. Lúc đó, Hoà ước Giáp Thân (6/6/1884) đã được ký kết. Lễ đǎng quang của Hàm Nghi không được Nam triều thông báo cho Khâm sứ Pháp tại Trung kỳ biết, nên Rê-na không thừa nhận vua mới."
    }, {
        "id": 128,
        "title": "Đồng Khánh - Nguyễn Phúc Ưng Biện",
        "description": "Đồng Khánh - Nguyễn Phúc Ưng Biện. Đồng Khánh (1885-1888) Sau khi vua Hàm Nghi bỏ kinh đô Huế chạy ra Quảng Trị, xuống Chiếu Cần Vương chống Pháp, thực dân Pháp bàn với các đại thần cơ mật Nguyễn Hữu Độ và Phan Đình Bình đưa Ưng Xuỵ lên ngôi vua, niên hiệu là Đồng Khánh. Đồng Khánh tên huý là Ưng Biện, con trưởng của Kiên Thái vương Hồng Cai, mẹ là Bùi Thị, nǎm 1865 lên 2 tuổi, được đưa vào làm con nuôi thứ hai của Tự Đức."
    }, {
        "id": 129,
        "title": "Thành Thái - Nguyễn Phúc Bửu Lân",
        "description": "Thành Thái - Nguyễn Phúc Bửu Lân. Thành Thái (1889-1907) Đống Khánh mất, các con trai còn quá nhỏ. Triều đình Huế vâng chỉ của Nghi Thiên Chương Hoàng hậu (vợ Thiệu Trị) và Lệ Thiên Anh Hoàng hậu (vợ Tự Đức) đón Hoàng tử Bửu Lân (con thứ 7 của Dục Đức) mới 8 tuổi về cung lên làm vua, niên hiệu là Thành Thái. Thành Thái thông minh, hiếu học, khi 4 tuổi, vua cha là Dục Đức bị phế và chết trong tù, Bửu Lân phải ra sống ở ngoại thành với bà con lao động, đã từng chia sẻ gian khổ với những người nghèo trong cảnh nước mất nhà tan. Vì thế, khi làm vua đến 10 tuổi Thành Thái đã sớm có ý thức về quốc sự. Thành Thái rất thích học các tân thư chữ Hán của Trung Quốc, Nhật Bản. Thành Thái có ý thức tự cường dân tộc và có những dự định cách tân đất nước, song đều bị thực dân Pháp ngǎn chặn. Thành Thái rất thương dân, thường hay vi hành để được gần dân chúng, để hiểu được sự đau khổ của dân một nước nô lệ."
    }, {
        "id": 130,
        "title": "Duy Tân - Nguyễn Phúc Vĩnh San",
        "description": "Duy Tân - Nguyễn Phúc Vĩnh San. Duy Tân (1907-1916) Phế truất Thành Thái, thực dân Pháp đưa hoàng tử Vĩnh San mới 8 tuổi lên làm vua để dễ bề sai khiến. Nhưng chúng không ngờ Duy Tân còn chống Pháp kiên quyết hơn vua cha."
    }, {
        "id": 131,
        "title": "Khải Định - Nguyễn Phúc Bửu Đảo",
        "description": "Khải Định - Nguyễn Phúc Bửu Đảo. Khải Định (1916-1925) Thực dân Pháp đưa Duy Tân đi đày, lập Hoàng thân Bửu Đảo, con trai của Đồng Khánh lên ngôi vua, niên hiệu là Khải Định."
    }, {
        "id": 132,
        "title": "Bảo Đại - Nguyễn Phúc Vĩnh Thuỵ",
        "description": "Bảo Đại - Nguyễn Phúc Vĩnh Thuỵ. Bảo Đại (1926-1945) Khải Định có 12 vợ nhưng không có con, Vĩnh Thuỵ là con của người khác, được Khải Định nhận làm con và đã được đưa sang Pháp đào tạo từ nǎm 10 tuổi. Khải Định chết, toàn quyền Đông Dương đưa Vĩnh Thuỵ lên ngôi vua niên hiệu Bảo Đại nhưng vẫn học ở Pháp. Triều đình do một hội đồng phụ chính điều hành."
    }, {
        "id": 133,
        "title": "Khởi nghĩa Trương Định",
        "description": "Khởi nghĩa Trương Định. Khởi nghĩa Trương Định (1859 – 1864) Năm 1859, thực dân Pháp chiếm thành Gia Định. Trương Định tổ chức nghĩa quân chống giặc ở Gò Công, Tân An, được triều đình Huế giao chức Lãnh binh. Năm 1862, vua quan nhà Nguyễn hàng giặc, ra lệnh giải binh, nhưng Trương Định cương quyết kháng Pháp đến cùng, được nhân dân suy tôn là Bình Tây đại nguyên soái. Ngày 20/8/1864, Trương Định bị thương nặng đã rút gươm tự sát. Con trai là Trương Quyền tiếp tục chiến đấu đến năm 1867."
    }, {
        "id": 134,
        "title": "Khởi nghĩa Nguyễn Trung Trực",
        "description": "Khởi nghĩa Nguyễn Trung Trực. Khởi nghĩa Nguyễn Trung Trực (1861 – 1868) Năm 1861, Nguyễn Trung Trực (tức Nguyễn Văn Lịch) nổi dậy ở Tân An, chỉ huy nghĩa quân đốt cháy tàu Hy Vọng (Espérance) của giặc Pháp trên sông Vàm Cỏ Đông (12/1861), rồi lập căn cứ kiên trì chống giặc khắp vùng Rạch Giá, Hà Tiên và đảo Phú Quốc. Năm 1868, bị giặc bắt và đưa đi hành hình, ông đã hiên ngang nói thẳng vào mặt chúng: “Bao giờ người Tây nhổ hết cỏ nước Nam thì mới hết người nước Nam đánh Tây”."
    }, {
        "id": 135,
        "title": "Khởi nghĩa Ba Đình",
        "description": "Khởi nghĩa Ba Đình. Khởi nghĩa Ba Đình là một trong các cuộc khởi nghĩa của phong trào Cần Vương cuối thế kỷ 19 của nhân dân Việt Nam chống lại ách đô hộ của thực dân Pháp, diễn ra vào năm 1886-1887 tại Ba Đình, huyện Nga Sơn, tỉnh Thanh Hóa."
    }, {
        "id": 136,
        "title": "Khởi nghĩa Bãi Sậy",
        "description": "Khởi nghĩa Bãi Sậy. Khởi nghĩa Bãi Sậy là một trong các cuộc khởi nghĩa của phong trào Cần Vương cuối thế kỷ 19 của nhân dân Việt Nam chống lại ách đô hộ của thực dân Pháp, diễn ra từ năm 1883 và kéo dài đến năm 1892 mới tan rã. Bãi Sậy là một trong những trung tâm chống Pháp lớn nhất vào cuối thế kỷ 19.[1] Trong thời kỳ đầu (1883 - 1885), phong trào do Đinh Gia Quế lãnh đạo, các địa bàn hoạt động lúc này còn giới hạn ở vùng Bãi Sậy (bao gồm địa phận các huyện Văn Lâm, Văn Giang, Khoái Châu, Yên Mỹ thuộc tỉnh Hưng Yên).[2] Từ năm 1885 trở đi, vai trò lãnh đạo thuộc về Nguyễn Thiện Thuật. Ông là thủ lĩnh cao nhất của nghĩa quân Bãi Sậy[3]. Bố chánh Thái Nguyên Vũ Giác là người giúp đỡ rất nhiều cho cuộc khởi nghĩa Bãi Sậy.[1]"
    }, {
        "id": 137,
        "title": "Khởi nghĩa Hùng Lĩnh",
        "description": "Khởi nghĩa Hùng Lĩnh. Khởi nghĩa Hùng Lĩnh là một cuộc khởi nghĩa trong phong trào Cần Vương chống Pháp cuối thế kỷ 19 trong lịch sử Việt Nam. Công cuộc này khởi phát năm 1887[1] tại Hùng Lĩnh (Vĩnh Lộc, Thanh Hóa), ngay sau khi căn cứ Ba Đình và Mã Cao lần lượt thất thủ. Lãnh đạo chính là Chánh sứ sơn phòng Thanh Hóa Tống Duy Tân cùng hai cộng sự đắc lực là Đề đốc Cao Điển[2] và tù trưởng người Thái Cầm Bá Thước. Tháng 10 năm 1892, cuộc khởi nghĩa kết thúc, sau khi thủ lĩnh là Tống Duy Tân bị đối phương bắt sống rồi xử chết."
    }, {
        "id": 138,
        "title": "Khởi nghĩa Yên Thế",
        "description": "Khởi nghĩa Yên Thế. Khởi nghĩa Yên Thế là một cuộc đối đầu vũ trang giữa những người nông dân ly tán tại vùng Yên Thế Thượng và sau đó là Thái Nguyên, đứng đầu là Hoàng Hoa Thám, với quân Pháp, khi Pháp vừa kết thúc chiến tranh với Trung Quốc và bắt đầu kiểm soát toàn bộ vùng Bắc kỳ những năm cuối thế kỷ 19 trong lịch sử Việt Nam."
    }, {
        "id": 139,
        "title": "Khởi nghĩa Thái Nguyên",
        "description": "Khởi nghĩa Thái Nguyên. Khởi nghĩa Thái Nguyên hay Binh biến Thái Nguyên là tên gọi cuộc nổi dậy ở tỉnh lỵ Thái Nguyên vào năm 1917 do Trịnh Văn Cấn chỉ huy, chống lại chính quyền Bảo hộ của Pháp để giành độc lập cho người Việt."
    }, {
        "id": 140,
        "title": "Cuộc bạo động Lạng Sơn",
        "description": "Cuộc bạo động Lạng Sơn. Mùa Thu năm 1921, Đội Ấn (người Tày) huyện Cao Lộc, Lạng Sơn tổ chức cuộc bạo động, nghĩa binh đánh vào trại lính khố xanh gần Kỳ Lừa, nghĩa quân diệt được tên Cung Khắc Đản, Tuần phủ ở Pắc Lương, huyện Yên Lãng, ít ngày sau cuộc bạo động cũng bị thực dân Pháp dập tát."
    }, {
        "id": 141,
        "title": "Cuộc bạo động Yên Bái",
        "description": "Cuộc bạo động Yên Bái. Ngày 10/2/1931, cuộc bạo động của Việt Nam Quốc dân đảng do Nguyễn Thái Học và Nguyễn Khắc Nhu chỉ huy, nổ ra ở Yên Bái và một vài địa phương khác nhưng đã bị thực dân Pháp dập tắt nhanh chóng. Hơn 80 năm thực dân Pháp xâm lược và thống trị nước ta, nhân dân ta đã liên tục vùng lên đấu tranh để tự giải phóng, song các cuộc khởi nghĩa đó đều bị thực dân Pháp đàn áp đẫm máu và đã thất bại. Mặc dù vậy, các cuộc đấu tranh ấy đã biểu thị tinh thần quật cường của dân tộc và góp phần đưa tới thắng lời của cuộc Cách mạng Tháng Tám do Đảng Cộng sản Đông Dương lãnh đạo."
    }, {
        "id": 142,
        "title": "Phong trào Xô Viết Nghệ Tĩnh",
        "description": "Phong trào Xô Viết Nghệ Tĩnh. Xô Viết Nghệ Tĩnh là tên gọi chỉ phong trào đấu tranh của lực lượng công nhân và nông dân ở Nghệ An và Hà Tĩnh trong năm 1930-1931 chống lại đế quốc Pháp tại Việt Nam. Tên gọi Xô viết Nghệ Tĩnh xuất phát từ sự hình thành các \"xã bộ nông\" mà những người cộng sản gọi là \"Xô viết\" [1]. Phong trào này được mở đầu bằng cuộc biểu tình ngày 1 tháng 5 năm 1930 của công nhân khu công nghiệp Bến Thủy và nông dân thuộc 5 xã ven thành phố Vinh. Từ đó đến tháng 8 năm 1930, ở vùng Nghệ Tĩnh đã có đến 97 cuộc bãi công và biểu tình của công nhân và nông dân, trong đó đáng chú ý là cuộc bãi công kéo dài của công nhân Nhà máy Diêm đã dẫn đến cuộc tổng bãi công của toàn thể công nhân khu công nghiệp Bến Thủy. Đứng đằng sau những vụ việc này là sự chỉ đạo của Đảng Cộng sản Đông Dương thông qua Xứ ủy Trung Kỳ (hệ thống cơ sở của Đảng Cộng sản Đông Dương ở vùng này)."
    }, {
        "id": 143,
        "title": "Thành lập Đảng Cộng sản Việt Nam",
        "description": "Thành lập Đảng Cộng sản Việt Nam. Hội nghị thành lập Đảng Cộng sản Việt Nam diễn ra từ ngày 6/1-7 /2/1930 tại Hương Cảng, Trung Quốc. Người chủ trì Hội nghị là Nguyễn Ái Quốc, với chức vụ là phái viên của Quốc tế Cộng sản. Hội nghị là sự hợp nhất 3 tổ chức Cộng sản trong Việt Nam và Đông Dương, Đông Dương Cộng sản Đảng, An Nam Cộng sản Đảng và Đông Dương Cộng sản Liên đoàn."
    }, {
        "id": 144,
        "title": "Cách Mạng tháng Tám",
        "description": "Cách Mạng tháng Tám. Cách mạng tháng Tám là tên gọi được ngành sử học chính thống tại Việt Nam hiện nay dùng để chỉ việc phong trào Việt Minh tiến hành khởi nghĩa chống lại lực lượng quân đội của Đế quốc Nhật Bản, buộc Đế quốc Việt Nam (chính phủ được Đế quốc Nhật Bản bảo hộ) bàn giao chính quyền trung ương và các địa phương và buộc Bảo Đại (vua cuối cùng của nhà Nguyễn) phải thoái vị trong tháng 8 năm 1945. Việc chuyển giao quyền lực được chính phủ Đế quốc Việt Nam thực hiện cơ bản trong hoà bình, ít có đụng độ dù xảy ra tranh chấp với lực lượng Nhật, Đại Việt, Hòa Hảo,... ở một số địa phương. Trừ một số địa phương tỉnh lỵ như Hải Ninh (nay thuộc Quảng Ninh), Hà Giang, Lào Cai, Lai Châu, Vĩnh Yên nằm trong tay các đảng phái khác như Đại Việt, Việt Nam Quốc dân đảng... và quân Tưởng Giới Thạch (Trung Quốc); chỉ trong 10 ngày, chính quyền Việt Minh đã được thiết lập trên toàn bộ các tỉnh lỵ trên khắp Việt Nam (muộn nhất 28/8: Đồng Nai Thượng, Hà Tiên), hầu hết địa phương trong cả nước. Một số nơi có khó khăn hơn như Hà Giang, quân Tưởng Giới Thạch bức rút quân Nhật (29/8) và chiếm luôn tỉnh này, Cao Bằng (giành chính quyền 21/8 nhưng sau đó quân Tưởng tràn vào), Lạng Sơn (giành chính quyền sau đó quân Tưởng Giới Thạch tràn vào, tháng 10 mới thành lập chính quyền cách mạng), Vĩnh Yên (Quốc dân đảng nắm giữ), Hải Ninh - Móng Cái (Cách mệnh Đồng Minh hội nắm), một số địa bàn ở Quảng Ninh (do Đại Việt, Cách mệnh Đồng Minh hội nắm), ở Đà Lạt (quân Nhật còn kháng cự mạnh như ngày 3/10)..."
    }, {
        "id": 145,
        "title": "Việt Nam trong hơn một năm đầu sau cách mạng tháng Tám",
        "description": "Việt Nam trong hơn một năm đầu sau cách mạng tháng Tám. Thời gian này, đất nước ta gặp muôn vàn khó khăn thử thách. Xây dựng chính quyền cách mạng, xây dựng chế độ dân chủ nhân dân, diệt giặc đói, diệt giặc dốt, khắc phục khó khăn về tài chính là những nhiệm vụ cấp bách lúc này cần được giải quyết đồng thời với đấu tranh chống ngoại xâm, nội phản để bảo vệ chính quyền, giữ vững thành quả cách mạng và chuẩn bị cho cuộc chiến đấu lâu dài chống thực dân Pháp về sau."
    }, {
        "id": 146,
        "title": "Những năm đầu toàn quốc kháng chiến chống thực dân Pháp",
        "description": "Những năm đầu toàn quốc kháng chiến chống thực dân Pháp. (1946 – 1950) Âm mưu, hành động của thực dân Pháp mở rộng chiến tranh xâm lược cả nước ta; quyết định của Đảng, Chính phủ và Chủ tịch Hồ Chí Minh về một cuộc kháng chiến toàn quốc chống Pháp; đường lối kháng chiến chống Pháp của Đảng. Cuộc chiến đấu ở thủ đô Hà Nội và các đô thị khác phía Bắc vĩ tuyến 16 mở đầu kháng chiến toàn quốc. Đồng thời với hoạt động chiến đấu là những hoạt động di chuyển và thực hiện \"tiêu thổ kháng chiến\". Tiếp theo là những hoạt động đẩy mạnh chuẩn bị cho cuộc chiến đấu lâu dài. Âm mưu, hành động của địch đánh phá căn cứ địa kháng chiến Việt Bắc. Cuộc chiến đấu của quân và dân ta đánh trả cuộc tiến công Việt Bắc của địch. Sau chiến thắng Việt Bắc, cuộc kháng chiến toàn dân, toàn diện được đẩy mạnh."
    }, {
        "id": 147,
        "title": "Bước phát triển mới của cuộc kháng chiến toàn quốc chống thực dân Pháp",
        "description": "Bước phát triển mới của cuộc kháng chiến toàn quốc chống thực dân Pháp. (1950 - 1953) là sự phát triển mới của cuộc kháng chiến toàn quốc chống Pháp khi bước vào thu đông 1950: - Mở đầu là Chiến dịch tiến công Biên giới thu - đông 1950 giành thắng lợi. Sau thắng lợi Biên giới, quân ta mở liên tiếp nhiều chiến dịch tiến công và phản công trên cả ba chiến trường (đồng bằng, trung du, miền núi), giành thắng lợi trong các chiến dịch mở ra ở rừng núi (Hoà Bình đông - xuân 1951 - 1952, Tây Bắc thu - đông 1952, Thượng Lào xuân - hè 1953). Đế quốc Mĩ ngày càng can thiệp sâu vào cuộc chiến tranh xâm lược Đông Dương. Thực dân Pháp thực hiện Kế hoạch Đờ Lát đờ Tátxinhi (De Lattre dễ Tassigny) với âm mưu giành lại quyền chủ động chiến lược đã mất sau thất bái ở chiến dịch Biên giới. - Đảng Cộng sản Đông Dương tổ chức Đại hội đại biểu toàn quốc lần thứ II (2-1951). Đại hội quyết định đưa Đảng ra hoạt động công khai, lấy tên là Đảng Lao động Việt Nam, chủ trương củng cố hậu phương kháng chiến về mọi mặt, đẩy mạnh cuộc kháng chiến đến thắng lợi."
    }, {
        "id": 148,
        "title": "Cuộc kháng chiến chống thực dân pháp kết thúc",
        "description": "Cuộc kháng chiến chống thực dân pháp kết thúc. (1953 - 1954) - Pháp - Mĩ đẩy mạnh chiến tranh xâm lược Đông dương, thực hiện Kế hoạch Nava với âm mưu giành thắng lợi quân sự quyết định, “kết thúc chiến tranh trong danh dự” . - Chủ trương kế hoạch Đông - Xuân 1953 - 1954 của Đảng, Chủ tịch Hồ Chí Minh về một cuộc tiến công chiến lược và trận \"quyết chiến chiến lược\" Điện Biên Phủ. - Trận thắng Điện Biên Phủ đã quyết định đi đến họp Hội nghị Giơnevơ và kí Hiệp định về chấm dứt chiến tranh, lập lại hoà bình ở Đông Dương."
    }, {
        "id": 149,
        "title": "Xây dựng Chủ Nghĩa Xã Hội ở miền Bắc và đấu tranh chống Mĩ – Ngụy ở miền Nam",
        "description": "Xây dựng Chủ Nghĩa Xã Hội ở miền Bắc và đấu tranh chống Mĩ – Ngụy ở miền Nam. (1954-1965) trong 10 năm đầu sau ngày kí Hiệp định Giơnevơ: - Tình hình, đặc điểm của đất nước sau Hiệp định Giơnevơ và nhiệm vụ cách mạng trong thời kì mới. - Miền Bắc tiếp tục hoàn thành cải cách ruộng đất, khôi phục kinh tế, cải tạo xã hội chủ nghĩa và bước đầu xây dựng cơ sở vật chất - kĩ thuật của chủ nghĩa xã hội. - Miền Nam đấu tranh chống chế độ Mĩ - Diệm, thực hiện \"đồng khởi, tiến tới đánh bại chiến lược \"chiến tranh đặc biệt\" của Mĩ và tay sai."
    }, {
        "id": 150,
        "title": "Cả nước trực tiếp chiến đấu chống đế quốc Mĩ xâm lược",
        "description": "Cả nước trực tiếp chiến đấu chống đế quốc Mĩ xâm lược. (1965 - 1973) Kháng chiến chống Mĩ cứu nước trong gần 10 năm, kể từ sau khi đế quốc Mĩ phát động chiến lược \"chiến tranh cục bộ\" ở miền Nam và tiến hành chiến tranh phá hoại bằng không quân và hải quân đối với miền Bắc, đến khi Hiệp định Phụ được kí kết. Đây là thời kì cả nước có chiến tranh dưới những hình thức và mức độ khác nhau"
    }, {
        "id": 151,
        "title": "Cả nước dồn sức giải phóng hoàn toàn miền Nam, giành toàn vẹn lãnh thổ Tổ Quốc",
        "description": "Cả nước dồn sức giải phóng hoàn toàn miền Nam, giành toàn vẹn lãnh thổ Tổ Quốc. (1973 - 1975) kháng chiến chống Mĩ cứu nước từ sau ngày Hiệp định Pari được kí kết đến khi kết thúc thắng lợi hoàn toàn bằng cuộc Tổng tiến công và nổi dậy Xuân 1975, đỉnh cao là chiến dịch Hồ Chí Minh lịch sử."
    }, {
        "id": 152,
        "title": "Năm đầu sau thắng lợi của cuộc kháng chiến chống Mĩ cứu nước",
        "description": "Năm đầu sau thắng lợi của cuộc kháng chiến chống Mĩ cứu nước. (1975 - 1976) Tình hình đất nước trong năm đầu sau thắng lợi của cuộc kháng chiến chống Mĩ cứu nước. Những nhiệm vụ cấp bách trước mắt đặt ra cho toàn Đảng, toàn dân ta trong thời gian này là: - Nhanh chóng khắc phục hậu quả chiến tranh, khôi phục và phát triển kinh tế văn hoá. - Hoàn thành thống nhất đất nước về Nhà nước để tiến tới thống nhất đất nước trên mọi lĩnh vực."
    }, {
        "id": 153,
        "title": "Bước đầu đi lên Chủ Nghĩa Xã Hội",
        "description": "Bước đầu đi lên Chủ Nghĩa Xã Hội. (1976 - 1986) công cuộc xây dựng chủ nghĩa xã hội trong 10 năm đầu sau khi hoàn thành thống nhất đất nước về Nhà nước. Bốn tháng sau ngày miền Nam được hoàn toàn giải phóng, vào tháng 9-1975, Ban Chấp hành Trung ương Đảng (khoá III) triệu tập Hội nghị lần thứ 24 để quyết định nhiệm vụ cách mạng cả nước trong thời kì mới. Hội nghị nêu rõ cả nước có chung nhiệm vụ cách mạng xã hội chủ nghĩa, nhưng trong thời kì đầu, do những đặc điểm riêng, cách mạng mỗi miền có những yêu cầu khác nhau. Miền Bắc phải tiếp tục đẩy mạnh sự nghiệp xây dựng chủ nghĩa xã hội và hoàn thiện quan hệ sản xuất xã hội chủ nghĩa; miền Nam phải đồng thời tiến hành cải tạo xã hội chủ nghĩa và xây dựng chủ nghĩa xã hội."
    }, {
        "id": 154,
        "title": "Trên đường đổi mới đi lên Chủ Nghĩa Xã Hội",
        "description": "Trên đường đổi mới đi lên Chủ Nghĩa Xã Hội. (1986 - 2000) công cuộc xây dựng chủ nghĩa xã hội ở nước ta theo đường lối đổi mới do Đại hội đại biểu toàn quốc lần thứ Vi của Đảng đề ra. Những thành tựu đạt được trong thời kì đổi mới đã làm thay đổi sâu sắc đời sống kinh tế - xã hội của đất nước."
    }]