[{"id":1,"fullName":"An Dương Vương","birth":"không rõ","death":"208 TCN / 179 TCN1","father":"Thục Chế (theo truyền thuyết)2","note":"An Dương Vương (chữ Hán: 安陽王), tên thật là Thục Phán (蜀泮), là một vị vua đã lập nên đất nước Âu Lạc và cũng là vị vua duy nhất cai trị nhà nước này. Âu Lạc là nhà nước thứ hai trong lịch sử Việt Nam sau nhà nước Văn Lang đầu tiên của các vua Hùng."},{"id":2,"fullName":"Âu Cơ","birth":"?","death":"?","father":"Đế Lai (?)","mother":"Không rõ","note":"Âu Cơ (chữ Hán: 嫗姬), hay phiên âm Ẩu Cơ, là một nhân vật trong truyền thuyết Việt Nam, theo đó bà là tổ mẫu của người Việt."},{"id":3,"fullName":"Bà Triệu","birth":"Năm 225 Yên Định, Thanh Hóa","death":"Năm 248 Hậu Lộc, Thanh Hóa","note":"Bà Triệu (chữ Hán: 趙婆), còn được gọi là Triệu Ẩu (趙嫗), Triệu Trinh Nương (趙貞娘), Triệu Thị Trinh (趙氏貞), Triệu Quốc Trinh (225–248), là một trong những vị anh hùng dân tộc trong lịch sử Việt Nam."},{"id":4,"fullName":"Bảo Đại","birth":"22 tháng 10, 1913 Huế, Đại Nam, Liên bang Đông Dương","death":"31 tháng 7, 1997 (83 tuổi) Val-de-Grâce, Paris, Pháp","father":"Khải Định","mother":"Từ Cung Hoàng thái hậu","dynasty":"Nhà Nguyễn","realName":"Nguyễn Phúc Vĩnh Thụy (阮福永瑞)","note":"Bảo Đại (chữ Hán: 保大; 22 tháng 10 năm 1913 – 31 tháng 7 năm 1997), tên khai sinh: Nguyễn Phúc Vĩnh Thụy (阮福永瑞), là vị hoàng đế thứ 13 và là vị vua cuối cùng của triều đại nhà Nguyễn nói riêng và của chế độ quân chủ trong lịch sử Việt Nam nói chung."},{"id":5,"fullName":"Bộ Chất","note":"Bộ Chất (?-247) tự Tử Sơn là một tướng Đông Ngô dưới thời Tam Quốc. Ông là một học giả sống ở đất Ngô, làm quân sư cho thủ lĩnh Tôn Quyền vào cuối thời Hậu Hán từ trước khi Đông Ngô ra đời."},{"id":6,"fullName":"Bùi Bá Kỳ","note":"Bùi Bá Kỳ (chữ Hán: 裴伯耆, ? - ?) là một võ tướng thời nhà Trần và thời thuộc Minh trong lịch sử Việt Nam."},{"id":7,"fullName":"Bùi Bị","note":"Bùi Bị là công thần khai quốc nhà Hậu Lê trong lịch sử Việt Nam1 ."},{"id":8,"fullName":"Bùi Cầm Hổ","note":"Bùi Cầm Hổ (chữ Hán: 裴扲虎, 1390 - 1483), là một vị quan triều đình nhà Lê sơ, làm việc cho vua Lê Thái Tổ và Lê Thái Tông. Ông nổi bật với những lần đi sứ sang nhà Minh và việc ngay thẳng can gián giúp vua Lê Thái Tông."},{"id":9,"fullName":"Bùi Diễm","note":"Bùi Diễm (sinh năm 1923) là đại sứ Việt Nam Cộng hòa ở Hoa Kỳ từ 1967 đến 1972. Ông từng là học sinh của Đại tướng Võ Nguyên Giáp thời tướng Giáp còn là giáo viên lịch sử tại Trường Tư thục Thăng Long, Hà Nội.[1]"},{"id":10,"fullName":"Bùi Dương Lịch","note":"Bùi Dương Lịch (chữ Hán: 裴楊瓑; 1757 – 1828)1 có tên tự là Tồn Thành(存成), hiệu Thạch Phủ(石甫) và Tồn Trai(存齋) 2 ; là một nhà giáo và là văn thần trải ba triều đại khác nhau: Lê trung hưng, Tây Sơn và nhà Nguyễn trong lịch sử Việt Nam."}]