[{"id":1,"name":"Trận Bạch Đằng lần thứ nhất năm 938","time":"Năm 938","location":"Sông Bạch Đằng (nay thuộc tỉnh Quảng Ninh, Việt Nam)","result":"Người Việt đại thắng, chấm dứt hoàn toàn thời kỳ Bắc thuộc.","note":"Tham chiếnNam HánNgười Việt (Tĩnh Hải Quân)Chỉ huyLưu Cung Lưu Hoằng Tháo †Ngô Quyền."},{"id":2,"name":"Trận Bạch Đằng lần thứ hai năm 981","note":"Chiến tranh Tống-Việt năm 981 là một cuộc chiến tranh giữa Đại Tống thời Tống Thái Tông và Đại Cồ Việt thời Lê Đại Hành diễn ra từ tháng 1 đến tháng 4 năm 981 trên lãnh thổ Đại Cồ Việt. Kết quả, quân và dân Đại Cồ Việt đã đánh bại quân đội Đại Tống. Sau cuộc chiến này, năm 986, hoàng đế Đại Tống chấp nhận nhà Tiền Lê và ban chế phong cho Lê Đại Hành."},{"id":3,"name":"Trận Bạch Đằng lần thứ ba năm 1288","note":"Trận Bạch Đằng năm 1288 xảy ra trên sông Bạch Đằng thuộc đất Đại Việt, là một trận đánh quan trọng trong các cuộc kháng chiến chống Nguyên Mông trong lịch sử Việt Nam."},{"id":4,"name":"Chiến tranh Nguyên Mông - Đại Việt lần 1","time":"Năm 1258","location":"Bắc Bộ Việt Nam","result":"Đại Việt chiến thắng; Quân Mông Cổ rút về Vân Nam","note":"Chiến tranh Nguyên Mông-Đại Việt lần thứ nhất hay Kháng chiến chống Nguyên Mông lần thứ nhất là cách người Việt Nam gọi cuốc chiến đấu của quân dân Đại Việt chống lại quân đội của đế quốc Mông Cổ do Uriyangqatai (Ngột Lương Hợp Thai) chỉ huy vào trong khoảng thời gian nửa tháng cuối tháng 1 năm 1258 (hay năm Nguyên Phong thứ 7). Cuộc chiến mở đầu với thất bại của quân Đại Việt trong trận Bình Lệ Nguyên, nhưng cuối cùng họ đã đại phá quân Nguyên trong trận Đông Bộ Đầu. Cuộc chiến này đã kết thúc với chiến thắng của nước Đại Việt, ghi dấu công lao của vua Trần Thái Tông trong việc lãnh đạo quân dân chiến đấu chống quân xâm lược."},{"id":5,"name":"Chiến tranh Nguyên Mông - Đại Việt lần 2","time":"Năm 1285","location":"Bắc Bộ và Bắc Trung Bộ Việt Nam","result":"Quân Đại Việt chiến thắng, Nguyên Mông phải rút lui khỏi Đại Việt","note":"Chiến tranh Nguyên Mông-Đại Việt lần 2 là cuộc chiến tranh giữa Đại Nguyên và Đại Việt diễn ra trên lãnh thổ Đại Việt từ cuối tháng 1 đến cuối tháng 5 năm 1285 (dương lịch)."},{"id":6,"name":"Chiến tranh Nguyên Mông - Đại Việt lần 3","time":"năm 1287-1288","location":"Bắc Bộ Việt Nam","result":"Quân Đại Việt toàn thắng, Nguyên Mông phải rút lui khỏi Đại Việt","note":"Chiến tranh Nguyên Mông-Đại Việt lần 3 (theo cách gọi khác ở Việt Nam là Kháng chiến chống quân Nguyên Mông lần thứ 3) là cuộc chiến tranh giữa Đại Nguyên và Đại Việt diễn ra trên lãnh thổ Đại Việt từ tháng 12 năm 1287 đến cuối tháng 4 năm 1288."},{"id":7,"name":"Chiến tranh Tống-Việt, 1075-1077","note":"Chiến tranh Tống - Việt, 1075-1077 là tên gọi cuộc chiến tranh giữa nhà Lý nước Đại Việt và nhà Tống của Trung Quốc vào cuối thế kỷ 11. Giai đoạn đầu, tướng nhà Lý là Lý Thường Kiệt đã chủ động đánh sang đất Tống trong chiến dịch 1075-1076; Giai đoạn sau, quân Lý rút về phòng thủ chống lại cuộc nam tiến của đại quân Tống trong năm 1076-1077 và cuối cùng đẩy lui được quân Tống ra khỏi lãnh thổ Đại Việt."},{"id":8,"name":"Trận Như Nguyệt năm 1077","time":"18 tháng 1, 1077-28 tháng 2, 1077","location":"Sông Như Nguyệt, Đại Việt","result":"Chiến thắng quyết định cho Đại Việt","note":"Trận Như Nguyệt là một trận đánh lớn diễn ra ở một khúc sông Như Nguyệt (hay sông Cầu) vào năm 1077, là trận đánh có tính quyết định của cuộc Chiến tranh Tống - Việt, 1075-1077, và là trận đánh cuối cùng của nhà Tống trên đất Đại Việt. Trận chiến diễn ra trong nhiều tháng, kết thúc bằng chiến thắng của quân đội Đại Việt và thiệt hại nhân mạng lớn của quân Tống, đánh bại hoàn toàn ý chí xâm lược Đại Việt của họ, buộc họ phải thừa nhận Đại Việt là một quốc gia."},{"id":9,"name":"Khởi nghĩa Lam Sơn (1418 - 1427)","time":"1418 - 1427","location":"Việt Nam (kéo dài đến Thuận Hóa)","result":"Thắng lợi hoàn toàn của nghĩa quân Lam Sơn. Hội thề Đông Quan, quân Minh rút về nước","note":"Khởi nghĩa Lam Sơn (1418-1427) (chữ Nôm: 起義藍山) là cuộc khởi nghĩa đánh đuổi quân Minh xâm lược về nước do Lê Lợi lãnh đạo và kết thúc bằng việc giành lại độc lập cho nước Đại Việt và sự thành lập nhà Hậu Lê."},{"id":10,"name":"Trận Tốt Động – Chúc Động năm 1426","time":"5-7 tháng 10 năm Bính Ngọ (1426)","location":"Chúc Sơn, xã Ngọc Sơn, huyện Chương Mĩ, Hà Nội","result":"Chiến thắng quyết định của nghĩa quân Lam Sơn","note":"Trận Tốt Động – Chúc Động là trận đánh diễn ra trong các ngày 5-7 tháng 10 năm Bính Ngọ (1426), giữa nghĩa quân Lam Sơn với quân nhà Minh đóng ở Đông Quan (tức là Thăng Long, Hà Nội). Đây là một chiến thắng quân sự lớn của nghĩa quân Lam Sơn và được nhắc đến trong Bình Ngô đại cáo."}]